[{"title": "Steve Jobs", "categories": ["Biography & Autobiography"], "authors": ["Walter Isaacson", "STEVE JOBS"], "printType": "BOOK", "pageCount": 630, "ratingsCount": 3935, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2011-10-24", "previewLink": "http://books.google.co.in/books?id=6e4cDvhrKhgC&printsec=frontcover&dq=name:Steve+Jobs&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=6e4cDvhrKhgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Draws on more than forty interviews with Steve Jobs, as well as interviews with family members, friends, competitors, and colleagues to offer a look at the co-founder and leading creative force behind the Apple computer company.", "webReaderLink": "http://play.google.com/books/reader?id=6e4cDvhrKhgC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Unbroken", "categories": ["Biography & Autobiography"], "authors": ["Laura Hillenbrand"], "printType": "BOOK", "pageCount": 473, "ratingsCount": 4573, "averageRating": 4.5, "publisher": "Random House Incorporated", "publishedDate": "2010", "previewLink": "http://books.google.co.in/books?id=YFuNDQAAQBAJ&dq=name:Unbroken:+A+World+War+II+Story+of+Survival,+Resilience+and+Redemption&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=YFuNDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Tells the gripping true story of a U.S. airman who was the soul surviver when his bomber crashed into the sea during World War II and had to face thousands of miles of open ocean, leaping sharks, a foundering raft, thirst and starvation, enemy aircraft, and, beyond, a trial even greater. By the #1 best-selling author of Seabiscuit. 200,000 first printing.", "webReaderLink": "http://play.google.com/books/reader?id=YFuNDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Einstein", "categories": ["Biography & Autobiography"], "authors": ["Walter Isaacson"], "printType": "BOOK", "pageCount": 704, "ratingsCount": 60, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2008-09-04", "previewLink": "http://books.google.co.in/books?id=OzSJgdwk5esC&printsec=frontcover&dq=name:Einstein:+His+Life+and+Universe&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=OzSJgdwk5esC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "NOW A MAJOR SERIES 'GENIUS' ON NATIONAL GEOGRAPHIC, PRODUCED BY RON HOWARD AND STARRING GEOFFREY RUSH Einstein is the great icon of our age: the kindly refugee from oppression whose wild halo of hair, twinkling eyes, engaging humanity and extraordinary brilliance made his face a symbol and his name a synonym for genius. He was a rebel and nonconformist from boyhood days. His character, creativity and imagination were related, and they drove both his life and his science. In this marvellously clear and accessible narrative, Walter Isaacson explains how his mind worked and the mysteries of the universe that he discovered. Einstein's success came from questioning conventional wisdom and marvelling at mysteries that struck others as mundane. This led him to embrace a worldview based on respect for free spirits and free individuals. All of which helped make Einstein into a rebel but with a reverence for the harmony of nature, one with just the right blend of imagination and wisdom to transform our understanding of the universe. This new biography, the first since all of Einstein's papers have become available, is the fullest picture yet of one of the key figures of the twentieth century. This is the first full biography of Albert Einstein since all of his papers have become available -- a fully realised portrait of this extraordinary human being, and great genius. Praise for EINSTEIN by Walter Isaacson:- 'YOU REALLY MUST READ THIS.' Sunday Times 'As pithy as Einstein himself.’ New Scientist ‘[A] brilliant biography, rich with newly available archival material.’ Literary Review ‘Beautifully written, it renders the physics understandable.’ Sunday Telegraph ‘Isaacson is excellent at explaining the science. ' Daily Express", "webReaderLink": "http://play.google.com/books/reader?id=OzSJgdwk5esC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Into the Wild", "categories": ["Travel"], "authors": ["Jon Krakauer"], "printType": "BOOK", "pageCount": 240, "ratingsCount": 4475, "averageRating": 3.5, "publisher": "Anchor", "publishedDate": "2009-09-22", "previewLink": "http://books.google.co.in/books?id=waBwNtI6rSwC&dq=name:Into+the+Wild&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=waBwNtI6rSwC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "In April 1992 a young man from a well-to-do family hitchhiked to Alaska and walked alone into the wilderness north of Mt. McKinley. His name was Christopher Johnson McCandless. He had given $25,000 in savings to charity, abandoned his car and most of his possessions, burned all the cash in his wallet, and invented a new life for himself. Four months later, his decomposed body was found by a moose hunter. How McCandless came to die is the unforgettable story of Into the Wild. Immediately after graduating from college in 1991, McCandless had roamed through the West and Southwest on a vision quest like those made by his heroes Jack London and John Muir. In the Mojave Desert he abandoned his car, stripped it of its license plates, and burned all of his cash. He would give himself a new name, Alexander Supertramp, and , unencumbered by money and belongings, he would be free to wallow in the raw, unfiltered experiences that nature presented. Craving a blank spot on the map, McCandless simply threw the maps away. Leaving behind his desperate parents and sister, he vanished into the wild. Jon Krakauer constructs a clarifying prism through which he reassembles the disquieting facts of McCandless's short life. Admitting an interst that borders on obsession, he searches for the clues to the dries and desires that propelled McCandless. Digging deeply, he takes an inherently compelling mystery and unravels the larger riddles it holds: the profound pull of the American wilderness on our imagination; the allure of high-risk activities to young men of a certain cast of mind; the complex, charged bond between fathers and sons. When McCandless's innocent mistakes turn out to be irreversible and fatal, he becomes the stuff of tabloid headlines and is dismissed for his naiveté, pretensions, and hubris. He is said to have had a death wish but wanting to die is a very different thing from being compelled to look over the edge. Krakauer brings McCandless's uncompromising pilgrimage out of the shadows, and the peril, adversity , and renunciation sought by this enigmatic young man are illuminated with a rare understanding--and not an ounce of sentimentality. Mesmerizing, heartbreaking, Into the Wild is a tour de force. The power and luminosity of Jon Krakauer's stoytelling blaze through every page. From the Trade Paperback edition.", "webReaderLink": "http://play.google.com/books/reader?id=waBwNtI6rSwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "John Adams", "categories": ["Juvenile Nonfiction"], "authors": ["Andrew Santella"], "printType": "BOOK", "pageCount": 64, "ratingsCount": null, "averageRating": null, "publisher": "Capstone", "publishedDate": "2002-09", "previewLink": "http://books.google.co.in/books?id=nbzrT6e9ltYC&pg=PA52&dq=name:John+Adams&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=nbzrT6e9ltYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Introduces readers to John Adams and his presidency, and outlines his childhood, the years before his election, and life after his term.", "webReaderLink": "http://play.google.com/books/reader?id=nbzrT6e9ltYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "No Ordinary Time", "categories": ["Biography & Autobiography"], "authors": ["Doris Kearns Goodwin"], "printType": "BOOK", "pageCount": 768, "ratingsCount": 16, "averageRating": 4.5, "publisher": "Simon and Schuster", "publishedDate": "2013-11-05", "previewLink": "http://books.google.co.in/books?id=Hfv-AwAAQBAJ&printsec=frontcover&dq=name:Team+of+Rivals:+The+Political+Genius+of+Abraham+Lincoln&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Hfv-AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Presents a social history of the United States in 1940, along with a moment-by-moment account of Roosevelt's leadership and the private lives of the president and First Lady, whose remarkable partnership transformed America. (This book was previously featured in Forecast.)", "webReaderLink": "http://play.google.com/books/reader?id=Hfv-AwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Marie Antoinette", "categories": ["Biography & Autobiography"], "authors": ["Antonia Fraser"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 5, "averageRating": 4, "publisher": "Nan A. Talese", "publishedDate": "2001", "previewLink": "http://books.google.co.in/books?id=s6YTAQAAIAAJ&q=name:Marie+Antoinette:+The+Journey&dq=name:Marie+Antoinette:+The+Journey&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=s6YTAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Describes the life of Marie Antionette from her betrothal as a fourteen-year-old girl to the future King Louis XVI, through her life in the French court, to her courage in the face of revolutionaries who sent her to the guillotine.", "webReaderLink": "http://play.google.com/books/reader?id=s6YTAQAAIAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Catherine the Great", "categories": ["Biography & Autobiography"], "authors": ["Robert K. Massie"], "printType": "BOOK", "pageCount": 656, "ratingsCount": 3649, "averageRating": 4, "publisher": "Head of Zeus", "publishedDate": "2012-07-17", "previewLink": "http://books.google.co.in/books?id=lV8-AAAAQBAJ&printsec=frontcover&dq=name:Catherine+the+Great:+Portrait+of+a+Woman&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=lV8-AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The story of one of the truly great female rulers in history by an award winning historian. The daughter of an impoverished aristocrat, Catherine was married aged 16 to Grand Duke Peter, heir to the throne of all the Russias, a feckless teenager with a weakness for drink. Catherine was only able to give him an heir by passing off her lover's son as his own. In 1762, Catherine rode out of St Petersburg at the head of an army to arrest her husband. Three months later she became sole empress of the largest empire on earth. She was 33 years old. She ruled Russia as a benevolent autocrat for 34 years,fighting the Turks abroad and rebellion at home, and shepherding her people through the upheavals of the French Revolution. She took on many lovers but gave her heart to General Potemkin, the foremost statesman of her time. She died in 1796 aged 67, revered by her people as 'our mother', praised by Voltaire as a philosopher, reviled by her enemies as the Messalina of the North and remembered in history as Catherine the Great. From this extraordinary life of great events, fabulous splendour and barbaric cruelty, Robert K. Massie has woven a thrilling narrative based on impeccable scholarship and a cinematic eye for detail.", "webReaderLink": "http://play.google.com/books/reader?id=lV8-AAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Immortal Life of Henrietta Lacks", "categories": ["Biography & Autobiography"], "authors": ["Rebecca Skloot"], "printType": "BOOK", "pageCount": null, "ratingsCount": 3985, "averageRating": 4, "publisher": "Pan Macmillan", "publishedDate": "2019-03-07", "previewLink": "http://books.google.co.in/books?id=tzlqDwAAQBAJ&printsec=frontcover&dq=name:The+Immortal+Life+of+Henrietta+Lacks&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=tzlqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "With an introduction by author of The Tidal Zone, Sarah Moss Her name was Henrietta Lacks, but scientists know her as HeLa. Born a poor black tobacco farmer, her cancer cells – taken without her knowledge – became a multimillion-dollar industry and one of the most important tools in medicine. Yet Henrietta’s family did not learn of her ‘immortality’ until more than twenty years after her death, with devastating consequences . . . Rebecca Skloot’s fascinating account is the story of the life, and afterlife, of one woman who changed the medical world for ever. Balancing the beauty and drama of scientific discovery with dark questions about who owns the stuff our bodies are made of, The Immortal Life of Henrietta Lacks is an extraordinary journey in search of the soul and story of a real woman, whose cells live on today in all four corners of the world. Now a HBO film starring Oprah Winfrey and Rose Byrne.", "webReaderLink": "http://play.google.com/books/reader?id=tzlqDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Harry Truman's Excellent Adventure", "categories": ["Biography & Autobiography"], "authors": ["Matthew Algeo"], "printType": "BOOK", "pageCount": 268, "ratingsCount": 18, "averageRating": 4, "publisher": "Chicago Review Press", "publishedDate": "2011", "previewLink": "http://books.google.co.in/books?id=7bWbwTDwDi8C&pg=PA20&dq=name:Truman&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=7bWbwTDwDi8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "From Missouri to New York and back again, this work chronicles the amazing road trip of a former president and his wife and their amusing, failed attempts to keep a low profile.", "webReaderLink": "http://play.google.com/books/reader?id=7bWbwTDwDi8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Martin Heidegger", "categories": ["Philosophy"], "authors": ["Rüdiger Safranski"], "printType": "BOOK", "pageCount": 474, "ratingsCount": null, "averageRating": null, "publisher": "Harvard University Press", "publishedDate": "1999", "previewLink": "http://books.google.co.in/books?id=DX47SpX5cnMC&printsec=frontcover&dq=name:Martin+Heidegger:+Between+Good+and+Evil&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=DX47SpX5cnMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Chronicles the German philosopher's life while exploring his education, schism with the Catholic Church, relationship with the National Socialist revolution, antisemitism, and life and teaching after World War II", "webReaderLink": "http://play.google.com/books/reader?id=DX47SpX5cnMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Oscar Wilde's Scandalous Summer", "categories": ["History"], "authors": ["Antony Edmonds"], "printType": "BOOK", "pageCount": 224, "ratingsCount": null, "averageRating": null, "publisher": "Amberley Publishing Limited", "publishedDate": "2014-07-02", "previewLink": "http://books.google.co.in/books?id=_uIOBAAAQBAJ&pg=PA159&dq=name:Oscar+Wilde&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_uIOBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In the summer of 1894 Oscar Wilde spent eight weeks in Worthing, and it was during this family holiday that he wrote his masterpiece, The Importance of Being Earnest. The Worthing holiday was a microcosm of Wilde's turbulent life during the three years between his falling in love with Lord Alfred Douglas in 1892 and his imprisonment in 1895. Constance Wilde, lonely and depressed, became emotionally involved with her husband s publisher, to whom she wrote a love letter on the day he visited the Wildes in Worthing. Meanwhile Wilde was spending much of his time with the feckless and demanding Douglas, and with three teenage boys he took out sailing, swimming and fishing. One of these boys was Alphonse Conway, with whom Wilde had a sexual relationship, and about whom he was to be questioned at length and to damaging effect in court six months later when he sued Douglas's father, the Marquess of Queensberry, for libel. This book tells for the first time the full story of the Worthing summer, set in the context of the three years of Wilde's life before his downfall. In the final chapter the author reassesses the trials, offering fresh insights into Wilde s attitude to the boys and young men with whom he had sexual relations. There are fifty-six illustrations, over thirty of which are photographs of Worthing as it was in Wilde s time, and three contemporary maps of the town.", "webReaderLink": "http://play.google.com/books/reader?id=_uIOBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Alexander Hamilton: The Formative Years", "categories": ["Biography & Autobiography"], "authors": ["Michael E. Newton"], "printType": "BOOK", "pageCount": 774, "ratingsCount": 1, "averageRating": 5, "publisher": "Eleftheria Publishing", "publishedDate": "2015-07-01", "previewLink": "http://books.google.co.in/books?id=9GvpCQAAQBAJ&pg=PA10&dq=name:Alexander+Hamilton&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=9GvpCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Even though Alexander Hamilton was among the most important Founding Fathers, less is known about his early life than that of any other major Founder. Relatively few records have been found regarding Hamilton’s birth, childhood, and origins in the West Indies. Alexander Hamilton “rarely . . . dwelt upon his personal history” and never recorded his life’s story. Most of Hamilton’s correspondence prior to 1777 was lost during the American Revolution. This has resulted in many gaps in Alexander Hamilton’s biography, which has given rise to much conjecture regarding the details of his life. Relying on new research and extensive analysis of the existing literature, Michael E. Newton presents a more comprehensive and accurate account of Alexander Hamilton’s formative years. Despite being orphaned as a young boy and having his birth be “the subject of the most humiliating criticism,” Alexander Hamilton used his intelligence, determination, and charisma to overcome his questionable origins and desperate situation. As a mere child, Hamilton went to work for a West Indian mercantile company. Within a few short years, Hamilton was managing the firm’s St. Croix operations. Gaining the attention of the island’s leading men, Hamilton was sent to mainland North America for an education, where he immediately fell in with the country’s leading patriots. After using his pen to defend the civil liberties of the Americans against British infringements, Hamilton took up arms in the defense of those rights. Earning distinction in the campaign of 1776–77 at the head of an artillery company, Hamilton attracted the attention of General George Washington, who made him his aide-de-camp. Alexander Hamilton was soon writing some of Washington’s most important correspondence, advising the commander-in-chief on crucial military and political matters, carrying out urgent missions, conferring with French allies, negotiating with the British, and helping Washington manage his spy network. As Washington later attested, Hamilton had become his “principal and most confidential aid.” After serving the commander-in-chief for four years, Hamilton was given a field command and led the assault on Redoubt Ten at Yorktown, the critical engagement in the decisive battle of the War for Independence. By the age of just twenty-five, Alexander Hamilton had proven himself to be one of the most intelligent, brave, hard-working, and patriotic Americans. Alexander Hamilton: The Formative Years tells the dramatic story of how this poor immigrant emerged from obscurity and transformed himself into the most remarkable Founding Father. In riveting detail, Michael E. Newton delivers a fresh and fascinating account of Alexander Hamilton’s origins, youth, and indispensable services during the American Revolution.", "webReaderLink": "http://play.google.com/books/reader?id=9GvpCQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Wild Swans", "categories": ["Biography & Autobiography"], "authors": ["Jung Chang"], "printType": "BOOK", "pageCount": 544, "ratingsCount": 62, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2008-06-20", "previewLink": "http://books.google.co.in/books?id=0sBu1Fj4Ed0C&printsec=frontcover&dq=name:Wild+Swans:+Three+Daughters+of+China&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=0sBu1Fj4Ed0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The story of three generations in twentieth-century China that blends the intimacy of memoir and the panoramic sweep of eyewitness history—a bestselling classic in thirty languages with more than ten million copies sold around the world, now with a new introduction from the author. An engrossing record of Mao’s impact on China, an unusual window on the female experience in the modern world, and an inspiring tale of courage and love, Jung Chang describes the extraordinary lives and experiences of her family members: her grandmother, a warlord’s concubine; her mother’s struggles as a young idealistic Communist; and her parents’ experience as members of the Communist elite and their ordeal during the Cultural Revolution. Chang was a Red Guard briefly at the age of fourteen, then worked as a peasant, a “barefoot doctor,” a steelworker, and an electrician. As the story of each generation unfolds, Chang captures in gripping, moving—and ultimately uplifting—detail the cycles of violent drama visited on her own family and millions of others caught in the whirlwind of history.", "webReaderLink": "http://play.google.com/books/reader?id=0sBu1Fj4Ed0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Cleopatra", "categories": ["Biography & Autobiography"], "authors": ["Stacy Schiff"], "printType": "BOOK", "pageCount": 432, "ratingsCount": 127, "averageRating": 3.5, "publisher": "Little, Brown", "publishedDate": "2010-11-01", "previewLink": "http://books.google.co.in/books?id=dKIo6D9yh3cC&dq=name:Cleopatra:+A+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=dKIo6D9yh3cC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The Pulitzer Prize-winning biographer brings to life the most intriguing woman in the history of the world: Cleopatra, the last queen of Egypt. Her palace shimmered with onyx, garnets, and gold, but was richer still in political and sexual intrigue. Above all else, Cleopatra was a shrewd strategist and an ingenious negotiator. Though her life spanned fewer than forty years, it reshaped the contours of the ancient world. She was married twice, each time to a brother. She waged a brutal civil war against the first when both were teenagers. She poisoned the second. Ultimately she dispensed with an ambitious sister as well; incest and assassination were family specialties. Cleopatra appears to have had sex with only two men. They happen, however, to have been Julius Caesar and Mark Antony, among the most prominent Romans of the day. Both were married to other women. Cleopatra had a child with Caesar and--after his murder--three more with his protégé. Already she was the wealthiest ruler in the Mediterranean; the relationship with Antony confirmed her status as the most influential woman of the age. The two would together attempt to forge a new empire, in an alliance that spelled their ends. Cleopatra has lodged herself in our imaginations ever since. Famous long before she was notorious, Cleopatra has gone down in history for all the wrong reasons. Shakespeare and Shaw put words in her mouth. Michelangelo, Tiepolo, and Elizabeth Taylor put a face to her name. Along the way, Cleopatra's supple personality and the drama of her circumstances have been lost. In a masterly return to the classical sources, Stacy Schiff here boldly separates fact from fiction to rescue the magnetic queen whose death ushered in a new world order. Rich in detail, epic in scope, Schiff 's is a luminous, deeply original reconstruction of a dazzling life.", "webReaderLink": "http://play.google.com/books/reader?id=dKIo6D9yh3cC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Dr. Mary Edwards Walker", "categories": ["Juvenile Nonfiction"], "authors": ["Bonnie Zucker Goldsmith"], "printType": "BOOK", "pageCount": 112, "ratingsCount": null, "averageRating": null, "publisher": "ABDO", "publishedDate": "2010-01-01", "previewLink": "http://books.google.co.in/books?id=Sm4vnJbbtEsC&printsec=frontcover&dq=name:Mary+Edwards+Walker:+America%27s+Only+Female+Medal+of+Honor+Recipient&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Sm4vnJbbtEsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Highlights the life and accomplishments of the woman who earned a medical degree and volunteered her services during the Civil War, earning her a Medal of Honor and helping her crusade for women's rights.", "webReaderLink": "http://play.google.com/books/reader?id=Sm4vnJbbtEsC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Rise of Theodore Roosevelt", "categories": ["Biography & Autobiography"], "authors": ["Edmund Morris"], "printType": "BOOK", "pageCount": 920, "ratingsCount": 1483, "averageRating": 4.5, "publisher": "Random House Incorporated", "publishedDate": "2010", "previewLink": "http://books.google.co.in/books?id=d6LWcqrDDxMC&dq=name:The+Rise+of+Theodore+Roosevelt&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=d6LWcqrDDxMC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A hardcover re-release provides a Pulitzer Prize- and National Book Award-winning biography of Theodore Roosevelt that the Chicago Tribune called \"a classic.\" By the author of Colonel Roosevelt.", "webReaderLink": "http://play.google.com/books/reader?id=d6LWcqrDDxMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Bonhoeffer Abridged", "categories": ["Biography & Autobiography"], "authors": ["Eric Metaxas"], "printType": "BOOK", "pageCount": 256, "ratingsCount": null, "averageRating": null, "publisher": "Thomas Nelson", "publishedDate": "2014-10-07", "previewLink": "http://books.google.co.in/books?id=_O-0AwAAQBAJ&printsec=frontcover&dq=name:Bonhoeffer:+Pastor,+Martyr,+Prophet,+Spy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_O-0AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "From the New York Times best-selling author, Eric Metaxas, an abridged version of the groundbreaking biography of Dietrich Bonhoeffer, one of the greatest heroes of the twentieth century, a man who stood up to Hitler. A definitive, deeply moving narrative, Bonhoeffer is a story of moral courage in the face of monstrous evil. As Adolf Hitler and the Nazis seduced a nation, bullied a continent, and attempted to exterminate the Jews of Europe, a young pastor named Dietrich Bonhoeffer become one of the first to speak out against Hitler. As a double agent, he joined the plot to assassinate the Führer, and he was hanged in Flossenberg concentration camp at age thirty-nine. Since his death, Bonhoeffer has grown to be one of the most fascinating, complex figures of the twentieth century. Bonhoeffer brings the reader face-to-face with a man determined to do the will of God radically, courageously, and joyfully—even to the point of death. It is the story of a life framed by a passion for truth and a commitment to justice on behalf of those who face implacable evil.", "webReaderLink": "http://play.google.com/books/reader?id=_O-0AwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Elon Musk", "categories": ["Businesspeople"], "authors": ["Ashlee Vance"], "printType": "BOOK", "pageCount": 392, "ratingsCount": null, "averageRating": null, "publisher": "Random House", "publishedDate": "2015", "previewLink": "http://books.google.co.in/books?id=nDqwCgAAQBAJ&dq=name:Elon+Musk:+Tesla,+SpaceX,+and+the+Quest+for+a+Fantastic+Future&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=nDqwCgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "South African born Elon Musk is the renowned entrepreneur and innovator behind PayPal, SpaceX, Tesla, and SolarCity. Musk wants to save our planet; he wants to send citizens into space, to form a colony on Mars; he wants to make money while doing these things; and he wants us all to know about it. He is the real-life inspiration for the Iron Man series of films starring Robert Downey Junior. The personal tale of Muskâe(tm)s life comes with all the trappings one associates with a great, drama-filled story. He was a freakishly bright kid who was bullied brutally at school, and abused by his father. In the midst of these rough conditions, and the violence of apartheid South Africa, Musk still thrived academically and attended the University of Pennsylvania, where he paid his own way through school by turning his house into a club and throwing massive parties. He started a pair of huge dot-com successes, including PayPal, which eBay acquired for $1.5 billion in 2002. Musk was forced out as CEO and so began his lost years in which he decided to go it alone and baffled friends by investing his fortune in rockets and electric cars. Meanwhile Muskâe(tm)s marriage disintegrated as his technological obsessions took over his life ... Elon Musk is the Steve Jobs of the present and the future, and for the past twelve months, he has been shadowed by tech reporter, Ashlee Vance. Elon Musk: How the Billionaire CEO of Spacex and Tesla is Shaping our Future is an important, exciting and intelligent account of the real-life Iron Man.", "webReaderLink": "http://play.google.com/books/reader?id=nDqwCgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The River of Doubt", "categories": ["History"], "authors": ["Candice Millard"], "printType": "BOOK", "pageCount": 432, "ratingsCount": 89, "averageRating": 4, "publisher": "Anchor", "publishedDate": "2009-12-16", "previewLink": "http://books.google.co.in/books?id=paSe7yZGUfEC&dq=name:The+River+of+Doubt:+Theodore+Roosevelt%27s+Darkest+Journey&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=paSe7yZGUfEC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "At once an incredible adventure narrative and a penetrating biographical portrait, The River of Doubt is the true story of Theodore Roosevelt’s harrowing exploration of one of the most dangerous rivers on earth. The River of Doubt—it is a black, uncharted tributary of the Amazon that snakes through one of the most treacherous jungles in the world. Indians armed with poison-tipped arrows haunt its shadows; piranhas glide through its waters; boulder-strewn rapids turn the river into a roiling cauldron. After his humiliating election defeat in 1912, Roosevelt set his sights on the most punishing physical challenge he could find, the first descent of an unmapped, rapids-choked tributary of the Amazon. Together with his son Kermit and Brazil’s most famous explorer, Cândido Mariano da Silva Rondon, Roosevelt accomplished a feat so great that many at the time refused to believe it. In the process, he changed the map of the western hemisphere forever. Along the way, Roosevelt and his men faced an unbelievable series of hardships, losing their canoes and supplies to punishing whitewater rapids, and enduring starvation, Indian attack, disease, drowning, and a murder within their own ranks. Three men died, and Roosevelt was brought to the brink of suicide. The River of Doubt brings alive these extraordinary events in a powerful nonfiction narrative thriller that happens to feature one of the most famous Americans who ever lived. From the soaring beauty of the Amazon rain forest to the darkest night of Theodore Roosevelt’s life, here is Candice Millard’s dazzling debut. From the Trade Paperback edition.", "webReaderLink": "http://play.google.com/books/reader?id=paSe7yZGUfEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "No Ordinary Time", "categories": ["History"], "authors": ["Doris Kearns Goodwin"], "printType": "BOOK", "pageCount": 768, "ratingsCount": 2, "averageRating": 5, "publisher": "Simon and Schuster", "publishedDate": "2008-06-30", "previewLink": "http://books.google.co.in/books?id=wQcMDdFC1QEC&printsec=frontcover&dq=name:No+Ordinary+Time:+Franklin+and+Eleanor+Roosevelt:+The+Home+Front+in+World+War+II&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=wQcMDdFC1QEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Winner of the Pulitzer Prize No Ordinary Time is a monumental work, a brilliantly conceived chronicle of one of the most vibrant and revolutionary periods in the history of the United States. With an extraordinary collection of details, Goodwin masterfully weaves together a striking number of story lines—Eleanor and Franklin's marriage and remarkable partnership, Eleanor's life as First Lady, and FDR's White House and its impact on America as well as on a world at war. Goodwin effectively melds these details and stories into an unforgettable and intimate portrait of Eleanor and Franklin Roosevelt and of the time during which a new, modern America was born.", "webReaderLink": "http://play.google.com/books/reader?id=wQcMDdFC1QEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Destiny of the Republic", "categories": ["Biography & Autobiography"], "authors": ["Candice Millard"], "printType": "BOOK", "pageCount": 398, "ratingsCount": 64, "averageRating": 4, "publisher": "Anchor", "publishedDate": "2012", "previewLink": "http://books.google.co.in/books?id=Gss_INMTZQIC&dq=name:Destiny+of+the+Republic:+A+Tale+of+Madness,+Medicine+and+the+Murder+of+a+President&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Gss_INMTZQIC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Presents an account of the twentieth president's political career, offering insight into his background as a scholar and Civil War hero, his battles against the corrupt establishment, and Alexander Graham Bell's failed attempt to save him from an assassin's bullet.", "webReaderLink": "http://play.google.com/books/reader?id=Gss_INMTZQIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "In The Garden of Beasts", "categories": ["Biography & Autobiography"], "authors": ["Erik Larson"], "printType": "BOOK", "pageCount": 592, "ratingsCount": null, "averageRating": null, "publisher": "Random House", "publishedDate": "2011-08-31", "previewLink": "http://books.google.co.in/books?id=JWhYyzGQ8WcC&printsec=frontcover&dq=name:In+the+Garden+of+Beasts:+Love,+Terror,+and+an+American+Family+in+Hitler%27s+Berlin&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=JWhYyzGQ8WcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'A compelling tale... a narrative that makes such a brave effort to see history as it evolves and not as it becomes.' SPECTATOR Suffused with the tense atmosphere of the times, and with brilliant portraits of Hitler, Goebbels, Goering and Himmler amongst others, Erik Larson's new book sheds unique light on events as they unfold, resulting in an unforgettable, addictively readable work of narrative history. Berlin,1933. William E. Dodd, a mild-mannered academic from Chicago, has to his own and everyone else's surprise, become America's first ambassador to Hitler's Germany, in a year that proves to be a turning point in history. Dodd and his family, notably his vivacious daughter, Martha, observe at first-hand the many changes - some subtle, some disturbing, and some horrifically violent - that signal Hitler's consolidation of power. Dodd has little choice but to associate with key figures in the Nazi party, his increasingly concerned cables make little impact on an indifferent U.S. State Department, while Martha is drawn to the Nazis and their vision of a 'New Germany' and has a succession of affairs with senior party players, including first chief of the Gestapo, Rudolf Diels. But as the year darkens, Dodd and his daughter find their lives transformed and any last illusion they might have about Hitler are shattered by the violence of the 'Night of the Long Knives' in the summer of 1934 that established him as supreme dictator . . .", "webReaderLink": "http://play.google.com/books/reader?id=JWhYyzGQ8WcC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Nicholas and Alexandra", "categories": ["Biography & Autobiography"], "authors": ["Robert K. Massie"], "printType": "BOOK", "pageCount": 640, "ratingsCount": 31, "averageRating": 4.5, "publisher": "Head of Zeus", "publishedDate": "2013-01-01", "previewLink": "http://books.google.co.in/books?id=EUM-AAAAQBAJ&pg=PT21&dq=name:Nicholas+And+Alexandra&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=EUM-AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In this commanding book, Robert K Massie sweeps readers back to the extraordinary world of imperial Russia to tell the story of the Romanovs. Nicholas's political naivete, Alexandra's obsession with the corrupt mystic Rasputin, and little Alexis's brave struggle with haemophilia. Against a lavish backdrop of luxury and intrigue, Massie unfolds a powerful drama of passion and history – the story of a doomed empire and the death-marked royals who watched it crumble.", "webReaderLink": "http://play.google.com/books/reader?id=EUM-AAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Benjamin Franklin", "categories": ["Biography & Autobiography"], "authors": ["Walter Isaacson"], "printType": "BOOK", "pageCount": 608, "ratingsCount": 1553, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2003-07-31", "previewLink": "http://books.google.co.in/books?id=oIW915dDMBwC&printsec=frontcover&dq=name:Benjamin+Franklin:+An+American+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=oIW915dDMBwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In this authoritative and engrossing full-scale biography, Walter Isaacson, bestselling author of Einstein and Steve Jobs, shows how the most fascinating of America's founders helped define our national character. Benjamin Franklin is the founding father who winks at us, the one who seems made of flesh rather than marble. In a sweeping narrative that follows Franklin’s life from Boston to Philadelphia to London and Paris and back, Walter Isaacson chronicles the adventures of the runaway apprentice who became, over the course of his eighty-four-year life, America’s best writer, inventor, media baron, scientist, diplomat, and business strategist, as well as one of its most practical and ingenious political leaders. He explores the wit behind Poor Richard’s Almanac and the wisdom behind the Declaration of Independence, the new nation’s alliance with France, the treaty that ended the Revolution, and the compromises that created a near-perfect Constitution. In this colorful and intimate narrative, Isaacson provides the full sweep of Franklin’s amazing life, showing how he helped to forge the American national identity and why he has a particular resonance in the twenty-first century.", "webReaderLink": "http://play.google.com/books/reader?id=oIW915dDMBwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Power Broker", "categories": null, "authors": ["Robert A. Caro"], "printType": "BOOK", "pageCount": 1246, "ratingsCount": 18, "averageRating": 4.5, "publisher": "Bodley Head Childrens", "publishedDate": "2017-10-05", "previewLink": "http://books.google.co.in/books?id=CWI-MQAACAAJ&dq=name:The+Power+Broker:+Robert+Moses+and+the+Fall+of+New+York&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=CWI-MQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The Power Broker by Robert A. Caro is a riveting and timeless account of power, politics and the city of New York by 'the greatest political biographer of our times' (Sunday Times) - chosen by Time magazine as one of the 100 Best Non-Fiction Books of All Time and by the Modern Library as one of the 100 Greatest Books of the Twentieth Century. Now also a Sunday Times Bestseller. The Power Broker tells the story of Robert Moses, the single most powerful man in New York for almost half a century and the greatest builder America (and probably the world) has ever known. Without ever once being elected to office, he created for himself a position of supreme and untouchable authority, allowing him to utterly reshape the city of New York, turning it into the city we know today, while at the same time blighting the lives of millions and remaining accountable to no one. First published in 1974, this monumental classic is now widely acknowledged to be one of the greatest books of its kind.", "webReaderLink": "http://play.google.com/books/reader?id=CWI-MQAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Thomas Jefferson: The Art of Power", "categories": ["Biography & Autobiography"], "authors": ["Jon Meacham"], "printType": "BOOK", "pageCount": 800, "ratingsCount": 1647, "averageRating": 4, "publisher": "Random House", "publishedDate": "2012-11-13", "previewLink": "http://books.google.co.in/books?id=oeFUTfvFquEC&printsec=frontcover&dq=name:Thomas+Jefferson:+The+Art+of+Power&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=oeFUTfvFquEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The New York Times Book Review • The Washington Post • Entertainment Weekly • The Seattle Times • St. Louis Post-Dispatch • Bloomberg Businessweek In this magnificent biography, the Pulitzer Prize–winning author of American Lion and Franklin and Winston brings vividly to life an extraordinary man and his remarkable times. Thomas Jefferson: The Art of Power gives us Jefferson the politician and president, a great and complex human being forever engaged in the wars of his era. Philosophers think; politicians maneuver. Jefferson’s genius was that he was both and could do both, often simultaneously. Such is the art of power. Thomas Jefferson hated confrontation, and yet his understanding of power and of human nature enabled him to move men and to marshal ideas, to learn from his mistakes, and to prevail. Passionate about many things—women, his family, books, science, architecture, gardens, friends, Monticello, and Paris—Jefferson loved America most, and he strove over and over again, despite fierce opposition, to realize his vision: the creation, survival, and success of popular government in America. Jon Meacham lets us see Jefferson’s world as Jefferson himself saw it, and to appreciate how Jefferson found the means to endure and win in the face of rife partisan division, economic uncertainty, and external threat. Drawing on archives in the United States, England, and France, as well as unpublished Jefferson presidential papers, Meacham presents Jefferson as the most successful political leader of the early republic, and perhaps in all of American history. The father of the ideal of individual liberty, of the Louisiana Purchase, of the Lewis and Clark expedition, and of the settling of the West, Jefferson recognized that the genius of humanity—and the genius of the new nation—lay in the possibility of progress, of discovering the undiscovered and seeking the unknown. From the writing of the Declaration of Independence to elegant dinners in Paris and in the President’s House; from political maneuverings in the boardinghouses and legislative halls of Philadelphia and New York to the infant capital on the Potomac; from his complicated life at Monticello, his breathtaking house and plantation in Virginia, to the creation of the University of Virginia, Jefferson was central to the age. Here too is the personal Jefferson, a man of appetite, sensuality, and passion. The Jefferson story resonates today not least because he led his nation through ferocious partisanship and cultural warfare amid economic change and external threats, and also because he embodies an eternal drama, the struggle of the leadership of a nation to achieve greatness in a difficult and confounding world. Praise for Thomas Jefferson: The Art of Power “This is probably the best single-volume biography of Jefferson ever written.”—Gordon S. Wood “A big, grand, absorbing exploration of not just Jefferson and his role in history but also Jefferson the man, humanized as never before.”—Entertainment Weekly “[Meacham] captures who Jefferson was, not just as a statesman but as a man. . . . By the end of the book . . . the reader is likely to feel as if he is losing a dear friend. . . . [An] absorbing tale.”—The Christian Science Monitor “This terrific book allows us to see the political genius of Thomas Jefferson better than we have ever seen it before. In these endlessly fascinating pages, Jefferson emerges with such vitality that it seems as if he might still be alive today.”—Doris Kearns Goodwin", "webReaderLink": "http://play.google.com/books/reader?id=oeFUTfvFquEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Tesla: Inventor of the Modern", "categories": ["Biography & Autobiography"], "authors": ["Richard Munson"], "printType": "BOOK", "pageCount": 320, "ratingsCount": 4, "averageRating": 3.5, "publisher": "W. W. Norton & Company", "publishedDate": "2018-05-22", "previewLink": "http://books.google.co.in/books?id=gMQ6DwAAQBAJ&printsec=frontcover&dq=name:Tesla:+Inventor+of+the+Modern&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=gMQ6DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Tesla’s inventions transformed our world, and his visions have continued to inspire great minds for generations. Nikola Tesla invented the radio, robots, and remote control. His electric induction motors run our appliances and factories, yet he has been largely overlooked by history. In Tesla, Richard Munson presents a comprehensive portrait of this farsighted and underappreciated mastermind. When his first breakthrough—alternating current, the basis of the electric grid—pitted him against Thomas Edison’s direct-current empire, Tesla’s superior technology prevailed. Unfortunately, he had little business sense and could not capitalize on this success. His most advanced ideas went unrecognized for decades: forty years in the case of the radio patent, longer still for his ideas on laser beam technology. Although penniless during his later years, he never stopped imagining. In the early 1900s, he designed plans for cell phones, the Internet, death-ray weapons, and interstellar communications. His ideas have lived on to shape the modern economy. Who was this genius? Drawing on letters, technical notebooks, and other primary sources, Munson pieces together the magnificently bizarre personal life and mental habits of the enigmatic inventor. Born during a lightning storm at midnight, Tesla died alone in a New York City hotel. He was an acute germaphobe who never shook hands and required nine napkins when he sat down to dinner. Strikingly handsome and impeccably dressed, he spoke eight languages and could recite entire books from memory. Yet Tesla’s most famous inventions were not the product of fastidiousness or linear thought but of a mind fueled by both the humanities and sciences: he conceived the induction motor while walking through a park and reciting Goethe’s Faust. Tesla worked tirelessly to offer electric power to the world, to introduce automatons that would reduce life’s drudgery, and to develop machines that might one day abolish war. His story is a reminder that technology can transcend the marketplace and that profit is not the only motivation for invention. This clear, authoritative, and highly readable biography takes account of all phases of Tesla’s remarkable life.", "webReaderLink": "http://play.google.com/books/reader?id=gMQ6DwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Six Wives Of Henry VIII", "categories": ["Biography & Autobiography"], "authors": ["Alison Weir"], "printType": "BOOK", "pageCount": 656, "ratingsCount": 45, "averageRating": 4, "publisher": "Random House", "publishedDate": "2011-05-31", "previewLink": "http://books.google.co.in/books?id=M1yHXitDdyQC&printsec=frontcover&dq=name:The+Six+Wives+of+Henry+VIII&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=M1yHXitDdyQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "One of the most powerful monarchs in British history, Henry VIII ruled England in unprecedented splendour. In this remarkable composite biography, Alison Weir brings Henry's six wives vividly to life, revealing each as a distinct and compelling personality in her own right. Drawing upon the rich fund of documentary material from the Tudor period, The Six Wives of Henry VIII shows us a court where personal needs frequently influenced public events and where a life of gorgeously ritualised pleasure was shot through with ambition, treason and violence.", "webReaderLink": "http://play.google.com/books/reader?id=M1yHXitDdyQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Peter the Great: His Life and World", "categories": ["Biography & Autobiography"], "authors": ["Robert K. Massie"], "printType": "BOOK", "pageCount": 928, "ratingsCount": 24, "averageRating": 4, "publisher": "Random House", "publishedDate": "2012-02-22", "previewLink": "http://books.google.co.in/books?id=ekdTC72st9QC&dq=name:Peter+the+Great:+His+Life+and+World&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ekdTC72st9QC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "From the Modern Library’s new set of beautifully repackaged hardcover classics by Robert K. Massie—also available are Nicholas and Alexandra and The Romanovs Against the monumental canvas of seventeenth- and eighteenth-century Europe and Russia unfolds the magnificent story of Peter the Great, crowned co-tsar at the age of ten. The acclaimed author of Catherine the Great, Robert K. Massie delves deep into the life of this captivating historical figure, chronicling the pivotal events that shaped a boy into a legend—including his “incognito” travels in Europe, his unquenchable curiosity about Western ways, his obsession with the sea and establishment of the stupendous Russian navy, his creation of an unbeatable army, his transformation of Russia, and his relationships with those he loved most: Catherine, the robust yet gentle peasant, his loving mistress, wife, and successor; and Menshikov, the charming, bold, unscrupulous prince who rose to wealth and power through Peter’s friendship. Impetuous and stubborn, generous and cruel, tender and unforgiving, a man of enormous energy and complexity, Peter the Great is brought fully to life. The Modern Library of the World’s Best Books Peter the Great Winner of the Pulitzer Prize “Enthralling . . . as fascinating as any novel and more so than most.”—The New York Times Book Review Nicholas and Alexandra “A magnificent and intimate picture . . . Not only the main characters but a whole era become alive and comprehensible.”—Harper’s The Romanovs “Riveting . . . unfolds like a detective story.”—Los Angeles Times Book Review", "webReaderLink": "http://play.google.com/books/reader?id=ekdTC72st9QC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Six Wives Of Henry VIII", "categories": ["Biography & Autobiography"], "authors": ["Alison Weir"], "printType": "BOOK", "pageCount": 656, "ratingsCount": 45, "averageRating": 4, "publisher": "Random House", "publishedDate": "2011-05-31", "previewLink": "http://books.google.co.in/books?id=M1yHXitDdyQC&printsec=frontcover&dq=name:The+Wives+of+Henry+VIII&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=M1yHXitDdyQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "One of the most powerful monarchs in British history, Henry VIII ruled England in unprecedented splendour. In this remarkable composite biography, Alison Weir brings Henry's six wives vividly to life, revealing each as a distinct and compelling personality in her own right. Drawing upon the rich fund of documentary material from the Tudor period, The Six Wives of Henry VIII shows us a court where personal needs frequently influenced public events and where a life of gorgeously ritualised pleasure was shot through with ambition, treason and violence.", "webReaderLink": "http://play.google.com/books/reader?id=M1yHXitDdyQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Titan", "categories": ["Biography & Autobiography"], "authors": ["Ron Chernow"], "printType": "BOOK", "pageCount": 832, "ratingsCount": 18, "averageRating": 4, "publisher": "Vintage", "publishedDate": "2007-12-18", "previewLink": "http://books.google.co.in/books?id=Mleb5acWQF4C&dq=name:Titan:+The+Life+of+John+D.+Rockefeller,+Sr.&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Mleb5acWQF4C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "National Book Critics Circle Award Finalist From the acclaimed, award-winning author of Alexander Hamilton: here is the essential, endlessly engrossing biography of John D. Rockefeller, Sr.—the Jekyll-and-Hyde of American capitalism. In the course of his nearly 98 years, Rockefeller was known as both a rapacious robber baron, whose Standard Oil Company rode roughshod over an industry, and a philanthropist who donated money lavishly to universities and medical centers. He was the terror of his competitors, the bogeyman of reformers, the delight of caricaturists—and an utter enigma. Drawing on unprecedented access to Rockefeller’s private papers, Chernow reconstructs his subjects’ troubled origins (his father was a swindler and a bigamist) and his single-minded pursuit of wealth. But he also uncovers the profound religiosity that drove him “to give all I could”; his devotion to his father; and the wry sense of humor that made him the country’s most colorful codger. Titan is a magnificent biography—balanced, revelatory, elegantly written.", "webReaderLink": "http://play.google.com/books/reader?id=Mleb5acWQF4C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "American Indian History Day by Day", "categories": ["History"], "authors": ["Roger M. Carpenter"], "printType": "BOOK", "pageCount": 429, "ratingsCount": null, "averageRating": null, "publisher": "ABC-CLIO", "publishedDate": "2012", "previewLink": "http://books.google.co.in/books?id=Nmmjo_PG6VsC&pg=PA65&dq=name:Undaunted+Courage:+The+Pioneering+First+Mission+to+Explore+America%27s+Wild+Frontier&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Nmmjo_PG6VsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This unique, day-by-day compilation of important events helps students understand and appreciate five centuries of Native American history. * A chronology provides an at-a-glance overview of 500 years of Native American history * A bibliography that guides students and other researchers to print and online resources for further information", "webReaderLink": "http://play.google.com/books/reader?id=Nmmjo_PG6VsC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Theodore Rex", "categories": ["Biography & Autobiography"], "authors": ["Edmund Morris"], "printType": "BOOK", "pageCount": 792, "ratingsCount": 24, "averageRating": 4, "publisher": "Random House", "publishedDate": "2010-11-24", "previewLink": "http://books.google.co.in/books?id=O9r_p6Kbi24C&dq=name:Theodore+Rex&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=O9r_p6Kbi24C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Theodore Rex is the story—never fully told before—of Theodore Roosevelt’s two world-changing terms as President of the United States. A hundred years before the catastrophe of September 11, 2001, “TR” succeeded to power in the aftermath of an act of terrorism. Youngest of all our chief executives, he rallied a stricken nation with his superhuman energy, charm, and political skills. He proceeded to combat the problems of race and labor relations and trust control while making the Panama Canal possible and winning the Nobel Peace Prize. But his most historic achievement remains his creation of a national conservation policy, and his monument millions of acres of protected parks and forest. Theodore Rex ends with TR leaving office, still only fifty years old, his future reputation secure as one of our greatest presidents.", "webReaderLink": "http://play.google.com/books/reader?id=O9r_p6Kbi24C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Professor and the Madman", "categories": ["Biography & Autobiography"], "authors": ["Simon Winchester"], "printType": "BOOK", "pageCount": 242, "ratingsCount": 3625, "averageRating": 3.5, "publisher": "Harper Collins", "publishedDate": "1999-09", "previewLink": "http://books.google.co.in/books?id=LLqNPby9I9oC&dq=name:The+Professor+and+the+Madman:+A+Tale+of+Murder,+Insanity+and+the+Making+of+the+Oxford+English+Dictionary&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=LLqNPby9I9oC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The Professor and the Madman, masterfully researched and eloquently written, is an extraordinary tale of madness, genius, and the incredible obsessions of two remarkable men that led to the making of the Oxford English Dictionary--and literary history. The compilation of the OED, begun in 1857, was one of the most ambitious projects ever undertaken. As definitions were collected, the overseeing committee, led by Professor James Murray, discovered that one man, Dr. W C. Minor, had submitted more than ten thousand. When the committee insisted on honoring him, a shocking truth came to light: Dr. Minor, an American Civil War veteran, was also an inmate at an asylum for the criminally insane.", "webReaderLink": "http://play.google.com/books/reader?id=LLqNPby9I9oC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Last Lion, The: Volume 1", "categories": ["Biography & Autobiography"], "authors": ["William Manchester"], "printType": "BOOK", "pageCount": 992, "ratingsCount": 1, "averageRating": 5, "publisher": "Little, Brown", "publishedDate": "1988", "previewLink": "http://books.google.co.in/books?id=cOzN2Eb8UnEC&pg=PP1&dq=name:The+Last+Lion:+Winston+Spencer+Churchill:+Visions+of+Glory+1874-1932&hl=&cd=1&source=gbs_api", "language": "en", "description": "The first volume in William Manchester's masterful, magnum opus account of Winston Churchill's life. The Last Lion: Visions of Glory follows the first fifty-eight years of Churchill's life--the years that mold him into the man who will become one of the most influential politicians of the twentieth century. In this, the first volume, Manchester follows Churchill from his birth to 1932, when he began to warn against the re-militarization of Germany. Born of an American mother and the gifted but unstable son of a duke, his childhood was one of wretched neglect. He sought glory on the battlefields of Cuba, Sudan, India, South Africa and the trenches of France. In Parliament he was the prime force behind the creation of Iraq and Jordan, laid the groundwork for the birth of Israel, and negotiated the independence of the Irish Free State. Yet, as Chancellor of the Exchequer he plunged England into economic crisis, and his fruitless attempt to suppress Gandhi's quest for Indian independence brought political chaos to Britain. Throughout, Churchill learned the lessons that would prepare him for the storm to come, and as the 1930's began, he readied himself for the coming battle against Nazism--an evil the world had never before seen.", "webReaderLink": "http://play.google.com/books/reader?id=cOzN2Eb8UnEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Encounters and Dialogues with Martin Heidegger, 1929-1976", "categories": ["Biography & Autobiography"], "authors": ["Heinrich Wiegand Petzet", "Parvis Emad"], "printType": "BOOK", "pageCount": 251, "ratingsCount": null, "averageRating": null, "publisher": "University of Chicago Press", "publishedDate": "1993-06-01", "previewLink": "http://books.google.co.in/books?id=aI9pYA7rsPUC&printsec=frontcover&dq=name:Encounters+and+Dialogues+with+Martin+Heidegger,+1929-1976&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=aI9pYA7rsPUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Despite his predominance in twentieth-century philosophy, no intellectual biography of Martin Heidegger has yet appeared. This account of Heidegger's personal relations, originally published in German and extensively corrected by the author for this translation, enlarges our understanding of a complex figure. A well-known art historian and an intimate friend of Heidegger's, Heinrich Wiegand Petzet provides a rich portrait of Heidegger that is part memoir, part biography, and part cultural history. By recounting chronologically a series of encounters between the two friends from their meeting in 1929 until the philosopher's death in 1976, as well as between Heidegger and other contemporaries, Petzet reveals not only new aspects of Heidegger's thought and attitudes toward the historical and intellectual events of his time but also the greater cultural and social context in which he articulated his thought.", "webReaderLink": "http://play.google.com/books/reader?id=aI9pYA7rsPUC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Frida", "categories": ["Biography & Autobiography"], "authors": ["Hayden Herrera"], "printType": "BOOK", "pageCount": 528, "ratingsCount": 7, "averageRating": 4.5, "publisher": "Bloomsbury Publishing", "publishedDate": "2018-08-09", "previewLink": "http://books.google.co.in/books?id=9zhpDwAAQBAJ&printsec=frontcover&dq=name:Frida:+A+Biography+of+Frida+Kahlo&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=9zhpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A reissue of the beautifully illustrated and authoritative biography of Frida Kahlo, publishing in time for a major London exhibition Frida is the story of one of the twentieth century's most extraordinary women, the painter Frida Kahlo. Born near Mexico City, she grew up during the turbulent days of the Mexican Revolution and, at eighteen, was the victim of an accident that left her crippled and unable to bear children. To salvage what she could from her unhappy situation, Kahlo had to learn to keep still – so she began to paint. Kahlo's unique talent was to make her one of the century's most enduring artists. But her remarkable paintings were only one element of a rich and dramatic life. Frida is also the story of her tempestuous marriage to the muralist Diego Rivera, her love affairs with numerous, diverse men such as Isamu Noguchi and Leon Trotsky, her involvement with the Communist Party, her absorption in Mexican folklore and culture, and of the inspiration behind her unforgettable art.", "webReaderLink": "http://play.google.com/books/reader?id=9zhpDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Mountains Beyond Mountains", "categories": ["Biography & Autobiography"], "authors": ["Tracy Kidder"], "printType": "BOOK", "pageCount": 336, "ratingsCount": 63, "averageRating": 4, "publisher": "Random House", "publishedDate": "2003-09-09", "previewLink": "http://books.google.co.in/books?id=nEjXAmEBAi8C&dq=name:Mountains+Beyond+Mountains:+The+Quest+of+Dr.+Paul+Farmer,+a+Man+Who+Would+Cure+the+World&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=nEjXAmEBAi8C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "“[A] masterpiece . . . an astonishing book that will leave you questioning your own life and political views . . . Kidder opens a window into Farmer’s soul, letting the reader peek in and see what truly makes the good doctor tick.”—Nicholas Thomas, USA Today In medical school, Paul Farmer found his life’s calling: to cure infectious diseases and to bring the lifesaving tools of modern medicine to those who need them most. Tracy Kidder’s magnificent account shows how one person can make a difference in solving global health problems through a clear-eyed understanding of the interaction of politics, wealth, social systems, and disease. Profound and powerful, Mountains Beyond Mountains takes us from Harvard to Haiti, Peru, Cuba, and Russia as Farmer changes people’s minds through his dedication to the philosophy that “the only real nation is humanity.” Praise for Mountains Beyond Mountains “A true-to-life fairy tale, one that inspires you to believe in happy endings . . . Its stark sense of reality comes as much from the grit between the pages as from the pure gold those pages spin.”—Laura Claridge, Boston Sunday Globe “Stunning . . . Mountains Beyond Mountains will move you, restore your faith in the ability of one person to make a difference in these increasingly maddening, dispiriting times.”—John Wilkens, The San Diego Union-Tribune “Easily the most fascinating, most entertaining and, yes, most inspiring work of nonfiction I’ve read this year.”—Charles Matthews, San Jose Mercury News “It’ll fill you equally with wonder and hope.”—Cathy Burke, People “In this excellent work, Pulitzer Prize-winner Kidder immerses himself in and beautifully explores the rich drama that exists in the life of Dr. Paul Farmer. . . . Throughout, Kidder captures the almost saintly effect Farmer has on those whom he treats.”—Publisher’s Weekly (starred review) “[A] skilled and graceful exploration of the soul of an astonishing human being.”—Kirkus Reviews (starred review)", "webReaderLink": "http://play.google.com/books/reader?id=nEjXAmEBAi8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "In the Name of Social Democracy", "categories": ["Political Science"], "authors": ["Gerassimos Moschonas"], "printType": "BOOK", "pageCount": 370, "ratingsCount": null, "averageRating": null, "publisher": "Verso", "publishedDate": "2002", "previewLink": "http://books.google.co.in/books?id=Wa0ruf73DEkC&pg=PA164&dq=name:The+Path+to+Power&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Wa0ruf73DEkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The focal point for this study is the emergent new social democracy of the 21st century. Moschonas examines the process of de-social-democratisation, which affects every aspect of the social democratic phenomenon.", "webReaderLink": "http://play.google.com/books/reader?id=Wa0ruf73DEkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Elizabeth the Queen", "categories": ["Biography & Autobiography"], "authors": ["Sally Bedell Smith"], "printType": "BOOK", "pageCount": 663, "ratingsCount": 28, "averageRating": 4, "publisher": "Random House Incorporated", "publishedDate": "2012-01", "previewLink": "http://books.google.co.in/books?id=47abXX9zOr4C&dq=name:Elizabeth+the+Queen:+The+Life+of+a+Modern+Monarch&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=47abXX9zOr4C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A tribute to the life and enduring reign of Elizabeth II draws on numerous interviews and previously undisclosed documents to juxtapose the queen's public and private lives, providing coverage of such topics as her teen romance with Philip, her contributions during World War II and the scandals that have challenged her family. (This book was previously listed in Forecast.)", "webReaderLink": "http://play.google.com/books/reader?id=47abXX9zOr4C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Longitude", "categories": ["Biography & Autobiography"], "authors": ["Dava Sobel"], "printType": "BOOK", "pageCount": 208, "ratingsCount": 5, "averageRating": 4, "publisher": "Bloomsbury Publishing USA", "publishedDate": "2010-07-05", "previewLink": "http://books.google.co.in/books?id=lW8DYSPa6fEC&dq=name:Longitude:+The+True+Story+of+a+Lone+Genius+Who+Solved+the+Greatest+Scientific+Problem+of+His+Time&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=lW8DYSPa6fEC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The dramatic human story of an epic scientific quest and of one man's forty-year obsession to find a solution to the thorniest scientific dilemma of the day--\"the longitude problem.\" Anyone alive in the eighteenth century would have known that \"the longitude problem\" was the thorniest scientific dilemma of the day-and had been for centuries. Lacking the ability to measure their longitude, sailors throughout the great ages of exploration had been literally lost at sea as soon as they lost sight of land. Thousands of lives and the increasing fortunes of nations hung on a resolution. One man, John Harrison, in complete opposition to the scientific community, dared to imagine a mechanical solution-a clock that would keep precise time at sea, something no clock had ever been able to do on land. Longitude is the dramatic human story of an epic scientific quest and of Harrison's forty-year obsession with building his perfect timekeeper, known today as the chronometer. Full of heroism and chicanery, it is also a fascinating brief history of astronomy, navigation, and clockmaking, and opens a new window on our world.", "webReaderLink": "http://play.google.com/books/reader?id=lW8DYSPa6fEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Snowball", "categories": ["Business & Economics"], "authors": ["Alice Schroeder"], "printType": "BOOK", "pageCount": 832, "ratingsCount": 19, "averageRating": 4, "publisher": "A&C Black", "publishedDate": "2009-09-16", "previewLink": "http://books.google.co.in/books?id=NCB3ULgTzhkC&printsec=frontcover&dq=name:The+Snowball:+Warren+Buffett+and+the+Business+of+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=NCB3ULgTzhkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Shortlisted for the Financial Times and Goldman Sachs Business Book of the Year Prize 2008 The Snowball is the first and will be the only biography of the world's richest man, Warren Buffett, written with his full cooperation and collaboration. Combining a unique blend of \"The Sage of Omaha's\" business savvy, life story and philosophy, The Snowball is essential reading for anyone wishing to discover and replicate the secrets of his business and life success. Warren Buffett is arguably the world's greatest investor. Even as a child he was fascinated by the concept of risk and probability, setting up his first business at the age of six. In 1964 he bought struggling Massachusetts textile firm Berkshire Hathaway and grew it to be the 12th largest corporation in the US purely through the exercise of sound investing principles - a feat never equalled in the annals of business. Despite an estimated net worth of around US$62 billion, Buffett leads an intriguingly frugal life taking home a salary of only £50,000 a year. His only indulgence is a private jet, an extravagance he wryly acknowledges by calling it \"The Indefensible\". In 2006, he made the largest charitable donation on record, with most of it going to the Bill & Melinda Gates Foundation. The Snowball provides a comprehensive, richly detailed insight one of the world's most extraordinary and much loved public figures.", "webReaderLink": "http://play.google.com/books/reader?id=NCB3ULgTzhkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Washington", "categories": ["Biography & Autobiography"], "authors": ["Ron Chernow"], "printType": "BOOK", "pageCount": 928, "ratingsCount": 19, "averageRating": 4.5, "publisher": "Penguin UK", "publishedDate": "2010-12-02", "previewLink": "http://books.google.co.in/books?id=Oxk9HDvawAMC&printsec=frontcover&dq=name:Washington:+A+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Oxk9HDvawAMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The celebrated Ron Chernow provides a richly nuanced portrait of the father of America. With a breadth and depth matched by no other one-volume life, he carries the reader through Washington's troubled boyhood, his precocious feats in the French and Indian Wars, his creation of Mount Vernon, his heroic exploits with the Continental Army, his presiding over the Constitutional Convention and his magnificent performance as America's first president. Despite the reverence his name inspires Washington remains a waxwork to many readers, worthy but dull, a laconic man of remarkable self-control. But in this groundbreaking work Chernow revises forever the uninspiring stereotype. He portrays Washington as a strapping, celebrated horseman, elegant dancer and tireless hunter, who guarded his emotional life with intriguing ferocity. Not only did Washington gather around himself the foremost figures of the age, including James Madison, Alexander Hamilton, John Adams, and Thomas Jefferson, he orchestrated their actions to help realise his vision for the new federal government, define the separation of powers, and establish the office of the presidency. Ron Chernow takes us on a page-turning journey through all the formative events of America's founding. This is a magisterial work from one of America's foremost writers and historians.", "webReaderLink": "http://play.google.com/books/reader?id=Oxk9HDvawAMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Story of My Life", "categories": null, "authors": ["Helen Keller"], "printType": "BOOK", "pageCount": 272, "ratingsCount": 25, "averageRating": 3.5, "publisher": "Om Books International", "publishedDate": "2016-02-18", "previewLink": "http://books.google.co.in/books?id=X-qaCwAAQBAJ&printsec=frontcover&dq=name:Helen+Keller:+A+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=X-qaCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "“...every one who wishes to gain true knowledge must climb the Hill Difficulty alone, and since there is no royal road to the summit, I must zigzag it in my own way. I slip back many times, I fall, I stand still, I run against the edge of hidden obstacles, I lose my temper and find it again and keep it better, I trudge on, I gain a little, I feel encouraged, I get more eager and climb higher and begin to see the widening horizon. Every struggle is a victory. One more effort and I reach the luminous cloud, the blue depths of the sky, the uplands of my desire.” HELEN KELLER was born on June 27, 1880 in Tuscumbia, Alabama. At nineteen months old an acute illness nearly took her life and left her deaf and blind. At the recommendation of Alexander Graham Bell, her parents contacted the Perkins Institute for the Blind in Boston, and Anne Sullivan was sent to tutor Helen. The story of their early years together, and of Helen’s remarkable psychological and intellectual growth, is told in The Story of My Life, which first appeared in installments in Ladies’ Home Journal in 1902. With Anne Sullivan, “Teacher,” at her side, Helen Keller graduated from Radcliffe College in 1904, an extraordinary accomplishment for any woman of her time. Helen was dedicated to helping the blind and handicapped, raising funds for the American Foundation for the Blind and lobbying for commissions for the blind in thirty states. A women’s rights activist, a Swedenborgian, a socialist, and a world-famous celebrity, Helen Keller received the Presidential Medal of Freedom and many honorary degrees. Her other books include The World I Live In (1908), Midstream: My Later Life (1929), Helen Keller’s Journal (1938), and Let Us Have Faith (1940). She died in 1968. Her burial urn is in the National Cathedral in Washington, D.C.", "webReaderLink": "http://play.google.com/books/reader?id=X-qaCwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Mornings on Horseback", "categories": ["Biography & Autobiography"], "authors": ["David McCullough"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 36, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2007-05-31", "previewLink": "http://books.google.co.in/books?id=nuzmvrqPvdIC&printsec=frontcover&dq=name:Mornings+on+Horseback:+The+Story+of+an+Extraordinary+Family,+a+Vanished+Way+of+Life,+and+the+Unique+Child+Who+Became+Theodore+Roosevelt&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=nuzmvrqPvdIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The National Book Award–winning biography that tells the story of how young Teddy Roosevelt transformed himself from a sickly boy into the vigorous man who would become a war hero and ultimately president of the United States, told by master historian David McCullough. Mornings on Horseback is the brilliant biography of the young Theodore Roosevelt. Hailed as “a masterpiece” (John A. Gable, Newsday), it is the winner of the Los Angeles Times 1981 Book Prize for Biography and the National Book Award for Biography. Written by David McCullough, the author of Truman, this is the story of a remarkable little boy, seriously handicapped by recurrent and almost fatal asthma attacks, and his struggle to manhood: an amazing metamorphosis seen in the context of the very uncommon household in which he was raised. The father is the first Theodore Roosevelt, a figure of unbounded energy, enormously attractive and selfless, a god in the eyes of his small, frail namesake. The mother, Mittie Bulloch Roosevelt, is a Southerner and a celebrated beauty, but also considerably more, which the book makes clear as never before. There are sisters Anna and Corinne, brother Elliott (who becomes the father of Eleanor Roosevelt), and the lovely, tragic Alice Lee, TR’s first love. All are brought to life to make “a beautifully told story, filled with fresh detail” (The New York Times Book Review). A book to be read on many levels, it is at once an enthralling story, a brilliant social history and a work of important scholarship which does away with several old myths and breaks entirely new ground. It is a book about life intensely lived, about family love and loyalty, about grief and courage, about “blessed” mornings on horseback beneath the wide blue skies of the Badlands.", "webReaderLink": "http://play.google.com/books/reader?id=nuzmvrqPvdIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Art and Affection", "categories": ["Biography & Autobiography"], "authors": ["Panthea Reid"], "printType": "BOOK", "pageCount": 570, "ratingsCount": null, "averageRating": null, "publisher": "Oxford University Press on Demand", "publishedDate": "1996", "previewLink": "http://books.google.co.in/books?id=wyFHB82sYOUC&printsec=frontcover&dq=name:Virginia+Woolf:+A+Biography&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=wyFHB82sYOUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A richly detailed, illustrated biography draws on a wealth of original, obscure documents and letters to illuminate many misunderstood areas of Woolf's life, including her bouts with manic depression and her relationship with her siblings and parents. UP.", "webReaderLink": "http://play.google.com/books/reader?id=wyFHB82sYOUC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Secret Life of Elizabeth I", "categories": ["Fiction"], "authors": ["Paul Doherty"], "printType": "BOOK", "pageCount": 176, "ratingsCount": null, "averageRating": null, "publisher": "Hachette UK", "publishedDate": "2013-06-06", "previewLink": "http://books.google.co.in/books?id=gteEET8rTc0C&pg=RA1-PR2&dq=name:The+Life+of+Elizabeth+I&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=gteEET8rTc0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A secret that could have changed the course of English history... Acclaimed historian Paul Doherty offers an insightful interpretation of one of the most fascinating English monarchs in his masterful 'faction', The Secret Life of Elizabeth I. From master historian Paul Doherty comes a detective story with a difference: tracking down the real Elizabeth I, and capturing the atmosphere of Elizabethan and Jacobean England. Written as a 'faction', The Secret Life of Elizabeth I interprets original sources through one of the Queen's ladies-in-waiting. These illuminating 'recollections' form the book, uncovering everything from the passionate relationship between Elizabeth and Robert Dudley, to the stunning revelation that they had a son, Arthur Dudley, seized by the Spanish in 1587. What readers are saying about Paul Doherty: 'Doherty is a spellbinding storyteller with an exceptional grasp of history. This story is of the usual high standard we expect from him and utterly fascinating, I couldn't put it down' 'This book is beyond fantastic. Paul Doherty brought Elizabethan times back to life here - making you feel you're there' 'Doherty proves that he is a scholar as well as a writer of novels'", "webReaderLink": "http://play.google.com/books/reader?id=gteEET8rTc0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Churchill", "categories": ["Biography & Autobiography"], "authors": ["Andrew Roberts"], "printType": "BOOK", "pageCount": 1152, "ratingsCount": 5, "averageRating": 4, "publisher": "Penguin UK", "publishedDate": "2018-10-04", "previewLink": "http://books.google.co.in/books?id=-4BbDwAAQBAJ&printsec=frontcover&dq=name:Churchill:+A+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=-4BbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "THE INTERNATIONAL BESTSELLER A SUNDAY TIMES, THE TIMES, ECONOMIST, DAILY TELEGRAPH, EVENING STANDARD, OBSERVER BOOK OF THE YEAR 'Undoubtedly the best single-volume life of Churchill ever written' Dominic Sandbrook, Sunday Times A magnificently fresh and unexpected biography of Churchill, by one of Britain's most acclaimed historians Winston Churchill towers over every other figure in twentieth-century British history. By the time of his death at the age of 90 in 1965, many thought him to be the greatest man in the world. There have been over a thousand previous biographies of Churchill. Andrew Roberts now draws on over forty new sources, including the private diaries of King George VI, used in no previous Churchill biography to depict him more intimately and persuasively than any of its predecessors. The book in no way conceals Churchill's faults and it allows the reader to appreciate his virtues and character in full: his titanic capacity for work (and drink), his ability see the big picture, his willingness to take risks and insistence on being where the action was, his good humour even in the most desperate circumstances, the breadth and strength of his friendships and his extraordinary propensity to burst into tears at unexpected moments. Above all, it shows us the wellsprings of his personality - his lifelong desire to please his father (even long after his father's death) but aristocratic disdain for the opinions of almost everyone else, his love of the British Empire, his sense of history and its connection to the present. During the Second World War, Churchill summoned a particular scientist to see him several times for technical advice. 'It was the same whenever we met', wrote the young man, 'I had a feeling of being recharged by a source of living power.' Harry Hopkins, President Roosevelt's emissary, wrote 'Wherever he was, there was a battlefront.' Field Marshal Sir Alan Brooke, Churchill's essential partner in strategy and most severe critic in private, wrote in his diary, 'I thank God I was given such an opportunity of working alongside such a man, and of having my eyes opened to the fact that occasionally supermen exist on this earth.'", "webReaderLink": "http://play.google.com/books/reader?id=-4BbDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The confessions of s. Augustine", "categories": null, "authors": ["Augustine (st.)"], "printType": "BOOK", "pageCount": null, "ratingsCount": 48, "averageRating": 4, "publisher": null, "publishedDate": "1848", "previewLink": "http://books.google.co.in/books?id=7gkDAAAAQAAJ&printsec=frontcover&dq=name:The+Confessions+of+St.+Augustine&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=7gkDAAAAQAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=7gkDAAAAQAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Passage of Power", "categories": ["Biography & Autobiography"], "authors": ["Robert A. Caro"], "printType": "BOOK", "pageCount": 712, "ratingsCount": 17, "averageRating": 4.5, "publisher": "Vintage", "publishedDate": "2013", "previewLink": "http://books.google.co.in/books?id=rQO5g9pQjDIC&dq=name:The+Passage+of+Power+(The+Years+of+Lyndon+Johnson,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=rQO5g9pQjDIC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Examines Lyndon Johnson's volatile relationships with John and Robert Kennedy, describes JFK's assassination from Johnson's viewpoint, and recounts his accomplishments as president before they were overshadowed by the Vietnam War.", "webReaderLink": "http://play.google.com/books/reader?id=rQO5g9pQjDIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Last Lion, Winston Spencer Churchill", "categories": ["Biography & Autobiography"], "authors": ["William Manchester"], "printType": "BOOK", "pageCount": 768, "ratingsCount": 2, "averageRating": 5, "publisher": "Bantam", "publishedDate": "1989", "previewLink": "http://books.google.co.in/books?id=acGJDQAAQBAJ&dq=name:The+Last+Lion:+Winston+Spencer+Churchill:+Alone,+1932-40&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=acGJDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The noted biographer-historian continues his life of Winston Churchill, focusing here on the years of Churchill's political exile and his increasingly forceful opposition to Hitler's Germany.", "webReaderLink": "http://play.google.com/books/reader?id=acGJDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Master of the Senate", "categories": null, "authors": ["Robert A. Caro"], "printType": "BOOK", "pageCount": 1200, "ratingsCount": null, "averageRating": null, "publisher": "Bodley Head Childrens", "publishedDate": "2019-07-04", "previewLink": "http://books.google.co.in/books?id=pgdSxAEACAAJ&dq=name:Master+of+the+Senate&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=pgdSxAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "'The greatest biography of our era ... Essential reading for those who want to comprehend power and politics' The Times Robert A. Caro's legendary, multi-award-winning biography of US President Lyndon Johnson is a uniquely riveting and revelatory account of power, political genius and the shaping of twentieth-century America. Winner of the Pulitzer Prize and the National Book Award, Master of the Senate takes Johnson's story through one of its most remarkable periods- his twelve years, from 1949 to 1960, in the United States Senate. Once the most august and revered body in politics, by the time Johnson arrived the Senate had become a parody of itself and an obstacle that for decades had blocked desperately needed liberal legislation. Caro shows how Johnson's brilliance, charm and ruthlessness enabled him to become the youngest and most powerful Majority Leader in history and how he used his incomparable legislative genius - seducing both Northern liberals and Southern conservatives - to pass the first Civil Rights legislation since Reconstruction.", "webReaderLink": "http://play.google.com/books/reader?id=pgdSxAEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Sophia Tolstoy", "categories": ["Biography & Autobiography"], "authors": ["Alexandra Popoff"], "printType": "BOOK", "pageCount": 368, "ratingsCount": 2, "averageRating": 5, "publisher": "Simon and Schuster", "publishedDate": "2010-05-11", "previewLink": "http://books.google.co.in/books?id=bQDPo13qIdEC&pg=PR11&dq=name:Tolstoy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=bQDPo13qIdEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "As Leo Tolstoy’s wife, Sophia Tolstoy experienced both glory and condemnation during their forty-eight-year marriage. She was admired as the muse and literary assistant to one of the world’s most celebrated novelists. But when in later years Tolstoy became a towering public figure and founded a new brand of religion, she was scorned for her disagreements with him. And it is this version of Sophia—malicious, shrill, perennially at war with Tolstoy—that has gone down in the historical record. Drawing on newly available archival material, including Sophia’s unpublished memoir, Alexandra Popoff presents a dramatically different and accurate portrait of the woman and the marriage. This lively, well-researched biography demonstrates that, contrary to popular belief, Sophia was remarkably supportive of Tolstoy and was, in fact, key to his fame. Gifted and versatile, Sophia assisted Tolstoy during the writing of War and Peace and Anna Karenina. Having modeled his most memorable female characters on her, Tolstoy admired his wife’s boundless energy, which he called “the force of life.” Sophia’s letters, never before translated, illuminate the couple’s true relationship and provide insights into Tolstoy’s creative laboratory. Although long portrayed as an elitist and hysterical countess, Sophia was in reality a practical, independent-minded, generous, and talented woman who shared Tolstoy’s important values and his capacity for work. Mother of thirteen, she participated in Tolstoy’s causes and managed all business a airs. Popoff describes in haunting detail the intrusion into their marriage by Tolstoy’s religious disciple Vladimir Chertkov, who controlled Tolstoy at the end of his life and led a smear campaign against Sophia, branding her evil and mad. She is still judged by Chertkov’s false accounts, which dismissed her valuable achievements and contributions. During his later religious phase, Tolstoy renounced his property and copyright, and Sophia had to become the breadwinner. She published Tolstoy’s collected works and supported their large family. Despite the pressures of her demanding life, she realized her own talents as a writer, photographer, translator, and aspiring artist. This vigorous, engrossing biography presents in fascinating depth and detail the many ways in which Sophia Tolstoy enriched the life and work of one of the world’s most revered authors.", "webReaderLink": "http://play.google.com/books/reader?id=bQDPo13qIdEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Adolf Hitler", "categories": ["History"], "authors": ["Sherree Owens Zalampas"], "printType": "BOOK", "pageCount": 171, "ratingsCount": null, "averageRating": null, "publisher": "Popular Press", "publishedDate": "1990", "previewLink": "http://books.google.co.in/books?id=t-tQ9V2--1kC&pg=PA5&dq=name:Adolf+Hitler&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=t-tQ9V2--1kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Zalampas applies the psychological model of Alfred Adler to Adolf Hitler through the examination of his views on architecture, art, and music. This study was made possible by the publication of Billy F. Price’s volume of over seven hundred of Hitler’s watercolors, oils, and sketches.", "webReaderLink": "http://play.google.com/books/reader?id=t-tQ9V2--1kC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "No One Here Gets Out Alive", "categories": ["Music"], "authors": ["Jerry Hopkins", "Daniel Sugerman"], "printType": "BOOK", "pageCount": 334, "ratingsCount": 741, "averageRating": 3.5, "publisher": null, "publishedDate": "2011-11-01", "previewLink": "http://books.google.co.in/books?id=0M_wygAACAAJ&dq=name:No+One+Here+Gets+Out+Alive&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=0M_wygAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Here is Jim Morrison in all his complexity-singer, philosopher, poet, delinquent-the brilliant, charismatic, and obsessed seeker who rejected authority in any form, the explorer who probed \"the bounds of reality to see what would happen.\" Seven years in the writing, this definitive biography is the work of two men whose empathy and experience with Jim Morrison uniquely prepared them to recount this modern tragedy: Jerry Hopkins, whose famous Presley biography, Elvis, was inspired by Morrison's suggestion, and Danny Sugerman, confidant of and aide to the Doors. With an afterword by Michael McClure.", "webReaderLink": "http://play.google.com/books/reader?id=0M_wygAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Mitford Girls", "categories": ["Biography & Autobiography"], "authors": ["Mary S. Lovell"], "printType": "BOOK", "pageCount": 624, "ratingsCount": 22, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2008-09-04", "previewLink": "http://books.google.co.in/books?id=2oZ2mxtiCy0C&printsec=frontcover&dq=name:The+Mitford+Girls:+The+Biography+of+an+Extraordinary+Family&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2oZ2mxtiCy0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'A cracking read ' Lynn Barber, Observer The Mitford Girls tells the true story behind the gaiety and frivolity of the six Mitford daughters - and the facts are as sensational as any novel: Nancy, whose bright social existence masked an obsessional doomed love which soured her success; Pam, a countrywoman married to one of the best brains in Europe; Diana, an iconic beauty, who was already married when at 22 she fell in love with Oswald Moseley, the leader of the British fascists; Unity, who romantically in love with Hitler, became a member of his inner circle before shooting herself in the temple when WWII was declared; Jessica, the family rebel, who declared herself a communist in the schoolroom and the youngest sister, Debo, who became the Duchess of Devonshire. This is an extraordinary story of an extraordinary family, containing much new material, based on exclusive access to Mitford archives.", "webReaderLink": "http://play.google.com/books/reader?id=2oZ2mxtiCy0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Years of Lyndon Johnson", "categories": ["Presidents"], "authors": ["Robert A. Caro"], "printType": "BOOK", "pageCount": 506, "ratingsCount": null, "averageRating": null, "publisher": "Vintage", "publishedDate": "1990-01", "previewLink": "http://books.google.co.in/books?id=Fq5cAQAACAAJ&dq=name:Means+of+Ascent+(The+Years+of+Lyndon+Johnson,&hl=&cd=1&source=gbs_api", "language": "en", "description": "In the second volume, the author reveals some of the more extreme grotesqueries of American politics. For this is the time when Johnson created for himself a much exaggerated record as a war hero, when he and his wife Lady Bird made themselves rich by juggling radio station licences. And it is the time when Johnson fought for - and won, by 87 dubious votes - his first seat in the US Senate, in an election whose c orruption was legendary even by Texas standards.", "webReaderLink": "http://play.google.com/books/reader?id=Fq5cAQAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Eleanor Of Aquitaine", "categories": ["Biography & Autobiography"], "authors": ["Alison Weir"], "printType": "BOOK", "pageCount": 464, "ratingsCount": 18, "averageRating": 4, "publisher": "Random House", "publishedDate": "2011-02-28", "previewLink": "http://books.google.co.in/books?id=aUJlwSjs3mMC&printsec=frontcover&dq=name:Eleanor+of+Aquitaine:+A+Life&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=aUJlwSjs3mMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Eleanor, Duchess of Aquitaine was one of the leading personalities of the Middle Ages and also one of the most controversial. She was beautiful, intelligent and wilful, and in her lifetime there were rumours about her that were not without substance. She had been reared in a relaxed and licentious court where the arts of the troubadours flourished, and was even said to have presided over the fabled Courts of Love. Eleanor married in turn Louis VII of France and Henry II of England, and was the mother of Richard the Lionheart and King John. She lived to be 82, but it was only in old age that she triumphed over the adversities and tragedies of her earlier years and became virtual ruler of England. Eleanor has exerted a fascination over writers and biographers for 800 years, but the prevailing myths and legends that attach to her name still tend to obscure the truth. By careful research, Alison Weir has produced a vivid biography with a fresh and provocative perspective on this extraordinary woman.", "webReaderLink": "http://play.google.com/books/reader?id=aUJlwSjs3mMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Genghis Khan and the Making of the Modern World", "categories": ["History"], "authors": ["Jack Weatherford"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 49, "averageRating": 4, "publisher": "Broadway Books", "publishedDate": "2005-03-22", "previewLink": "http://books.google.co.in/books?id=A8Y9B5uHQcAC&printsec=frontcover&dq=name:Genghis+Khan+and+the+Making+of+the+Modern+World&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=A8Y9B5uHQcAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "New York Times Bestseller • The startling true history of how one extraordinary man from a remote cornerof the world created an empire that led the world into the modern age. The Mongol army led by Genghis Khan subjugated more lands and people in twenty-five years than the Romans did in four hundred. In nearly every country the Mongols conquered, they brought an unprecedented rise in cultural communication, expanded trade, and a blossoming of civilization. Vastly more progressive than his European or Asian counterparts, Genghis Khan abolished torture, granted universal religious freedom, and smashed feudal systems of aristocratic privilege. From the story of his rise through the tribal culture to the explosion of civilization that the Mongol Empire unleashed, this brilliant work of revisionist history is nothing less than the epic story of how the modern world was made.", "webReaderLink": "http://play.google.com/books/reader?id=A8Y9B5uHQcAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Black Count", "categories": ["Biography & Autobiography"], "authors": ["Tom Reiss"], "printType": "BOOK", "pageCount": 432, "ratingsCount": 1, "averageRating": 4, "publisher": "Random House", "publishedDate": "2012-09-20", "previewLink": "http://books.google.co.in/books?id=9rX3GBRWDVkC&printsec=frontcover&dq=name:The+Black+Count:+Glory,+Revolution,+Betrayal,+and+the+Real+Count+of+Monte+Cristo&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=9rX3GBRWDVkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "WINNER OF THE PULITZER PRIZE FOR BIOGRAPHY 2013 ‘Completely absorbing’ Amanda Foreman 'Enthralling’ Guardian ‘The Three Musketeers! The Count of Monte Cristo! The stories of course are fiction. But here a prize-winning author shows us that the inspiration for the swashbuckling stories was, in fact, Dumas’s own father, Alex - the son of a marquis and a black slave... He achieved a giddy ascent from private in the Dragoons to the rank of general; an outsider who had grown up among slaves, he was all for Liberty and Equality. Alex Dumas was the stuff of legend’ Daily Mail So how did such this extraordinary man get erased by history? Why are there no statues of ‘Monsieur Humanity’ as his troops called him? The Black Count uncovers what happened and the role Napoleon played in Dumas’s downfall. By walking the same ground as Dumas - from Haiti to the Pyramids, Paris to the prison cell at Taranto – Reiss, like the novelist before him, triumphantly resurrects this forgotten hero. ‘Entrances from first to last. Dumas the novelist would be proud’ Independent ‘Brilliant’ Glasgow Herald", "webReaderLink": "http://play.google.com/books/reader?id=9rX3GBRWDVkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Mastering JavaScript Functional Programming", "categories": ["Computers"], "authors": ["Federico Kereki"], "printType": "BOOK", "pageCount": 470, "ratingsCount": null, "averageRating": null, "publisher": "Packt Publishing Ltd", "publishedDate": "2020-01-24", "previewLink": "http://books.google.co.in/books?id=l2bMDwAAQBAJ&pg=PA123&dq=name:Lincoln&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=l2bMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Explore the functional programming paradigm and the different techniques for developing better algorithms, writing more concise code, and performing seamless testing Key Features Explore this second edition updated to cover features like async functions and transducers, as well as functional reactive programming Enhance your functional programming (FP) skills to build web and server apps using JavaScript Use FP to enhance the modularity, reusability, and performance of apps Book Description Functional programming is a paradigm for developing software with better performance. It helps you write concise and testable code. To help you take your programming skills to the next level, this comprehensive book will assist you in harnessing the capabilities of functional programming with JavaScript and writing highly maintainable and testable web and server apps using functional JavaScript. This second edition is updated and improved to cover features such as transducers, lenses, prisms and various other concepts to help you write efficient programs. By focusing on functional programming, you’ll not only start to write but also to test pure functions, and reduce side effects. The book also specifically allows you to discover techniques for simplifying code and applying recursion for loopless coding. Gradually, you’ll understand how to achieve immutability, implement design patterns, and work with data types for your application, before going on to learn functional reactive programming to handle complex events in your app. Finally, the book will take you through the design patterns that are relevant to functional programming. By the end of this book, you’ll have developed your JavaScript skills and have gained knowledge of the essential functional programming techniques to program effectively. What you will learn Simplify JavaScript coding using function composition, pipelining, chaining, and transducing Use declarative coding as opposed to imperative coding to write clean JavaScript code Create more reliable code with closures and immutable data Apply practical solutions to complex programming problems using recursion Improve your functional code using data types, type checking, and immutability Understand advanced functional programming concepts such as lenses and prisms for data access Who this book is for This book is for JavaScript developers who want to enhance their programming skills and build efficient web applications. Frontend and backend developers who use various JavaScript frameworks and libraries like React, Angular, or Node.js will also find the book helpful. Working knowledge of ES2019 is required to grasp the concepts covered in the book easily.", "webReaderLink": "http://play.google.com/books/reader?id=l2bMDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Writer's Diary", "categories": ["Novelists, English"], "authors": ["Virginia Woolf", "Lyndall Gordon"], "printType": "BOOK", "pageCount": 372, "ratingsCount": 3, "averageRating": 3.5, "publisher": "Persephone Books", "publishedDate": "2012-04-01", "previewLink": "http://books.google.co.in/books?id=RExZLwEACAAJ&dq=name:A+Writer%27s+Diary&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RExZLwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "2012 Reprint of 1953 Edition. Exact facsimile of the original edition, not reproduced with Optical Recognition Software. An invaluable guide to the art and mind of Virginia Woolf, \"A Writer's Diary\" was collected by her husband from the personal record she kept over a period of twenty-seven years. Included are entries that refer to her own writing and those that are clearly writing exercises, accounts of people and scenes relevant to the raw material of her work, and finally, comments on books she was reading. The first entry is dated 1918 and the last, three weeks before her death in 1941. Between these points of time unfolds the private world - the anguish, the triumph, the creative vision - of one of the great writers of our century.", "webReaderLink": "http://play.google.com/books/reader?id=RExZLwEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "American Lion", "categories": ["Biography & Autobiography"], "authors": ["Jon Meacham"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 50, "averageRating": 3.5, "publisher": "Random House", "publishedDate": "2008-11-11", "previewLink": "http://books.google.co.in/books?id=FYFsufPTrnEC&printsec=frontcover&dq=name:American+Lion:+Andrew+Jackson+in+the+White+House&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=FYFsufPTrnEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The definitive biography of a larger-than-life president who defied norms, divided a nation, and changed Washington forever Andrew Jackson, his intimate circle of friends, and his tumultuous times are at the heart of this remarkable book about the man who rose from nothing to create the modern presidency. Beloved and hated, venerated and reviled, Andrew Jackson was an orphan who fought his way to the pinnacle of power, bending the nation to his will in the cause of democracy. Jackson’s election in 1828 ushered in a new and lasting era in which the people, not distant elites, were the guiding force in American politics. Democracy made its stand in the Jackson years, and he gave voice to the hopes and the fears of a restless, changing nation facing challenging times at home and threats abroad. To tell the saga of Jackson’s presidency, acclaimed author Jon Meacham goes inside the Jackson White House. Drawing on newly discovered family letters and papers, he details the human drama–the family, the women, and the inner circle of advisers– that shaped Jackson’s private world through years of storm and victory. One of our most significant yet dimly recalled presidents, Jackson was a battle-hardened warrior, the founder of the Democratic Party, and the architect of the presidency as we know it. His story is one of violence, sex, courage, and tragedy. With his powerful persona, his evident bravery, and his mystical connection to the people, Jackson moved the White House from the periphery of government to the center of national action, articulating a vision of change that challenged entrenched interests to heed the popular will– or face his formidable wrath. The greatest of the presidents who have followed Jackson in the White House–from Lincoln to Theodore Roosevelt to FDR to Truman–have found inspiration in his example, and virtue in his vision. Jackson was the most contradictory of men. The architect of the removal of Indians from their native lands, he was warmly sentimental and risked everything to give more power to ordinary citizens. He was, in short, a lot like his country: alternately kind and vicious, brilliant and blind; and a man who fought a lifelong war to keep the republic safe–no matter what it took.", "webReaderLink": "http://play.google.com/books/reader?id=FYFsufPTrnEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Abraham Lincoln", "categories": ["Biography & Autobiography"], "authors": ["Carl Sandburg"], "printType": "BOOK", "pageCount": 762, "ratingsCount": 3, "averageRating": 4, "publisher": "Houghton Mifflin Harcourt", "publishedDate": "2002-11", "previewLink": "http://books.google.co.in/books?id=EPmfzxRags0C&printsec=frontcover&dq=name:Abraham+Lincoln:+The+Prairie+Years+and+the+War+Years&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=EPmfzxRags0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "\"By the time this single-volume edition was completed, [Sandberg] had spent a lifetime studying, researching, and writing about our sixteenth president. His extraordinary portrait brings fully to life the country lawyer who would become one of the most influential and beloved presidents of the American republic.\"--Cover.", "webReaderLink": "http://play.google.com/books/reader?id=EPmfzxRags0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Seabiscuit", "categories": ["Biography & Autobiography"], "authors": ["Laura Hillenbrand"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 82, "averageRating": 4, "publisher": "Ballantine Books", "publishedDate": "2003-07-01", "previewLink": "http://books.google.co.in/books?id=oEFpcR9p4GYC&dq=name:Seabiscuit:+An+American+Legend&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=oEFpcR9p4GYC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "#1 NEW YORK TIMES BESTSELLER • From the author of the runaway phenomenon Unbroken comes a universal underdog story about the horse who came out of nowhere to become a legend. Seabiscuit was one of the most electrifying and popular attractions in sports history and the single biggest newsmaker in the world in 1938, receiving more coverage than FDR, Hitler, or Mussolini. But his success was a surprise to the racing establishment, which had written off the crooked-legged racehorse with the sad tail. Three men changed Seabiscuit’s fortunes: Charles Howard was a onetime bicycle repairman who introduced the automobile to the western United States and became an overnight millionaire. When he needed a trainer for his new racehorses, he hired Tom Smith, a mysterious mustang breaker from the Colorado plains. Smith urged Howard to buy Seabiscuit for a bargain-basement price, then hired as his jockey Red Pollard, a failed boxer who was blind in one eye, half-crippled, and prone to quoting passages from Ralph Waldo Emerson. Over four years, these unlikely partners survived a phenomenal run of bad fortune, conspiracy, and severe injury to transform Seabiscuit from a neurotic, pathologically indolent also-ran into an American sports icon. BONUS: This edition contains a Seabiscuit discussion guide and an excerpt from Unbroken. Praise for Seabiscuit “Fascinating . . . Vivid . . . A first-rate piece of storytelling, leaving us not only with a vivid portrait of a horse but a fascinating slice of American history as well.”—The New York Times “Engrossing . . . Fast-moving . . . More than just a horse’s tale, because the humans who owned, trained, and rode Seabiscuit are equally fascinating. . . . [Laura Hillenbrand] shows an extraordinary talent for describing a horse race so vividly that the reader feels like the rider.”—Sports Illustrated “REMARKABLE . . . MEMORABLE . . . JUST AS COMPELLING TODAY AS IT WAS IN 1938.”—The Washington Post", "webReaderLink": "http://play.google.com/books/reader?id=oEFpcR9p4GYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Children of Henry VIII", "categories": ["Biography & Autobiography"], "authors": ["Alison Weir"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 22, "averageRating": 4, "publisher": "Ballantine Books", "publishedDate": "2011-09-21", "previewLink": "http://books.google.co.in/books?id=rAk8x1FdrpwC&dq=name:The+Children+of+Henry+VIII&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=rAk8x1FdrpwC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "“Fascinating . . . Alison Weir does full justice to the subject.”—The Philadelphia Inquirer At his death in 1547, King Henry VIII left four heirs to the English throne: his only son, the nine-year-old Prince Edward; the Lady Mary, the adult daughter of his first wife Katherine of Aragon; the Lady Elizabeth, the teenage daughter of his second wife Anne Boleyn; and his young great-niece, the Lady Jane Grey. In this riveting account Alison Weir paints a unique portrait of these extraordinary rulers, examining their intricate relationships to each other and to history. She traces the tumult that followed Henry's death, from the brief intrigue-filled reigns of the boy king Edward VI and the fragile Lady Jane Grey, to the savagery of \"Bloody Mary,\" and finally the accession of the politically adroit Elizabeth I. As always, Weir offers a fresh perspective on a period that has spawned many of the most enduring myths in English history, combining the best of the historian's and the biographer's art. “Like anthropology, history and biography can demonstrate unfamiliar ways of feeling and being. Alison Weir's sympathetic collective biography, The Children of Henry VIII does just that, reminding us that human nature has changed--and for the better. . . . Weir imparts movement and coherence while re-creating the suspense her characters endured and the suffering they inflicted.”—The New York Times Book Review", "webReaderLink": "http://play.google.com/books/reader?id=rAk8x1FdrpwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The King's Speech", "categories": ["Biography & Autobiography"], "authors": ["Mark Logue", "Peter Conradi"], "printType": "BOOK", "pageCount": 242, "ratingsCount": 22, "averageRating": 3.5, "publisher": "Quercus Books", "publishedDate": "2010-01-01", "previewLink": "http://books.google.co.in/books?id=jX18aQOLW6EC&dq=name:The+King%27s+Speech:+How+One+Man+Saved+the+British+Monarchy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=jX18aQOLW6EC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "One man saved the British Royal Family in the first decades of the 20th century - an almost unknown, and certainly unqualified, speech therapist called Lionel Logue, whom one newspaper in the 1930s famously dubbed \"The Quack who saved a King\". Logue wasn't a British aristocrat or even an Englishman - he was a commoner and an Australian to boot. Nevertheless it was the outgoing, amiable Logue who single-handedly turned the famously nervous, tongue-tied, Duke of York into the man who was capable of becoming King.", "webReaderLink": "http://play.google.com/books/reader?id=jX18aQOLW6EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Walt Disney", "categories": ["Biography & Autobiography"], "authors": ["Neal Gabler"], "printType": "BOOK", "pageCount": 851, "ratingsCount": 11, "averageRating": 4.5, "publisher": "Vintage", "publishedDate": "2007", "previewLink": "http://books.google.co.in/books?id=41e-Ru0wRkEC&dq=name:Walt+Disney:+The+Triumph+of+the+American+Imagination&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=41e-Ru0wRkEC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A portrait of the private life and public career of Walt Disney ranges from his deprived youth, to his contributions to the art of animation, to his visionary creation of the first synergistic entertainment empire, to his reclusive and lonely private world.", "webReaderLink": "http://play.google.com/books/reader?id=41e-Ru0wRkEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Henry VIII", "categories": ["Biography & Autobiography"], "authors": ["Alison Weir"], "printType": "BOOK", "pageCount": 632, "ratingsCount": 14, "averageRating": 3.5, "publisher": "Random House Digital, Inc.", "publishedDate": "2002", "previewLink": "http://books.google.co.in/books?id=eh7Ylw4rPAAC&q=name:Henry+VIII:+The+King+and+His+Court&dq=name:Henry+VIII:+The+King+and+His+Court&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=eh7Ylw4rPAAC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Examines the king's remarkable influence on the laws, customs, culture, and politics of his kingdom and profiles the diverse courtiers, artists, and scholars who surrounded Henry VIII.", "webReaderLink": "http://play.google.com/books/reader?id=eh7Ylw4rPAAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Last Train To Memphis", "categories": ["Biography & Autobiography"], "authors": ["Peter Guralnick"], "printType": "BOOK", "pageCount": 592, "ratingsCount": 10, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2020-04-30", "previewLink": "http://books.google.co.in/books?id=RvzcDwAAQBAJ&printsec=frontcover&dq=name:Last+Train+to+Memphis:+The+Rise+of+Elvis+Presley&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RvzcDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This is the first of two volumes that make up what is arguably the definitive Elvis biography. Rich in documentary and interview material, this volume charts Elvis' early years and his rise to fame, taking us up to his departure for Germany in 1958. Of all the biographies of Elvis - this is the one you will keep coming back to.", "webReaderLink": "http://play.google.com/books/reader?id=RvzcDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Will In The World", "categories": ["Literary Criticism"], "authors": ["Stephen Greenblatt"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 30, "averageRating": 4, "publisher": "Random House", "publishedDate": "2012-03-31", "previewLink": "http://books.google.co.in/books?id=LAiYWsI5jUoC&printsec=frontcover&dq=name:Will+in+the+World:+How+Shakespeare+Became+Shakespeare&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=LAiYWsI5jUoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Stephen Greenblatt's Will in the World is widely recognised to be the fullest and most brilliant account ever written of Shakespeare's life, his work and his age. Shakespeare was a man of his time, constantly engaging with his audience's deepest desires and fears, and by reconnecting with this historic reality we are able to experience the true character of the playwright himself. Greenblatt traces Shakespeare's unfolding imaginative generosity - his ability to inhabit others, to confer upon them his own strength of spirit, to make them truly live as independent beings as no other artist has ever done. Digging deep into the vital links between the playwright and his world, Will in the World provides the fullest account ever written of the living, breathing man behind the masterpieces.", "webReaderLink": "http://play.google.com/books/reader?id=LAiYWsI5jUoC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Man Who Knew Infinity", "categories": ["Biography & Autobiography"], "authors": ["Robert Kanigel"], "printType": "BOOK", "pageCount": 464, "ratingsCount": 7, "averageRating": 4.0, "publisher": "Simon and Schuster", "publishedDate": "2016-04-26", "previewLink": "http://books.google.co.in/books?id=m08ADAAAQBAJ&printsec=frontcover&dq=name:The+Man+Who+Knew+Infinity:+A+Life+of+the+Genius+Ramanujan&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=m08ADAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A biography of the Indian mathematician Srinivasa Ramanujan. The book gives a detailed account of his upbringing in India, his mathematical achievements, and his mathematical collaboration with English mathematician G. H. Hardy. The book also reviews the life of Hardy and the academic culture of Cambridge University during the early twentieth century.", "webReaderLink": "http://play.google.com/books/reader?id=m08ADAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "His Excellency", "categories": ["Biography & Autobiography"], "authors": ["Joseph J. Ellis"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 40, "averageRating": 4, "publisher": "Vintage", "publishedDate": "2004-10-26", "previewLink": "http://books.google.co.in/books?id=jFtVf_Iz7vcC&printsec=frontcover&dq=name:His+Excellency:+George+Washington&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=jFtVf_Iz7vcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "National Bestseller To this landmark biography of our first president, Joseph J. Ellis brings the exacting scholarship, shrewd analysis, and lyric prose that have made him one of the premier historians of the Revolutionary era. Training his lens on a figure who sometimes seems as remote as his effigy on Mount Rushmore, Ellis assesses George Washington as a military and political leader and a man whose “statue-like solidity” concealed volcanic energies and emotions. Here is the impetuous young officer whose miraculous survival in combat half-convinced him that he could not be killed. Here is the free-spending landowner whose debts to English merchants instilled him with a prickly resentment of imperial power. We see the general who lost more battles than he won and the reluctant president who tried to float above the partisan feuding of his cabinet. His Excellency is a magnificent work, indispensable to an understanding not only of its subject but also of the nation he brought into being. From the Trade Paperback edition.", "webReaderLink": "http://play.google.com/books/reader?id=jFtVf_Iz7vcC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Love and Louis XIV", "categories": ["History"], "authors": ["Antonia Fraser"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 7, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2008-09-18", "previewLink": "http://books.google.co.in/books?id=-CD7CBji2i8C&pg=PT265&dq=name:Love+and+Louis+XIV:+The+Women+in+the+Life+of+the+Sun+King&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=-CD7CBji2i8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Mistresses and wives, mothers and daughters - Antonia Fraser brilliantly explores the relationships which existed between The Sun King and the women in his life. This includes not only Louis XIV's mistresses, principally Louise de La Vallière, Athénaïs de Montespan, and the puritanical Madame de Maintenon, but also the wider story of his relationships with women in general, including his mother Anne of Austria, his two sisters-in-law who were Duchesses d'Orléans in succession, Henriette-Anne and Liselotte, his wayward illegitimate daughters, and lastly Adelaide, the beloved child-wife of his grandson.", "webReaderLink": "http://play.google.com/books/reader?id=-CD7CBji2i8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Parting the Waters", "categories": ["Biography & Autobiography"], "authors": ["Taylor Branch"], "printType": "BOOK", "pageCount": 1088, "ratingsCount": 12, "averageRating": 4.5, "publisher": "Simon and Schuster", "publishedDate": "2007-04-16", "previewLink": "http://books.google.co.in/books?id=3gQN-jK8JI0C&pg=PT100&dq=name:Parting+the+Waters&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=3gQN-jK8JI0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In volume one of his America in the King Years, Pulitzer Prize winner Taylor Branch gives a masterly account of the American civil rights movement. Hailed as the most masterful story ever told of the American civil rights movement, Parting the Waters is destined to endure for generations. Moving from the fiery political baptism of Martin Luther King, Jr., to the corridors of Camelot where the Kennedy brothers weighed demands for justice against the deceptions of J. Edgar Hoover, here is a vivid tapestry of America, torn and finally transformed by a revolutionary struggle unequaled since the Civil War. Taylor Branch provides an unsurpassed portrait of King's rise to greatness and illuminates the stunning courage and private conflict, the deals, maneuvers, betrayals, and rivalries that determined history behind closed doors, at boycotts and sit-ins, on bloody freedom rides, and through siege and murder. Epic in scope and impact, Branch's chronicle definitively captures one of the nation's most crucial passages.", "webReaderLink": "http://play.google.com/books/reader?id=3gQN-jK8JI0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Rajinikanth", "categories": ["Performing Arts"], "authors": ["Naman Ramachandran"], "printType": "BOOK", "pageCount": 312, "ratingsCount": null, "averageRating": null, "publisher": "Penguin UK", "publishedDate": "2014-01-15", "previewLink": "http://books.google.co.in/books?id=3mzyPGSfwKMC&printsec=frontcover&dq=name:Rajinikanth:+The+Definitive+Biography&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=3mzyPGSfwKMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Rajinikanth is, quite simply, the biggest superstar cinema-crazy India has ever seen. His stylized dialogues and screen mannerisms are legion, and his guy-next-door-cum-superhero image has found a hysterically appreciative following among millions of moviegoers. Naman Ramachandran’s marvellous biography recounts Rajini’s career in meticulous detail, tracing his incredible cinematic journey from Apoorva Raagangal (1975) to Kochadaiyaan (2013). Along the way, the book provides rare insights into the Thalaivar’s personal life, from his childhood days to his times of struggle—when he was still Shivaji Rao Gaekwad—and then his eventual stardom: revealing how a legend was born.", "webReaderLink": "http://play.google.com/books/reader?id=3mzyPGSfwKMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Blockade", "categories": ["Austria"], "authors": ["Anna Eisenmenger"], "printType": "BOOK", "pageCount": 273, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1932", "previewLink": "http://books.google.co.in/books?id=kW_RAAAAMAAJ&q=name:Blockade:+The+Diary+of+an+Austrian+Middle-Class+Woman,+1914-1924&dq=name:Blockade:+The+Diary+of+an+Austrian+Middle-Class+Woman,+1914-1924&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=kW_RAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=kW_RAAAAMAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Mayor of Castro Street", "categories": ["Biography & Autobiography"], "authors": ["Randy Shilts"], "printType": "BOOK", "pageCount": 388, "ratingsCount": 14, "averageRating": 4, "publisher": "Macmillan", "publishedDate": "2008-10-14", "previewLink": "http://books.google.co.in/books?id=P_2f521UkFIC&dq=name:The+Mayor+of+Castro+Street:+The+Life+and+Times+of+Harvey+Milk&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=P_2f521UkFIC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A biography of Harvey Milk, the first openly gay city official in the nation, recounts his public and personal life, and examines the emergence of the San Francisco gay community as a social and political force.", "webReaderLink": "http://play.google.com/books/reader?id=P_2f521UkFIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Teachings of Thomas S. Monson", "categories": ["Mormon Church"], "authors": ["Thomas S. Monson"], "printType": "BOOK", "pageCount": 365, "ratingsCount": null, "averageRating": null, "publisher": "Deseret Book", "publishedDate": "2011-01-01", "previewLink": "http://books.google.co.in/books?id=WnWyXwAACAAJ&dq=name:To+the+Rescue:+The+Biography+of+Thomas+S.+Monson&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=WnWyXwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=WnWyXwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Go Forward with Faith", "categories": ["Biography & Autobiography"], "authors": ["Sheri L. Dew"], "printType": "BOOK", "pageCount": 653, "ratingsCount": 3, "averageRating": 5, "publisher": "Shadow Mountain", "publishedDate": "1996", "previewLink": "http://books.google.co.in/books?id=2yUePwAACAAJ&dq=name:Go+Forward+with+Faith:+The+Biography+of+Gordon+B.+Hinckley&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2yUePwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=2yUePwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Color of Water", "categories": ["Family & Relationships"], "authors": ["James McBride"], "printType": "BOOK", "pageCount": 336, "ratingsCount": 15, "averageRating": 4, "publisher": "Tarcher", "publishedDate": "1996", "previewLink": "http://books.google.co.in/books?id=zeEMAAAAYAAJ&dq=name:The+Color+of+Water:+A+Black+Man%27s+Tribute+to+His+White+Mother&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=zeEMAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A young African American man describes growing up as one of twelve children of a white mother and Black father, and discusses his mother's contributions to his life and his confusion over his own identity", "webReaderLink": "http://play.google.com/books/reader?id=zeEMAAAAYAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Legend of Zelda: Hyrule Historia", "categories": ["Games & Activities"], "authors": ["Eiji Aonuma", "Akira Himekawa"], "printType": "BOOK", "pageCount": 276, "ratingsCount": null, "averageRating": null, "publisher": "Dark Horse Comics", "publishedDate": "2020-04-14", "previewLink": "http://books.google.co.in/books?id=ZfzKDwAAQBAJ&pg=PP8&dq=name:Zelda&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ZfzKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Make sure to check out the other installments in this unparalleled collection of historical information on The Legend of Zelda franchise with the New York Times best selling The Legend of Zelda: Art & Artifacts and The Legend of Zelda: Encyclopedia. Also look for The Legend of Zelda: Breath of the Wild — Creating a Champion for an indepth look at the art, lore, and making of the best selling video game! Dark Horse Books and Nintendo team up to bring you The Legend of Zelda: Hyrule Historia, containing an unparalleled collection of historical information on The Legend of Zelda franchise. This handsome digital book contains never-before-seen concept art, the full history of Hyrule, the official chronology of the games, and much more! Starting with an insightful introduction by the legendary producer and video-game designer of Donkey Kong, Mario, and The Legend of Zelda, Shigeru Miyamoto, this book is crammed full of information about the storied history of Link's adventures from the creators themselves! As a bonus, The Legend of Zelda: Hyrule Historia includes an exclusive comic by the foremost creator of The Legend of Zelda manga — Akira Himekawa!", "webReaderLink": "http://play.google.com/books/reader?id=ZfzKDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "King Leopold's Ghost", "categories": ["History"], "authors": ["Adam Hochschild"], "printType": "BOOK", "pageCount": 400, "ratingsCount": 69, "averageRating": 4, "publisher": "Houghton Mifflin Harcourt", "publishedDate": "1999-09-03", "previewLink": "http://books.google.co.in/books?id=vYo-DO4tr-gC&printsec=frontcover&dq=name:King+Leopold%27s+Ghost&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=vYo-DO4tr-gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "\"An enthralling story . . . A work of history that reads like a novel.\" — Christian Science Monitor “As Hochschild’s brilliant book demonstrates, the great Congo scandal prefigured our own times . . . This book must be read and reread.” — Los Angeles Times Book Review In the late nineteenth century, as the European powers were carving up Africa, King Leopold II of Belgium carried out a brutal plundering of the territory surrounding the Congo River. Ultimately slashing the area’s population by ten million, he still managed to shrewdly cultivate his reputation as a great humanitarian. A tale far richer than any novelist could invent, King Leopold’s Ghost is the horrifying account of a megalomaniac of monstrous proportions. It is also the deeply moving portrait of those who defied Leopold: African rebel leaders who fought against hopeless odds and a brave handful of missionaries, travelers, and young idealists who went to Africa for work or adventure but unexpectedly found themselves witnesses to a holocaust and participants in the twentieth century’s first great human rights movement. A National Book Critics Circle Award Finalist A New York Times Notable Book", "webReaderLink": "http://play.google.com/books/reader?id=vYo-DO4tr-gC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Wright Brothers", "categories": ["History"], "authors": ["David McCullough"], "printType": "BOOK", "pageCount": 336, "ratingsCount": 3883, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2015-05-05", "previewLink": "http://books.google.co.in/books?id=bLudBAAAQBAJ&printsec=frontcover&dq=name:The+Wright+Brothers&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=bLudBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The #1 New York Times bestseller from David McCullough, two-time winner of the Pulitzer Prize—the dramatic story-behind-the-story about the courageous brothers who taught the world how to fly—Wilbur and Orville Wright. On a winter day in 1903, in the Outer Banks of North Carolina, two brothers—bicycle mechanics from Dayton, Ohio—changed history. But it would take the world some time to believe that the age of flight had begun, with the first powered machine carrying a pilot. Orville and Wilbur Wright were men of exceptional courage and determination, and of far-ranging intellectual interests and ceaseless curiosity. When they worked together, no problem seemed to be insurmountable. Wilbur was unquestionably a genius. Orville had such mechanical ingenuity as few had ever seen. That they had no more than a public high school education and little money never stopped them in their mission to take to the air. Nothing did, not even the self-evident reality that every time they took off, they risked being killed. In this “enjoyable, fast-paced tale” (The Economist), master historian David McCullough “shows as never before how two Ohio boys from a remarkable family taught the world to fly” (The Washington Post) and “captures the marvel of what the Wrights accomplished” (The Wall Street Journal). He draws on the extensive Wright family papers to profile not only the brothers but their sister, Katharine, without whom things might well have gone differently for them. Essential reading, this is “a story of timeless importance, told with uncommon empathy and fluency…about what might be the most astonishing feat mankind has ever accomplished…The Wright Brothers soars” (The New York Times Book Review).", "webReaderLink": "http://play.google.com/books/reader?id=bLudBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Becoming Queen", "categories": ["History"], "authors": ["Kate Williams"], "printType": "BOOK", "pageCount": 432, "ratingsCount": 11, "averageRating": 3, "publisher": "Random House", "publishedDate": "2013-05-31", "previewLink": "http://books.google.co.in/books?id=sJgl7PlGReoC&printsec=frontcover&dq=name:Becoming+Queen+Victoria:+The+Tragic+Death+of+Princess+Charlotte+and+the+Unexpected+Rise+of+Britain%27s+Greatest+Monarch&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=sJgl7PlGReoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Our perception of Victoria the Queen is coloured by portraits of her older, widowed self - her dour expression embodying the repressive morality propagated in her time. But Becoming Queen reveals an energetic and vibrant woman, determined to battle for power. It also documents the Byzantine machinations behind Victoria's quest to occupy the throne, and shows how her struggles did not end when finally the crown was placed on her head. Laying bare the passions that swirled around the throne in the eighteenth century, Becoming Queen is an absorbingly dramatic tale of secrets, sexual repression and endless conflict. After her lauded biography of Emma Hamilton, England's Mistress, Kate Williams has produced a most original and intimate portrait of Great Britain's longest reigning monarch.", "webReaderLink": "http://play.google.com/books/reader?id=sJgl7PlGReoC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Malcolm X", "categories": ["Biography & Autobiography"], "authors": ["Manning Marable"], "printType": "BOOK", "pageCount": 608, "ratingsCount": 14, "averageRating": 4, "publisher": "Penguin UK", "publishedDate": "2011-04-04", "previewLink": "http://books.google.co.in/books?id=X9iFvpxrd0kC&printsec=frontcover&dq=name:Malcolm+X:+A+Life+of+Reinvention&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=X9iFvpxrd0kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Constantly rewriting his own story, Malcolm X became a criminal, a minister, a leader, and eventually an icon, assassinated at the age of 39. The details of his life have long since calcified into a familiar narrative: his early years as a vagabond in Boston and New York, his conversion to Islam and subsequent rise to prominence as a militant advocate for black rights, his acrimonious split with the Nation of Islam, and ultimately his violent death at their hands. Yet this story, told and retold to various ends by writers, historians, and filmmakers, captures only a snapshot, a fraction of the man in full. Manning Marable's new biography is a stunning achievement, filled with new information and shocking revelations that will reframe the way we understand his life and work. Malcolm X unfolds a sweeping story of the darkest days of racial unrest, from the rise of the Ku Klux Klan to the struggles of the civil rights movement, examining his engagement with the Nation of Islam, and the romantic relationships whose energy alternately drained him and pushed him to unimagined heights. Malcolm X will stand as the definitive work on one of the most iconic figures of the twentieth century, a man who constantly strove, in the great American tradition, to remake himself anew.", "webReaderLink": "http://play.google.com/books/reader?id=X9iFvpxrd0kC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Secrets of the Flesh", "categories": ["Biography & Autobiography"], "authors": ["Judith Thurman"], "printType": "BOOK", "pageCount": 640, "ratingsCount": 3, "averageRating": 4, "publisher": "Ballantine Books", "publishedDate": "2011-03-30", "previewLink": "http://books.google.co.in/books?id=bRzkHkFDowQC&dq=name:Secrets+of+the+Flesh:+A+Life+of+Colette&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=bRzkHkFDowQC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A scandalously talented stage performer, a practiced seductress of both men and women, and the flamboyant author of some of the greatest works of twentieth-century literature, Colette was our first true superstar. Now, in Judith Thurman's Secrets of the Flesh, Colette at last has a biography worthy of her dazzling reputation. Having spent her childhood in the shadow of an overpowering mother, Colette escaped at age twenty into a turbulent marriage with the sexy, unscrupulous Willy--a literary charlatan who took credit for her bestselling Claudine novels. Weary of Willy's sexual domination, Colette pursued an extremely public lesbian love affair with a niece of Napoleon's. At forty, she gave birth to a daughter who bored her, at forty-seven she seduced her teenage stepson, and in her seventies she flirted with the Nazi occupiers of Paris, even though her beloved third husband, a Jew, had been arrested by the Gestapo. And all the while, this incomparable woman poured forth a torrent of masterpieces, including Gigi, Sido, Cheri, and Break of Day. Judith Thurman, author of the National Book Award-winning biography of Isak Dinesen, portrays Colette as a thoroughly modern woman: frank in her desires, fierce in her passions, forever reinventing herself. Rich with delicious gossip and intimate revelations, shimmering with grace and intelligence, Secrets of the Flesh is one of the great biographies of our time. NOTE: This edition does not include a photo insert.", "webReaderLink": "http://play.google.com/books/reader?id=bRzkHkFDowQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Room Full of Mirrors", "categories": ["Music"], "authors": ["Charles R. Cross"], "printType": "BOOK", "pageCount": 400, "ratingsCount": 9, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2006-08-08", "previewLink": "http://books.google.co.in/books?id=X2drAwAAQBAJ&printsec=frontcover&dq=name:Room+Full+of+Mirrors:+A+Biography+of+Jimi+Hendrix&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=X2drAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Now in paperback, the national bestselling biography of American musical icon Jimi Hendrix It has been more than thirty-five years since Jimi Hendrix died, but his music and spirit are still very much alive for his fans everywhere. Charles R. Cross vividly recounts the life of Hendrix, from his difficult childhood and adolescence in Seattle through his incredible rise to celebrity in London's swinging sixties. It is the story of an outrageous life--with legendary tales of sex, drugs, and excess--while it also reveals a man who struggled to accept his role as idol and who privately craved the kind of normal family life he never had. Using never-before-seen documents and private letters, and based on hundreds of interviews with those who knew Hendrix--many of whom had never before agreed to be interviewed--Room Full of Mirrors unlocks the vast mystery of one of music's most enduring legends.", "webReaderLink": "http://play.google.com/books/reader?id=X2drAwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Twelve Caesars", "categories": ["History"], "authors": ["Matthew Dennison"], "printType": "BOOK", "pageCount": 300, "ratingsCount": 7, "averageRating": 3, "publisher": "Atlantic Books Ltd", "publishedDate": "2012-05-01", "previewLink": "http://books.google.co.in/books?id=fohTkjVbXW0C&pg=PT44&dq=name:The+Twelve+Caesars&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=fohTkjVbXW0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "One of them was a military genius; one murdered his mother and fiddled while Rome burned. Six of their number were assassinated, two committed suicide, and five of them were elevated to the status of gods. They have come to be known as the 'twelve Caesars' - Julius Caesar, Augustus, Tiberius, Caligula, Claudius, Nero, Galba, Otho, Vitellius, Vespasian, Titus and Domitian. Under their rule, Rome was transformed from a republic to an empire, whose model of regal autocracy would survive in the West for more than a thousand years. In The Twelve Caesars, Matthew Dennison offers a beautifully crafted sequence of imperial portraits, triumphantly evoking the luxury, licence, brutality and sophistication of imperial Rome at its zenith.", "webReaderLink": "http://play.google.com/books/reader?id=fohTkjVbXW0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Real James Herriot", "categories": ["Biography & Autobiography"], "authors": ["Jim Wight"], "printType": "BOOK", "pageCount": 701, "ratingsCount": 6, "averageRating": 4, "publisher": null, "publishedDate": "2000", "previewLink": "http://books.google.co.in/books?id=6gs9PgAACAAJ&dq=name:The+Real+James+Herriot:+A+Memoir+of+My+Father&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=6gs9PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A portrait of the author of \"All Creatures Great and Small\" by his son describes the life and times of the Yorkshire veterinarian, his devotion to his family, his work as a rural veterinarian, and his writings.", "webReaderLink": "http://play.google.com/books/reader?id=6gs9PgAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Beautiful Mind", "categories": ["Biography & Autobiography"], "authors": ["Sylvia Nasar"], "printType": "BOOK", "pageCount": 464, "ratingsCount": 2, "averageRating": 4.5, "publisher": "Faber & Faber", "publishedDate": "2012-11-15", "previewLink": "http://books.google.co.in/books?id=uNPOmXAj1ScC&printsec=frontcover&dq=name:A+Beautiful+Mind&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=uNPOmXAj1ScC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A Beautiful Mind is Sylvia Nasar's award-winning biography about the mystery of the human mind, the triumph over incredible adversity, and the healing power of love. At the age of thirty-one, John Nash, mathematical genius, suffered a devastating breakdown and was diagnosed with schizophrenia. Yet after decades of leading a ghost-like existence, he was to re-emerge to win a Nobel Prize and world acclaim. A Beautiful Mind has inspired the Oscar-winning film directed by Ron Howard and featuring Russell Crowe in the lead role of John Nash.", "webReaderLink": "http://play.google.com/books/reader?id=uNPOmXAj1ScC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Explaining Hitler", "categories": ["History"], "authors": ["Ron Rosenbaum"], "printType": "BOOK", "pageCount": 490, "ratingsCount": null, "averageRating": null, "publisher": "Faber & Faber", "publishedDate": "2011-03-17", "previewLink": "http://books.google.co.in/books?id=f6MmCEzVs6oC&printsec=frontcover&dq=name:Hitler:+A+Study+in+Tyranny&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=f6MmCEzVs6oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Ever since the Second World War and the Holocaust, historians, psychologists and theologians alike have attempted to explain how a single personality could bring about some of the greatest horrors of the modern era. Ron Rosenbaum's Explaining Hitler investigates the meanings and motivations people have attached to Hitler and his disturbing policies - and whether or not he believed his own doctrines - and explores the continuing fascination with the nature of evil. The book also documents the story of the earliest critic of Hitler, the Munich Post in the 1920s and 1930s, and its violent demise. First published in 1998, and using interviews of leading experts such as Hugh Trevor-Roper, Alan Bullock and Daniel Goldhagen, and discussing the work of many more, Exploring Hitler is a balanced overview of a dark subject.", "webReaderLink": "http://play.google.com/books/reader?id=f6MmCEzVs6oC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "When Character Was King", "categories": ["Biography & Autobiography"], "authors": ["Peggy Noonan"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 5, "averageRating": 3.5, "publisher": "Penguin (Non-Classics)", "publishedDate": "2002-10-01", "previewLink": "http://books.google.co.in/books?id=5AwEHQAACAAJ&dq=name:When+Character+Was+King:+A+Story+of+Ronald+Reagan&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=5AwEHQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The author shares her unique insight into Ronald Reagan, arguing that his character and courage made him the object of reverence and respect in America.", "webReaderLink": "http://play.google.com/books/reader?id=5AwEHQAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "iCon Steve Jobs", "categories": ["Biography & Autobiography"], "authors": ["Jeffrey S. Young", "William L. Simon"], "printType": "BOOK", "pageCount": 368, "ratingsCount": 22, "averageRating": 3.5, "publisher": "Wiley", "publishedDate": "2006-04-14", "previewLink": "http://books.google.co.in/books?id=Qv6RHwAACAAJ&dq=name:iCon:+Steve+Jobs,+the+Greatest+Second+Act+in+the+History+of+Business&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Qv6RHwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "iCon takes a look at the most astounding figure in a business era noted for its mavericks, oddballs, and iconoclasts. Drawing on a wide range of sources, Jeffrey Young and William Simon provide new perspectives on the legendary creation of Apple, detail Jobs’s meteoric rise, and the devastating plunge that left him not only out of Apple, but out of the computer-making business entirely. This unflinching and completely unauthorized portrait reveals both sides of Jobs’s role in the remarkable rise of the Pixar animation studio, also re-creates the acrimony between Jobs and Disney’s Michael Eisner, and examines Jobs’s dramatic his rise from the ashes with his recapture of Apple. The authors examine the takeover and Jobs’s reinvention of the company with the popular iMac and his transformation of the industry with the revolutionary iPod. iCon is must reading for anyone who wants to understand how the modern digital age has been formed, shaped, and refined by the most influential figure of the age–a master of three industries: movies, music, and computers.", "webReaderLink": "http://play.google.com/books/reader?id=Qv6RHwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Douglas MacArthur", "categories": ["Language Arts & Disciplines"], "authors": ["Bernard K. Duffy", "Ronald H. Carpenter"], "printType": "BOOK", "pageCount": 223, "ratingsCount": null, "averageRating": null, "publisher": "Greenwood Publishing Group", "publishedDate": "1997", "previewLink": "http://books.google.co.in/books?id=PavSkTgefEMC&pg=PA25&dq=name:American+Caesar:+Douglas+MacArthur+1880-1964&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=PavSkTgefEMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Provides a balanced analysis of MacArthur's oratory from his \"Old Soldiers Never Die\" speech to the platitudes of his 1952 Republican convention address.", "webReaderLink": "http://play.google.com/books/reader?id=PavSkTgefEMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Ronald Reagan", "categories": ["Biography & Autobiography"], "authors": ["Dinesh D'Souza"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 3, "averageRating": 3, "publisher": "Simon and Schuster", "publishedDate": "1999-02-23", "previewLink": "http://books.google.co.in/books?id=Xn4JEGVh-bYC&printsec=frontcover&dq=name:Ronald+Reagan:+How+an+Ordinary+Man+Became+an+Extraordinary+Leader&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Xn4JEGVh-bYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Explores Reagan's political career, from his role in the California tax revolt to the economic success the United States experienced during his term in office", "webReaderLink": "http://play.google.com/books/reader?id=Xn4JEGVh-bYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Frida Kahlo, 1907-1954", "categories": ["Art"], "authors": ["Andrea Kettenmann", "Frida Kahlo"], "printType": "BOOK", "pageCount": 96, "ratingsCount": 3, "averageRating": 4.5, "publisher": "Taschen", "publishedDate": "2000", "previewLink": "http://books.google.co.in/books?id=s_ZdPsktyjEC&printsec=frontcover&dq=name:Frida+Kahlo:+1907-1954+Pain+and+Passion&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=s_ZdPsktyjEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "An account of the noted Mexican painter's difficult and tumultuous personal and professional life accompanies some of her most notable paintings.", "webReaderLink": "http://play.google.com/books/reader?id=s_ZdPsktyjEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Steve Jobs: the Unauthorized Autobiography", "categories": null, "authors": ["J. T. Owens"], "printType": "BOOK", "pageCount": 298, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "2019-10-05", "previewLink": "http://books.google.co.in/books?id=hCiQygEACAAJ&dq=name:Steve+Jobs:+The+Unauthorized+Autobiography&hl=&cd=1&source=gbs_api", "language": "en", "description": "Get a unique insight into the mind of visionary and creative genius Steve Jobs. The iconic entrepreneur and founder of Apple. One of the most significant innovators and inventors in history, responsible for ringing in the digital age and known for his perfectionist attitude and futuristic vision. Hear his story from his early childhood to revolutionizing the personal computer and handheld industry with the Mac, iPhone, iPad and more.. \"The world rarely sees someone who has had the profound impact Steve has had, the effects of which will be felt for many generations to come. \"Bill Gates\" I have met five British Prime Ministers, two American Presidents, Nelson Mandela, Michael Jackson and the Queen. My hour with Steve Jobs certainly made me more nervous than any of those encounters. \"Stephen Fry\" I think Steve Jobs is way cooler than I am. \"Elon Musk\"", "webReaderLink": "http://play.google.com/books/reader?id=hCiQygEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Strangest Man", "categories": ["Biography & Autobiography"], "authors": ["Graham Farmelo"], "printType": "BOOK", "pageCount": 560, "ratingsCount": 12, "averageRating": 4.5, "publisher": "Faber & Faber", "publishedDate": "2009-01-22", "previewLink": "http://books.google.co.in/books?id=-TT_z4llWoIC&printsec=frontcover&dq=name:The+Strangest+Man:+The+Hidden+Life+of+Paul+Dirac,+Mystic+of+the+Atom&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=-TT_z4llWoIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'A monumental achievement - one of the great scientific biographies.' Michael Frayn The Strangest Man is the Costa Biography Award-winning account of Paul Dirac, the famous physicist sometimes called the British Einstein. He was one of the leading pioneers of the greatest revolution in twentieth-century science: quantum mechanics. The youngest theoretician ever to win the Nobel Prize for Physics, he was also pathologically reticent, strangely literal-minded and legendarily unable to communicate or empathize. Through his greatest period of productivity, his postcards home contained only remarks about the weather. Based on a previously undiscovered archive of family papers, Graham Farmelo celebrates Dirac's massive scientific achievement while drawing a compassionate portrait of his life and work. Farmelo shows a man who, while hopelessly socially inept, could manage to love and sustain close friendship. The Strangest Man is an extraordinary and moving human story, as well as a study of one of the most exciting times in scientific history. 'A wonderful book . . . Moving, sometimes comic, sometimes infinitely sad, and goes to the roots of what we mean by truth in science.' Lord Waldegrave, Daily Telegraph", "webReaderLink": "http://play.google.com/books/reader?id=-TT_z4llWoIC&hl=&printsec=frontcover&source=gbs_api"}]