[{"title": "Fifty Shades of Grey", "categories": ["Fiction"], "authors": ["E. L. James"], "printType": "BOOK", "pageCount": 514, "ratingsCount": 418, "averageRating": 2.5, "publisher": "Doubleday", "publishedDate": "2013-01-29", "previewLink": "http://books.google.co.in/books?id=GbVdlAEACAAJ&dq=name:Fifty+Shades+of+Grey&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=GbVdlAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "When Anastasia Steele, a young literature student, interviews wealthy young entrepreneur Christian Grey for her campus magazine, their initial meeting introduces Anastasia to an exciting new world that will change them both forever.", "webReaderLink": "http://play.google.com/books/reader?id=GbVdlAEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Pride and Prejudice", "categories": null, "authors": ["Jane Austen"], "printType": "BOOK", "pageCount": 148, "ratingsCount": 441, "averageRating": 4, "publisher": null, "publishedDate": "2015-06-22", "previewLink": "http://books.google.co.in/books?id=q-b9sgEACAAJ&dq=name:Pride+and+Prejudice&hl=&cd=1&source=gbs_api", "language": "en", "description": "Everyone knows that a rich, unmarried man needs a pretty wife. And every mother wants her daughters to be happily married. Mr and Mrs Bennet of Longbourn House, in the village of Longbourn, had five unmarried daughters. So when Mrs Bennet heard that a young man was coming to live in the neighbourhood, she was delighted'. She found out all she could about him, and hurried to tell her husband the good news.'Oh, Mr Bennet, Netherfield Hall is let at last!' Mrs Bennet cried excitedly. 'Don't you want to know who is going to live there?'No,' Mr Bennet answered, 'but I am sure you want to tell me.' 'The house is let to a young man from the north of England. His name is Bingley, he's very rich and not married. What a chance this is for our dear Jane! Everyone knows she's the most beautiful girl in Hertfordshire. She's so good-natured too. She will be an excellent wife for Mr Bingley.'I shall be very happy to have her living so near us. And in a fine house like Netherfield too! Mr Bingley plans to live there with his sister. She and Jane''Please stop a moment, Mrs Bennet,' her husband said quietly. Why are you telling me all this? Mr Bingley is a stranger. But you are saying that he has come here to marry one of our daughters!''I did not say that,' Mrs Bennet answered. 'But we must think of our daughters' future. You must call on Mr Bingley at once, Mr Bennet.''I don't think so, my dear,' Mr Bennet said calmly. 'But I'll write to this young man and give him my permission to marry Jane or whoever he chooses. Perhaps he'd like to marry my little Lizzy.''Don't tease me, please, Mr Bennet,' Mrs Bennet replied. 'I know Lizzy is your favourite daughter, but she is not as beautiful as Jane, nor as lively as Lydia.''Our girls are silly and thoughtless,' Mr Bennet said severely. 'But Lizzy is a little more sensible than the others.'Mr and Mrs Bennet were not happily married. After twenty-three years, Mr Bennet was tired of his wife's chatter and love of gossip. And Mrs Bennet had never understood her husband's sense of humour.A few days later, Mr Bennet called on Mr Bingley, without telling Mrs Bennet. She was delighted when she found out that Mr Bennet had called at Netherfield Hall.'Girls, you have such a good father!' Mrs Bennet cried. 'You will thank him for calling at Netherfield, Jane, when you are married to Mr Bingley.'You must look very beautiful at the next assembly ball, my dear,' Mrs Bennet went on, 'I'm sure that Mr Bingley will be there.'On the following Friday, the assembly rooms in the town of Meryton were crowded. Everyone stared as Mr Bingley came in with two ladies and two gentlemen.The fashionably dressed young woman with Mr Bingley was his unmarried sister, Miss Caroline Bingley. Mr Bingley's married sister, Louisa Hurst, was also there, with her husband. The other gentleman was Mr Bingley's friend, Mr Fitzwilliam Darcy.Mr Bingley was a good-looking young man with a pleasant smile. Mr Darcy was tall, very handsome and from a noble family. People said he had twice as much money as Mr Bingley and a large estate in Derbyshire. He was also unmarried.At first, everyone admired Mr Darcy. But he danced only with Bingley's sisters and spoke to no one else. Mrs Bennet and her friends soon agreed that, although Mr Darcy was a fine gentleman, he was much too proud.", "webReaderLink": "http://play.google.com/books/reader?id=q-b9sgEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Beautiful Disaster Signed Limited Edition", "categories": ["Fiction"], "authors": ["Jamie McGuire"], "printType": "BOOK", "pageCount": 432, "ratingsCount": 1, "averageRating": 5, "publisher": "Simon and Schuster", "publishedDate": "2012-11-27", "previewLink": "http://books.google.co.in/books?id=2dKp8VsPm30C&printsec=frontcover&dq=name:Beautiful+Disaster&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2dKp8VsPm30C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Travis Maddox, Eastern University's playboy, makes a bet with good girl Abby that if he loses, he will remain abstinent for a month, but if he wins, Abby must live in his apartment for the same amount of time.", "webReaderLink": "http://play.google.com/books/reader?id=2dKp8VsPm30C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Twilight", "categories": ["Fiction"], "authors": ["Kristen Heitzmann"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 10, "averageRating": 4, "publisher": "Bethany House", "publishedDate": "2002-07-01", "previewLink": "http://books.google.co.in/books?id=R35zBQAAQBAJ&pg=PA197&dq=name:Twilight&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=R35zBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A powerful contemporary novel that reunites two former high school sweethearts. Can they provide the help the other needs, or are their own problems too great to overcome?", "webReaderLink": "http://play.google.com/books/reader?id=R35zBQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Perfect Chemistry", "categories": ["Juvenile Fiction"], "authors": ["Simone Elkeles"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 233, "averageRating": 4, "publisher": "Bloomsbury Publishing USA", "publishedDate": "2015-01-06", "previewLink": "http://books.google.co.in/books?id=uOSZBQAAQBAJ&dq=name:Perfect+Chemistry&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=uOSZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "When wealthy Brittany Ellis and Alex Fuentes, a gang member from the other side of town, develop a relationship after Alex discovers that Brittany is not exactly who she seems to be, they must face the disapproval of others.", "webReaderLink": "http://play.google.com/books/reader?id=uOSZBQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Notebook", "categories": ["Fiction"], "authors": ["Nicholas Sparks"], "printType": "BOOK", "pageCount": 300, "ratingsCount": 160, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2000-01-05", "previewLink": "http://books.google.co.in/books?id=xT44AQAAQBAJ&dq=name:The+Notebook&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=xT44AQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Experience the unforgettable, heartbreaking love story set in post-World War II North Carolina about a young socialite and the boy who once stole her heart -- one of PBS's \"Great American Reads\". Every so often a love story so captures our hearts that it becomes more than a story-it becomes an experience to remember forever. The Notebook is such a book. It is a celebration of how passion can be ageless and timeless, a tale that moves us to laughter and tears and makes us believe in true love all over again... At thirty-one, Noah Calhoun, back in coastal North Carolina after World War II, is haunted by images of the girl he lost more than a decade earlier. At twenty-nine, socialite Allie Nelson is about to marry a wealthy lawyer, but she cannot stop thinking about the boy who long ago stole her heart. Thus begins the story of a love so enduring and deep it can turn tragedy into triumph, and may even have the power to create a miracle...", "webReaderLink": "http://play.google.com/books/reader?id=xT44AQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Outlander", "categories": ["Audiobooks"], "authors": ["Diana Gabaldon"], "printType": "BOOK", "pageCount": null, "ratingsCount": 2367, "averageRating": 3.5, "publisher": "Clipper Audio", "publishedDate": "2015-04-23", "previewLink": "http://books.google.co.in/books?id=efjWjwEACAAJ&dq=name:Outlander&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=efjWjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "1945, Claire Randall goes to the Scottish Highlands with her husband Frank. One afternoon, Claire walks through a circle of standing stones and vanishes into 1743, falling into the hands of a gang of Scottish outlaws. Marooned amid danger, passion and violence, her only chance of safety lies in Jamie Fraser, a gallant young Scots warrior. What begins in compulsion becomes urgent need, and Claire finds herself torn between two very different men, in two irreconcilable lives.", "webReaderLink": "http://play.google.com/books/reader?id=efjWjwEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Jane Eyre", "categories": ["Fiction"], "authors": ["Charlotte Bronte"], "printType": "BOOK", "pageCount": 624, "ratingsCount": null, "averageRating": null, "publisher": "Penguin UK", "publishedDate": "2006-06-29", "previewLink": "http://books.google.co.in/books?id=lbd5PyAFfikC&pg=PT24&dq=name:Jane+Eyre&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=lbd5PyAFfikC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'The masterwork of a great genius' William Makepeace Thackeray A novel of intense emotional power, heightened atmosphere and fierce intelligence, Jane Eyre dazzled and shocked readers with its passionate depiction of a woman's search for equality and freedom on her own terms. Its heroine Jane endures loneliness and cruelty in the home of her heartless aunt and the cold charity of Lowood School. Her natural independence and spirit prove necessary when she takes a position as governess at Thornfield Hall. But when she finds love with her sardonic employer, Rochester, the discovery of a shameful secret forces her to make a terrible choice. Edited with an Introduction and notes by STEVIE DAVIES", "webReaderLink": "http://play.google.com/books/reader?id=lbd5PyAFfikC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Domestic Space in Eighteenth-Century British Novels", "categories": ["Language Arts & Disciplines"], "authors": ["Karen Lipsedge"], "printType": "BOOK", "pageCount": 215, "ratingsCount": null, "averageRating": null, "publisher": "Palgrave Macmillan", "publishedDate": "2012-09-28", "previewLink": "http://books.google.co.in/books?id=G79hzv52yhgC&pg=PA175&dq=name:Thoughtless&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=G79hzv52yhgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Examining the work of three authors: Richardson, Haywood and Burney, and their representation of domestic space, this book argues that to make such spaces accessible to modern readers they need to have information of the real domestic. By recreating specifics of these spaces this book innervates the fictional domestic interior for modern readers.", "webReaderLink": "http://play.google.com/books/reader?id=G79hzv52yhgC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Bared to You", "categories": ["Fiction"], "authors": ["Sylvia Day"], "printType": "BOOK", "pageCount": 338, "ratingsCount": 94, "averageRating": 3.5, "publisher": "Penguin", "publishedDate": "2014-02", "previewLink": "http://books.google.co.in/books?id=2FiLDQAAQBAJ&dq=name:Bared+to+You&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2FiLDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Eva Trammel, plagued by her own insecurities, is drawn into an intense, obssessive relationship with the wealthy and arrogant Gideon Cross. \"Gideon Cross came into my life like lightning in the darkness. He was beautiful and brilliant, jagged and white-hot. I was drawn to him as I'd never been to anyone in my life. I craved his touch like a drug, even knowing it would weaken me. I was flawed and damaged, and he opened those cracks in me so easily. Gideon knew. He had demons of his own. And we would become the mirrors that reflected each other's most private wounds and desires. The bonds of his love transformed me, even as I prayed that the torment of our pasts didn't tear us apart.\"--Back cover.", "webReaderLink": "http://play.google.com/books/reader?id=2FiLDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "All Ye That Fear Jehovah’s Name Easy Piano Sheet Music", "categories": ["Art"], "authors": ["Traditional Hymn"], "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": "Lulu Press, Inc", "publishedDate": "2016-03-14", "previewLink": "http://books.google.co.in/books?id=2H_cCwAAQBAJ&pg=PP1&dq=name:Easy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2H_cCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Traditional Hymn for Easy Piano A SilverTonalities Arrangement! Easy Note Style Sheet Music Letter Names of Notes embedded in each Notehead!", "webReaderLink": "http://play.google.com/books/reader?id=2H_cCwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Gone with the Wind", "categories": ["Fiction"], "authors": ["Margaret Mitchell"], "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": "Strelbytskyy Multimedia Publishing", "publishedDate": "2020-01-10", "previewLink": "http://books.google.co.in/books?id=2ubIDwAAQBAJ&printsec=frontcover&dq=name:Gone+with+the+Wind&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2ubIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Gone With the Wind, a 1936 novel by Margaret Mitchell—winner of the Pulitzer Prize and one of the bestselling novels of all time—has been heralded by readers everywhere as The Great American Novel. Gone with the Wind is often placed in the literary subgenre of the historical romance novel. The epic romance tale set in and around Atlanta, Georgia during the American Civil War has remained a bestseller, even before the equally popular film starring Clark Gable and Vivian Leigh was made in 1939. The novel has also been described as an early classic of the erotic historical genre, because it is thought to contain some degree of pornography. The novel tells of archetypal Southern belle Scarlett O'Hara as she grows from a young woman into maturity against the backdrop of the American Civil War. Like many of the early 20th century Southern writers, Mitchell portrays an idyllic image of the antebellum South. While it can be legitimately criticized for its insensitivity to the treatment of African Americans who were enslaved, Mitchell's novel demonstrates how the South was decimated by the Civil War and continued to suffer under the Northern-sanctioned Restoration.", "webReaderLink": "http://play.google.com/books/reader?id=2ubIDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Gabriel's Inferno", "categories": ["Fiction"], "authors": ["Sylvain Reynard"], "printType": "BOOK", "pageCount": 560, "ratingsCount": 67, "averageRating": 3.5, "publisher": "Penguin Group Australia", "publishedDate": "2012-08-23", "previewLink": "http://books.google.co.in/books?id=Rzg-o0kEFnAC&dq=name:Gabriel%27s+Inferno&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Rzg-o0kEFnAC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "From bestselling author Sylvain Reynard comes the haunting, unforgettable tale of one man's salvation and one woman's sensual awakening . . . Enigmatic and sexy, Professor Gabriel Emerson is a well-respected Dante specialist by day, but by night he devotes himself to an uninhibited life of pleasure. He uses his notorious good looks and sophisticated charm to gratify his every whim, but is secretly tortured by his dark past and consumed by the profound belief that he is beyond all hope of redemption. When the sweet and innocent Julia Mitchell enrolls as his graduate student, his attraction and mysterious connection to her not only jeopardizes his career, but sends him on a journey in which his past and his present collide. An intriguing and sinful exploration of seduction, forbidden love, and redemption, Gabriel's Inferno is a captivating and wildly passionate tale of one man's escape from his own personal hell as he tries to earn the impossible—forgiveness and love. 'You're only a magnet for mishap, Miss Mitchell, while I am a magnet for sin.'", "webReaderLink": "http://play.google.com/books/reader?id=Rzg-o0kEFnAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Hope's Boy", "categories": ["Biography & Autobiography"], "authors": ["Andrew Bridge"], "printType": "BOOK", "pageCount": 368, "ratingsCount": 7, "averageRating": 4.5, "publisher": "Hachette UK", "publishedDate": "2008-07-10", "previewLink": "http://books.google.co.in/books?id=R-sOcZ5QuUkC&pg=PT278&dq=name:Slammed&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=R-sOcZ5QuUkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Andrew grew up in the 1970s with his funny, loving but deeply unstable mother. Life with her was totally chaotic. She left him alone in motel rooms at night and took him with her when she went house burgling. But Andrew's mother wasn't bad, she was just lost herself and one thing she did was always tell him she loved him. Gradually, though, the bad times got worse. One day Andrew, aged seven, found his mother in the bathroom in the middle of a breakdown, the walls covered in her pleas for help all written in the blood from the cuts she'd inflicted on herself. He was taken into care and put with a foster family who treated him with loneliness and neglect at best and cruel indifference as standard. This is a groundbreaking story of a childhood destroyed by mental illness. It is also a heartbreaking love story about a mother's legacy of love.", "webReaderLink": "http://play.google.com/books/reader?id=R-sOcZ5QuUkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Time Traveler's Wife", "categories": ["Fiction"], "authors": ["Audrey Niffenegger"], "printType": "BOOK", "pageCount": 571, "ratingsCount": 154, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2014-05-06", "previewLink": "http://books.google.co.in/books?id=tgd_AwAAQBAJ&printsec=frontcover&dq=name:The+Time+Traveler%27s+Wife&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=tgd_AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Passionately in love, Clare and Henry vow to hold onto each other and their marriage as they struggle with the effects of Chrono-Displacement Disorder, a condition that casts Henry involuntarily into the world of time travel.", "webReaderLink": "http://play.google.com/books/reader?id=tgd_AwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Anna and the French Kiss", "categories": ["Juvenile Fiction"], "authors": ["Stephanie Perkins"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 2157, "averageRating": 4, "publisher": "Usborne Publishing Ltd", "publishedDate": "2013-12-16", "previewLink": "http://books.google.co.in/books?id=o0J8AwAAQBAJ&printsec=frontcover&dq=name:Anna+and+the+French+Kiss&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=o0J8AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Anna is less than thrilled to be shipped off to boarding school in Paris, leaving a fledgling romance behind – until she meets Étienne St. Clair. Smart, charming, beautiful, Étienne has it all...including a girlfriend. But in the City of Light, wishes have a way of coming true. Will a year of romantic near-misses end with a longed-for French kiss? \"Magical...really captures the feeling of being in love\" - Cassandra Clare, author of The Mortal Instruments series NPR's Year's Best Teen Reads, 2010. NPR's 100 Best-Ever Teen Novels, Number 53. Cybils Award Finalist for Young Adult Fiction, 2011. YALSA's Best Fiction for Young Adults. 2012 list YALSA's Popular Paperbacks for Young Adults: Forbidden Romance, 2012. TAYSHAS Reading List, 2012. Georgia Peach Book Award for Teen Readers, Honor, 2012-13.", "webReaderLink": "http://play.google.com/books/reader?id=o0J8AwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Vampire Academy", "categories": ["Juvenile Fiction"], "authors": ["Richelle Mead"], "printType": "BOOK", "pageCount": 336, "ratingsCount": 278, "averageRating": 4, "publisher": "Penguin UK", "publishedDate": "2009-05-26", "previewLink": "http://books.google.co.in/books?id=e2EI76-_-vIC&dq=name:Vampire+Academy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=e2EI76-_-vIC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Welcome to St. Vladimir, Vampire Academy. This book introduces the friendship between Rosa - half-human, half-vampire, and Lissa, a mortal vampire princess. This is book 1 of a series of 6 books (thus far!). Vietnamese translation by Vu Gia An. In Vietnamese. Distributed by Tsai Fong Books, Inc.", "webReaderLink": "http://play.google.com/books/reader?id=e2EI76-_-vIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Dark Lover", "categories": ["Fiction"], "authors": ["J.R. Ward"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 2879, "averageRating": 3.5, "publisher": "Penguin", "publishedDate": "2005-09-06", "previewLink": "http://books.google.co.in/books?id=If3o_UU9s24C&pg=PT543&dq=name:Dark+Lover&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=If3o_UU9s24C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "See where it all began in the first phenomenal novel in the #1 New York Times bestselling Black Dagger Brotherhood series... The only purebred vampire left on the planet and the leader of the Black Dagger Brotherhood, Wrath has a score to settle with the slayers who killed his parents centuries ago. But when his most trusted fighter is killed—orphaning a half-breed daughter unaware of her heritage or her fate—Wrath must put down his dagger and usher the beautiful female into another world. Racked by a restlessness in her body that wasn’t there before, Beth Randall is helpless against the dangerously sexy man who comes to her at night with shadows in his eyes. His tales of the Brotherhood and blood frighten her. Yet his touch ignites a dawning new hunger—one that threatens to consume them both... INCLUDES A NEW LETTER FROM J. R. WARD", "webReaderLink": "http://play.google.com/books/reader?id=If3o_UU9s24C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Walk to Remember", "categories": ["Study Aids"], "authors": ["Nicholas Sparks"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 1, "averageRating": 5, "publisher": "Hachette UK", "publishedDate": "2014-09-09", "previewLink": "http://books.google.co.in/books?id=ZYlgBAAAQBAJ&printsec=frontcover&dq=name:A+Walk+to+Remember&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ZYlgBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "NOVEL LEARNING SERIES(TM) A WALK TO REMEMBER by Nicholas Sparks STUDENT EDITION \"When I was seventeen, my life changed forever . . . \" So begins Nicholas Sparks's touching tale of Landon Carter, a teenage boy living in the small town of Beaufort, North Carolina in the late 1950s. Landon is a typical teenager who just wants to have a fun senior year before heading off to college. The last thing he anticipated is Jamie Sullivan, the sweet, pious daughter of the town's Baptist minister. But on the evening of Beaufort's annual Christmas pageant, Landon will undergo a change of heart that will forever alter the course of his life. In the months that follow, Landon discovers truths that it takes most people a lifetime to learn-truths about the nature of beauty, the joy of giving, the pain of loss, and, most of all, the transformational power of love. With a NOVEL LEARNING SERIES(TM) Student Guide · Questions about the text after every few chapters check your comprehension · Quizzes throughout help you prepare for standardized tests with SAT- and ACT-style questions using vocabulary and grammar from the book · Sample writing prompts and essays at the end guide you through the elements of an above-average, average, and below-average essay-and explain why!", "webReaderLink": "http://play.google.com/books/reader?id=ZYlgBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Wuthering Heights", "categories": ["English fiction"], "authors": ["Emily Brontë"], "printType": "BOOK", "pageCount": 288, "ratingsCount": 21, "averageRating": 4.5, "publisher": null, "publishedDate": "1848", "previewLink": "http://books.google.co.in/books?id=U68lAAAAMAAJ&pg=PP1&dq=name:Wuthering+Heights&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=U68lAAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=U68lAAAAMAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Hush, Hush", "categories": ["Fiction"], "authors": ["Becca Fitzpatrick"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 2786, "averageRating": 3, "publisher": "Simon and Schuster", "publishedDate": "2012-05-22", "previewLink": "http://books.google.co.in/books?id=Oi3AFS3H6JYC&printsec=frontcover&dq=name:Hush,+Hush&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Oi3AFS3H6JYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "High school sophomore Nora has always been very cautious in her relationships, but when Patch, who has a dark side she can sense, enrolls at her school, she is mysteriously and strongly drawn to him, despite warnings from her best friend, the school counselor, and her own instincts.", "webReaderLink": "http://play.google.com/books/reader?id=Oi3AFS3H6JYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Glorious Name of God, the Lord of Hosts", "categories": ["Bible"], "authors": ["Jeremiah Burroughs"], "printType": "BOOK", "pageCount": 142, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1643", "previewLink": "http://books.google.co.in/books?id=1DI3AAAAMAAJ&pg=PA85&dq=name:The+Host&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=1DI3AAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=1DI3AAAAMAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Fault in Our Stars", "categories": ["Young Adult Fiction"], "authors": ["John Green"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 1783, "averageRating": 4.5, "publisher": "Penguin UK", "publishedDate": "2012-05-03", "previewLink": "http://books.google.co.in/books?id=Qk8n0olOX5MC&printsec=frontcover&dq=name:The+Fault+in+Our+Stars&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Qk8n0olOX5MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "I fell in love the way you fall asleep: slowly, then all at once. Despite the tumour-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten. Insightful, bold, irreverent, and raw, The Fault in Our Stars brilliantly explores the funny, thrilling, and tragic business of being alive and in love. Praise for The Fault in Our Stars: Sunday Times (Culture) 'A touching, often fiercely funny novel' The Sun on Sunday (Fabulous Magazine) 'So good I think it should be compulsory reading for everyone!' Daily Express 'John Green brilliantly captures the voices of a young generation while instilling it with the wisdom of a life that has lived too much yet will never live enough' The Metro - 2013 Best Fiction 'The love affair of two terminally ill teenagers could be mawkish. In fact, it's funny, clever, irreverent and life-affirming.' Grazia 'So good!' Good Housekeeping 'As funny as it is heartbreaking... we defy you not to fall in love with its main characters, Hazel and Augustus.' The Tablet 'A humourous and poignant love story... It's terrifically funny... as well as a moving exploration of loss and grief. And no, it's so much not just for teenage cancer sufferers... it's for everyone.' Bliss 'If you need inspiration when it comes to making the most of a moment, this one is for you' Mizz 'Insightful, bold, irreverent and raw, if this doesn't make you cry, it'll definitely make you think, laugh and maybe even fall in love yourself!'", "webReaderLink": "http://play.google.com/books/reader?id=Qk8n0olOX5MC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Persuasion", "categories": ["Language Arts & Disciplines"], "authors": ["Daniel J. O'Keefe"], "printType": "BOOK", "pageCount": 408, "ratingsCount": null, "averageRating": null, "publisher": "SAGE Publications", "publishedDate": "2015-02-18", "previewLink": "http://books.google.co.in/books?id=HXq3BgAAQBAJ&pg=PA302&dq=name:Persuasion&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=HXq3BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Persuasion: Theory and Research, Third Edition is a comprehensive overview of social-scientific theory and research on persuasion. Written in a clear and accessible style that assumes no special technical background in research methods, the Third Edition has been thoroughly revised to reflect developments in persuasion studies. New discussions of subjects such as reactance and the use of narratives as vehicles for persuasion, revised treatments of the theories of reasoned action and planned behavior, and two new chapters on social judgment theory and stage models provide your students with the most current work on persuasion in a clear, straightforward manner. In this edition, author Daniel J. O'Keefe has given special attention to the importance of adapting (tailoring) messages to audiences to maximize persuasiveness. Each chapter has a set of review questions to guide students through the chapter’s material and quickly master the concepts being introduced.", "webReaderLink": "http://play.google.com/books/reader?id=HXq3BgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Sense and Sensibility", "categories": null, "authors": ["Jane Austen"], "printType": "BOOK", "pageCount": 340, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1864", "previewLink": "http://books.google.co.in/books?id=RJcVAAAAYAAJ&printsec=frontcover&dq=name:Sense+and+Sensibility&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RJcVAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=RJcVAAAAYAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Divergent (Divergent Trilogy, Book 1)", "categories": ["Fiction"], "authors": ["Veronica Roth"], "printType": "BOOK", "pageCount": 496, "ratingsCount": 833, "averageRating": 4, "publisher": "HarperCollins UK", "publishedDate": "2013-11-07", "previewLink": "http://books.google.co.in/books?id=OX8lAAAAQBAJ&printsec=frontcover&dq=name:Divergent&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=OX8lAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The explosive debut by No. 1 New York Times bestselling author Veronica Roth. DIVERGENT – a major motion picture series.", "webReaderLink": "http://play.google.com/books/reader?id=OX8lAAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "City of Bones", "categories": ["Young Adult Fiction"], "authors": ["Cassandra Clare"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 2689, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2009-04-14", "previewLink": "http://books.google.co.in/books?id=UwH5IwTWH3EC&printsec=frontcover&dq=name:City+of+Bones&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=UwH5IwTWH3EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Discover this first installment of the internationally bestselling Mortal Instruments series and “prepare to be hooked” (Entertainment Weekly). When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder -- much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing -- not even a smear of blood -- to show that a boy has died. Or was he a boy? This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance, when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know... Exotic and gritty, exhilarating and utterly gripping, Cassandra Clare's ferociously entertaining fantasy takes readers on a wild ride that they will never want to end.", "webReaderLink": "http://play.google.com/books/reader?id=UwH5IwTWH3EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "From the Dragon Keepers' Vault: Leandra and Obsidian", "categories": ["Juvenile Fiction"], "authors": ["Kate Klimo"], "printType": "BOOK", "pageCount": 35, "ratingsCount": null, "averageRating": null, "publisher": "Random House Books for Young Readers", "publishedDate": "2012-05-08", "previewLink": "http://books.google.co.in/books?id=qNQwLf5FwjwC&pg=PT15&dq=name:Obsidian&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=qNQwLf5FwjwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The Dragon Keeper series bridges the gap between Magic Tree House Merlin Missions and Harry Potter. An original short story (only available electronically!) adds background information to the newest book in this magical middle grade adventure series. It's an exciting adventure featuring Emmy's parents and the origins of the second dragon egg that appears in The Dragon in the Sea (Dragon Keepers #5). Praise for The Dragon in the Sock Drawer: \"Funny and wonderfully written--a tall-tale adventure sure to grab young readers.\"--Mary Pope Osborne \"This novel, with its unique and modern twists, is a great addition to the dragon genre for younger readers.\"--School Library Journal", "webReaderLink": "http://play.google.com/books/reader?id=qNQwLf5FwjwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Love Unscripted", "categories": ["Fiction"], "authors": ["Tina Reber"], "printType": "BOOK", "pageCount": 579, "ratingsCount": 27, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2013", "previewLink": "http://books.google.co.in/books?id=fXDqqzofpjEC&pg=PA365&dq=name:Love+Unscripted&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=fXDqqzofpjEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "When Hollywood heartthrob Ryan Christensen unexpectedly comes into her life, Taryn Mitchell finds herself falling hard, but wonders if their newfound relationship is strong enough to withstand the tabloids, the paparazzi, and jealous fans.", "webReaderLink": "http://play.google.com/books/reader?id=fXDqqzofpjEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Book of Cook Islands Maori Names, Ingoa", "categories": ["Names, Maori"], "authors": ["Jon Jonassen"], "printType": "BOOK", "pageCount": 159, "ratingsCount": null, "averageRating": null, "publisher": "editorips@usp.ac.fj", "publishedDate": "2003", "previewLink": "http://books.google.co.in/books?id=mm07nZfD82kC&pg=PA70&dq=name:On+the+Island&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=mm07nZfD82kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=mm07nZfD82kC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Memoirs of a Geisha", "categories": ["Foreign Language Study"], "authors": ["Arthur Golden", "Michael Dean"], "printType": "BOOK", "pageCount": 105, "ratingsCount": 1589, "averageRating": 4, "publisher": "Longman", "publishedDate": "2009-02-27", "previewLink": "http://books.google.co.in/books?id=oss8PgAACAAJ&dq=name:Memoirs+of+a+Geisha&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=oss8PgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "\"Captivating, minutely imagined . . . a novel that refuses to stay shut\" (\"Newsweek\"), \"Memoirs of a Geisha\" is now released in a movie tie-in edition.", "webReaderLink": "http://play.google.com/books/reader?id=oss8PgAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Shiver", "categories": ["Fiction"], "authors": ["Hans Von Osten"], "printType": "BOOK", "pageCount": 360, "ratingsCount": 7, "averageRating": 5, "publisher": "Hans von Osten", "publishedDate": "2010-12-03", "previewLink": "http://books.google.co.in/books?id=l51TJ5q_A7EC&pg=PA316&dq=name:Shiver&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=l51TJ5q_A7EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This is a rollicking novel about marriage in America with epic depictions of bad weather and even worse human behavior [adult situations, language, sexual content]. It is the story of a man who not only loved women but married twelve of them. It is also a chronicle of America; and like the last half of the 20th century, it is a wild ride with our matrimonial hero circumnavigating the country and having adventures you could only hope to imagine and pray to avoid. Alternately shocking, funny, radical, literary, and religious (while only occasionally sad in the tradition of Tom Jones and Moll Flanders), this virtuoso first novel reinvents the picaresque entertainments popularized by Henry Fielding and Daniel Defoe. So put away your other novels of Scandinavian sorrow and introduce yourself to a new American author.", "webReaderLink": "http://play.google.com/books/reader?id=l51TJ5q_A7EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Hope for a Hopeless Day: Encouragement and Inspiration When You Need It Most (Large Print 16pt)", "categories": ["Religion"], "authors": ["Jack W. Hayford"], "printType": "BOOK", "pageCount": 122, "ratingsCount": 2, "averageRating": 5, "publisher": "ReadHowYouWant.com", "publishedDate": "2011-08", "previewLink": "http://books.google.co.in/books?id=cXkoFWKwvecC&pg=PA88&dq=name:Hopeless&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=cXkoFWKwvecC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "When no hope is left, to whom should we turn? Through the words of Jesus as He was dying on the Cross, Jack Hayford unfolds the secret of triumphing over the ultimate season of suffering. Establishing a framework for dealing with hardship, Hope for a Hopeless Day challenges readers to examine the way they handle trials and encourages them to focus on the power that frees - the cross. Here are real - life stories of individuals who triumphed over their ''hopeless days.'' Readers will be heartened by their stories of bravery and integrity - even while facing the anguish of marital infidelity or financial collapse. Although facing what seems like insurmountable odds, ''we are called to hope just as surely as we are called to the Cross, for the Savior who speaks there is teaching us the way to live as surely as He is dying to give us life.'' Hope for a Hopeless Day does more than encourage you to endure; it inspires you to overcome.", "webReaderLink": "http://play.google.com/books/reader?id=cXkoFWKwvecC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Dublin Street Names", "categories": ["Street names"], "authors": ["Paul Clerkin"], "printType": "BOOK", "pageCount": 196, "ratingsCount": null, "averageRating": null, "publisher": "Newleaf", "publishedDate": "2001", "previewLink": "http://books.google.co.in/books?id=EecqAAAACAAJ&dq=name:On+Dublin+Street&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=EecqAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "In 'Dublin Street Names', Paul Clerkin lists over 300 streets - mainly in central Dublin - and explains how they got their names. Everyone knows that O'Connell Street is named for Daniel O'Connell, but who was the Nassau in Nassau Street, or the Grafton in Grafton Street?", "webReaderLink": "http://play.google.com/books/reader?id=EecqAAAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Halfway to the Grave", "categories": ["Fiction"], "authors": ["Jeaniene Frost"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 117, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2010-04-22", "previewLink": "http://books.google.co.in/books?id=JaFcFXfTkCUC&printsec=frontcover&dq=name:Halfway+to+the+Grave&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=JaFcFXfTkCUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Half-vampire Catherine Crawfield is going after the undead with a vengeance, hoping that one of those deadbeats is her father - the guy responsible for ruining her mother's life. But when she's captured by Bones, a bounty hunter and a vampire, she finds herself forced into an unholy partnership. In exchange for his help in finding her father, and still astonished she hasn't ended up as his dinner, Cat agrees to train with the sexy night stalker until her battle reflexes are as sharp as his fangs. But that's not all Bones has to show her - Cat's starting to believe maybe vampires aren't all evil after all, especially ones as cute as Bones. She's half-convinced that being half-dead doesn't have to be all bad. But before she can enjoy her newfound status as confident kick-ass demon hunter Cat finds herself, and Bones, hotly pursued by a band of killers. She's is going to have to pick a side - and fast ...", "webReaderLink": "http://play.google.com/books/reader?id=JaFcFXfTkCUC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Truth About Forever", "categories": ["Juvenile Fiction"], "authors": ["Sarah Dessen"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 126, "averageRating": 4, "publisher": "Penguin UK", "publishedDate": "2008-05-01", "previewLink": "http://books.google.co.in/books?id=k15qaAaw1tAC&printsec=frontcover&dq=name:The+Truth+About+Forever&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=k15qaAaw1tAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "On the outside, Macy Queen is cool and calm. On the inside, she's breaking. Silently struggling with her Dad's death, and spending the summer apart from her oh-so-perfect boyfriend, Macy is smiling her way through - she's 'fine'. It's only when she meets a group of new friends - and artistic, sexy Wes catches her eye - she realizes she can wear her heart on her sleeve sometimes. Because life doesn't stop when someone disappears - and even though she's lost so much, can Macy see what she has to gain? Hugely engaging and with great emotional depth, Sarah Dessen's rich, warm, atmospheric writing makes this the perfect summer read for teenage girls.", "webReaderLink": "http://play.google.com/books/reader?id=k15qaAaw1tAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Summer Garden", "categories": ["Fiction"], "authors": ["James Milne"], "printType": "BOOK", "pageCount": 274, "ratingsCount": null, "averageRating": null, "publisher": "James Milne", "publishedDate": "2019-11-23", "previewLink": "http://books.google.co.in/books?id=HFi_DwAAQBAJ&printsec=frontcover&dq=name:The+Bronze+Horseman&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=HFi_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Trei died. He got roasted by a mage, for trying to be a hero. Things aren't so bad. At least he didn't stay dead. Summer's life was always difficult. Her world was on the verge of war, a politician threatening to take her crown. Resurrecting Trei was an accident, but it might be the last she'll be allowed to make.", "webReaderLink": "http://play.google.com/books/reader?id=HFi_DwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Reason to Breathe", "categories": ["Fiction"], "authors": ["Lorhainne Eckhart"], "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": "Lorhainne Eckhart", "publishedDate": "2019-02-28", "previewLink": "http://books.google.co.in/books?id=Ee9aDwAAQBAJ&pg=PT33&dq=name:Reason+to+Breathe&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Ee9aDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Everyone knows the first time you meet that special someone: Your eyes connect from across the room, and you smile and work up the courage to say hello. It’s a simple feat for most people, but not for Trevor Friessen, who struggles to fit into this world and thinks he always will—that is, until he meets a girl who is as different from him as she is the same. “Our families and everyone around us, what they don’t understand is that we too feel love.” Did you miss the other books in this big family romance series? Start with the worldwide bestseller THE FORGOTTEN CHILD translated in German & French, coming soon to Portuguese, Spanish & Chinese. Reading order: THE OUTSIDER SERIES (The Friessen Legacy) The Forgotten Child A Baby And a Wedding (Short Story FREE) Fallen Hero The Search (Short Story FREE) The Awakening Secrets Runaway Overdue (Short Story FREE) The Unexpected Storm The Wedding The Friessens: A New Beginning The Deadline (Andy and Laura) The Price to Love (Neil and Candy) A Different Kind of Love (Brad and Emily) A Vow of Love, A Friessen Family Christmas The Friessens The Reunion The Bloodline (Andy & Laura) The Promise (Diana & Jed) The Business Plan (Neil & Candy) The Decision (Brad & Emily) First Love (Katy) Family First Leave the Light On In the Moment In the Family: A Friessen Family Christmas In the Silence In the Stars In the Charm Unexpected Consequences It Was Always You The First Time I Saw You Welcome to My Arms A Reason to Breathe I’ll Always Love You You Are My Everything p.p1 {margin: 12.0px 0.0px 0.0px 0.0px; font: 12.0px 'Times New Roman'; color: #000000} p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px 'Times New Roman'; color: #000000; min-height: 15.0px} p.p3 {margin: 0.0px 0.0px 12.0px 0.0px; font: 12.0px 'Times New Roman'; color: #000000}", "webReaderLink": "http://play.google.com/books/reader?id=Ee9aDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Elephants Swim", "categories": ["Juvenile Nonfiction"], "authors": ["Linda Capus Riley"], "printType": "BOOK", "pageCount": 40, "ratingsCount": 2, "averageRating": 3.5, "publisher": "Houghton Mifflin Harcourt", "publishedDate": "2015-04-21", "previewLink": "http://books.google.co.in/books?id=ggroBwAAQBAJ&printsec=frontcover&dq=name:Water+for+Elephants&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ggroBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Elephants swim gracefully underwater and use their trunks like snorkels. Hippos sink to the bottom and go to sleep. Walruses sing as they swim along, and so do whales. Linda Capus Riley has written a lovely - and informative - poem about the ways that sixteen animals behave in water and added notes for those readers who would like to know more about the animals. Steve Jenkins's beautiful and playful cut-paper illustrations capture the diversity of the swimmers.", "webReaderLink": "http://play.google.com/books/reader?id=ggroBwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Kiss An Angel", "categories": ["Fiction"], "authors": ["Susan Elizabeth Phillips"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 7, "averageRating": 4.5, "publisher": "Hachette UK", "publishedDate": "2013-08-01", "previewLink": "http://books.google.co.in/books?id=d0Mvxr8fY4UC&pg=PT24&dq=name:Kiss+an+Angel&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=d0Mvxr8fY4UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "How did pretty socialite Daisy Devereaux find herself in this fix? She can either go to jail or marry the mystery man her father has chosen for her. Alex Markov, however, has no intention of playing the loving bridegroom to a spoiled little heiress. As humourless as he is deadly handsome, he drags the irrepressible Daisy away from her uptown life and sets out to bring her down a peg or two. Except it won't be as easy as he thinks. This man without a soul has met a woman who's nothing but heart. Will vows spoken in haste shatter or offer the promise of love everlasting?", "webReaderLink": "http://play.google.com/books/reader?id=d0Mvxr8fY4UC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Gossip Girl: It Had To Be You", "categories": ["Fiction"], "authors": ["Cecily Von Ziegesar"], "printType": "BOOK", "pageCount": 347, "ratingsCount": 8, "averageRating": 3, "publisher": "Hachette UK", "publishedDate": "2012-06-21", "previewLink": "http://books.google.co.in/books?id=J4MPRHLzNu0C&pg=PT83&dq=name:It+Had+to+Be+You&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=J4MPRHLzNu0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'Welcome to New York City's Upper East Side, where my friends and I all live in huge, fabulous apartments and go to exclusive single-sex private schools. We aren't always the nicest people in the world, but we make up for it in looks and taste.' Enter the world of Gossip Girl and the exclusive Manhattan private school Constance Billard, inhabited by the city's most fabulous crowd; a world of jealousy, betrayal and outrageous behaviour! There's a lot more to this story than anyone realises and you might find out just how the legendary GOSSIP GIRL column began...", "webReaderLink": "http://play.google.com/books/reader?id=J4MPRHLzNu0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Flat-Out Love", "categories": ["Juvenile Fiction"], "authors": ["Jessica Park"], "printType": "BOOK", "pageCount": 345, "ratingsCount": 1, "averageRating": 5, "publisher": "Amazon Childrens Publishing", "publishedDate": "2012-09-11", "previewLink": "http://books.google.co.in/books?id=iGHrMQEACAAJ&dq=name:Flat-Out+Love&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=iGHrMQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "But really, how was this freshly-minted Boston transplant and newbie college freshman supposed to know that she would end up living with the family of an old friend of her mother's? This was all supposed to be temporary. Julie wasn't supposed to be important to the Watkins family, or to fall in love with one of the brothers. Especially the one she's never quite met. But what does that really matter? Finn gets her, like no one ever has before. They have connection.But here's the thing about love, in all its twisty, bumpy permutations—it always throws you a few curves. And no one ever escapes unscathed.New York Times best-selling author Jessica Park mines the territory of love's growing pains with wit, sharp insights, and a discernible heat and heartbeat. Her previous novels include Relatively Famous, and she authored the e-shorts What the Kid Says (Parts 1 and 2) and Facebooking Rick Springfield.Visit her on the web at www.jessicapark.me The author of Flat-Out Love has donated this book to the Worldreader program", "webReaderLink": "http://play.google.com/books/reader?id=iGHrMQEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Edge of Never", "categories": ["Fiction"], "authors": ["J.A Redmerski"], "printType": "BOOK", "pageCount": 496, "ratingsCount": 62, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2013-03-12", "previewLink": "http://books.google.co.in/books?id=_Uk2AQAAQBAJ&dq=name:The+Edge+of+Never&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_Uk2AQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Discover the beloved New York Times bestseller about two lost souls who embark on an epic road trip and find love along the way. A New York Times, USA Today, and Wall Street Journal bestselling blockbuster! Twenty-year-old Camryn Bennett thought she knew exactly where her life was going. But after a wild night at the hottest club in downtown Raleigh, North Carolina, she shocks everyone-including herself-when she decides to leave the only life she's ever known and set out on her own. Grabbing her purse and her cell phone, Camryn boards a Greyhound bus ready to find herself. Instead, she finds Andrew Parrish. Sexy and exciting, Andrew lives life like there is no tomorrow. He persuades Camryn to do things she never thought she would and shows her how to give in to her deepest, most forbidden desires. Soon he becomes the center of her daring new life, pulling love and lust and emotion out of her in ways she never imagined possible. But there is more to Andrew than Camryn realizes. Will his secret push them inseparably together -- or destroy them forever?", "webReaderLink": "http://play.google.com/books/reader?id=_Uk2AQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "What's in a Name?", "categories": ["Family & Relationships"], "authors": ["Susan Osborn", "Philip Lief Group"], "printType": "BOOK", "pageCount": 703, "ratingsCount": null, "averageRating": null, "publisher": "Simon and Schuster", "publishedDate": "1999-11-01", "previewLink": "http://books.google.co.in/books?id=Fb7SemM58ygC&pg=PA247&dq=name:Emma&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Fb7SemM58ygC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This exhaustively researched reference book explores the origins and meanings of the most common names in the language, bringing together fascinating information on the numerology, astrology, gem stones, and herb science surrounding our names. Original.", "webReaderLink": "http://play.google.com/books/reader?id=Fb7SemM58ygC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Leaving Paradise", "categories": ["Juvenile Fiction"], "authors": ["Simone Elkeles"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 43, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2013-03-28", "previewLink": "http://books.google.co.in/books?id=NyIcKeUqMr8C&pg=PT148&dq=name:Leaving+Paradise&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=NyIcKeUqMr8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Nothing has been the same since Caleb Becker left a party drunk, got behind the wheel and hit Maggie Armstrong. Even after months of painful physical therapy, Maggie walks with a limp. Her social life is nil and a scholarship to study abroad - her chance to escape everyone and their pitying stares - has been cancelled. After a year in juvenile jail, Caleb's free ...if freedom means endless nagging from a transition coach and the prying eyes of the entire town. Coming home should feel good, but his family and ex-girlfriend seem like strangers. But despite the horror of their shared history, somehow Caleb and Maggie can't seem to stay away from each other, with the heat and attraction between them becoming undeniable to them both. Feeling like outsiders, they find comfort in each other, they realise that sometimes the person who hurts you most, can be the person who heals you too.", "webReaderLink": "http://play.google.com/books/reader?id=NyIcKeUqMr8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Aviation security significant management challenges may adversely affect implementation of the Transportation Security Adminstration's Secure Flight Program : testimony before the Committee on Commerce, Science, and Transportation, U.S. Senate /", "categories": null, "authors": null, "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": "DIANE Publishing", "publishedDate": null, "previewLink": "http://books.google.co.in/books?id=MYbr8bAp5rgC&pg=PA34&dq=name:Matched&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=MYbr8bAp5rgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=MYbr8bAp5rgC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "This Lullaby", "categories": ["Juvenile Fiction"], "authors": ["Sarah Dessen"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 97, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2011-08-04", "previewLink": "http://books.google.co.in/books?id=u5za98DheW8C&printsec=frontcover&dq=name:This+Lullaby&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=u5za98DheW8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Remy is a cynic when it comes to love. Let down by her absent musician dad and witness to her mother's four failed marriages, she doesn't intend ever to let anyone that close. So when Dexter comes crashing into her life, why is it suddenly so hard for Remy to follow her own rules? He's everything she hates: messy, disorganised, impulsive, and worst of all, a musician like her absent father...", "webReaderLink": "http://play.google.com/books/reader?id=u5za98DheW8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Clockwork Angel", "categories": ["Juvenile Fiction"], "authors": ["Cassandra Clare"], "printType": "BOOK", "pageCount": 479, "ratingsCount": 2541, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2011-10-04", "previewLink": "http://books.google.co.in/books?id=FxPKAwAAQBAJ&pg=PA37&dq=name:Clockwork+Angel&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=FxPKAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Tessa Fell's search for her missing brother leads her into Victorian London's supernatural underworld, where she must learn to trust the demon-killing Shadowhunters if she wants to learn to control her powers and find her brother.", "webReaderLink": "http://play.google.com/books/reader?id=FxPKAwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Vincent Brothers", "categories": ["Juvenile Fiction"], "authors": ["Abbi Glines"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 12, "averageRating": 3.5, "publisher": "Simon and Schuster", "publishedDate": "2012-12-18", "previewLink": "http://books.google.co.in/books?id=Dqh_fPHKifwC&printsec=frontcover&dq=name:The+Vincent+Boys&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Dqh_fPHKifwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "After her cousin Ashton breaks up with her popular boyfriend, Sawyer Vincent, Lana tries to win over his heart, but Sawyer may only be interested in her to make Ashton jealous.", "webReaderLink": "http://play.google.com/books/reader?id=Dqh_fPHKifwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Kingdom of Dreams", "categories": ["Fiction"], "authors": ["Judith McNaught"], "printType": "BOOK", "pageCount": 440, "ratingsCount": 27, "averageRating": 4.5, "publisher": "Simon and Schuster", "publishedDate": "1991-05-31", "previewLink": "http://books.google.co.in/books?id=h8vOftVK-gcC&printsec=frontcover&dq=name:A+Kingdom+of+Dreams&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=h8vOftVK-gcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Jennifer Merrick, a headstrong Scottish woman, is abducted from her convent school by the English warrior Royce Westmoreland, but her disdain and impatience with her captor give way to her growing attraction", "webReaderLink": "http://play.google.com/books/reader?id=h8vOftVK-gcC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Just the Sexiest Man Alive", "categories": ["Fiction"], "authors": ["Julie James"], "printType": "BOOK", "pageCount": 320, "ratingsCount": 25, "averageRating": 4, "publisher": "Penguin", "publishedDate": "2008-10-07", "previewLink": "http://books.google.co.in/books?id=3b9nX7Msk7EC&pg=PT151&dq=name:Just+the+Sexiest+Man+Alive&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=3b9nX7Msk7EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "New York Times bestselling author Julie James’s debut novel—a dazzling romance about one of Hollywood's biggest movie stars and the woman who refuses to let him capture her heart... Nothing fazes Taylor Donovan. In the courtroom, she never lets the opposition see her sweat. In her personal life, she never lets any man rattle her—not even her cheating ex-fiancé. So when she’s assigned to coach People’s “Sexiest Man Alive” for his next big legal drama, she refuses to fall for the Hollywood heartthrob’s charms. Jason Andrews is used to having women fall at his feet. When Taylor Donovan gives him the cold shoulder, he’s thrown for a loop. She’s unlike any other woman he’s ever met: uninterested in the limelight, seemingly immune to his advances, and shockingly capable of saying no to him. She’s the perfect challenge. And the more she rejects him, the more he begins to realize she may just be his perfect match...", "webReaderLink": "http://play.google.com/books/reader?id=3b9nX7Msk7EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Developing Writing Teachers", "categories": ["Language Arts & Disciplines"], "authors": ["Terry Locke"], "printType": "BOOK", "pageCount": 234, "ratingsCount": 1, "averageRating": 4, "publisher": "Routledge", "publishedDate": "2014-08-07", "previewLink": "http://books.google.co.in/books?id=1Xc9BAAAQBAJ&pg=PT63&dq=name:Something+About+You&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=1Xc9BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The premise of Developing Writing Teachers is this: When teachers of writing identify as writers, it adds a special dimension to their writing pedagogy. Practical and accessible while drawing on a range of relevant research and theory, this text is distinguished by its dual focus—on teachers as writers and the teaching of writing. Part I addresses the question, What does it take for a teacher of writing to develop an identity as writer? Using case studies and teacher narratives, it guides readers to an understanding of the current status of writing as the 21st century unfolds, the role of expressive writing in developing a writing identity, the relationship of writing to genre and rhetoric, writing and professional identity, and writing as design. Part II focuses on pedagogical practice and helping writer-teachers develop a toolkit to take into their classrooms. Coverage includes building a community of writing practice; the nature of writing as process; the place of grammar; the role of information, communication and representational technologies; and how assessment, properly used, can help develop writing. Ideal for for pre-service and in-service courses on the teaching of writing, the Companion Website provides aadditional readings/documents; PowerPoint presentations; assessment resources; and lesson and unit plans and planning guides.", "webReaderLink": "http://play.google.com/books/reader?id=1Xc9BAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The DUFF", "categories": ["Juvenile Fiction"], "authors": ["Kody Keplinger"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 88, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2012-04-05", "previewLink": "http://books.google.co.in/books?id=bi-DGA_cBaAC&printsec=frontcover&dq=name:The+DUFF:+Designated+Ugly+Fat+Friend&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=bi-DGA_cBaAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Seventeen-year-old Bianca Piper may not be the prettiest girl in her high school, but she has a loyal group of friends, biting wit, and a spot-on BS detector. She's also way too smart to fall for the charms of a man-slut and slimy school hottie Wesley Rush, who calls Bianca the Duff - the designated ugly fat friend - of her crew. But things aren't so great at home and Bianca, desperate for a distraction, ends up kissing Wesley. Worse, she likes it. Eager for escape, Bianca throws herself into a secret enemies-with-benefits relationship with him. Until it all goes horribly wrong. It turns out Wesley isn't such a bad listener, and his life is pretty screwed up, too. Suddenly Bianca realizes with absolute horror that she's falling for the guy she thought she hated more than anyone. With a wry and tell-it-like-it-is voice, New York Times Bestselling novel The DUFF is a witty and poignant story of a teenager struggling with the rules of high school attraction, along with the breaking down of her relationships with family and friends. It is a novel about what it means to be sexy, in a world where we feel we have to be perfect! The DUFF movie starring Bella Thorne, Mae Whitman and Alison Janney will be released on DVD in Summer 2015.", "webReaderLink": "http://play.google.com/books/reader?id=bi-DGA_cBaAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Name Book", "categories": ["Family & Relationships"], "authors": ["Dorothy Astoria"], "printType": "BOOK", "pageCount": 315, "ratingsCount": 1, "averageRating": 3, "publisher": "Bethany House", "publishedDate": "2008-11-01", "previewLink": "http://books.google.co.in/books?id=Xm1zBQAAQBAJ&printsec=frontcover&dq=name:Significance&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Xm1zBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A comprehensive book of 12,000 names, including their meanings, origins, and spiritual significance, with a supporting Scripture for each.", "webReaderLink": "http://play.google.com/books/reader?id=Xm1zBQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "along for the ride", "categories": null, "authors": ["enodia williams"], "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": "Lulu.com", "publishedDate": null, "previewLink": "http://books.google.co.in/books?id=OuyJDwAAQBAJ&pg=PT22&dq=name:Along+for+the+Ride&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=OuyJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=OuyJDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Summer I Turned Pretty", "categories": ["Juvenile Fiction"], "authors": ["Jenny Han"], "printType": "BOOK", "pageCount": 276, "ratingsCount": 74, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2010-04-06", "previewLink": "http://books.google.co.in/books?id=7JKbDgAAQBAJ&printsec=frontcover&dq=name:The+Summer+I+Turned+Pretty&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=7JKbDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Belly spends the summer she turns sixteen at the beach just like every other summer of her life, but this time things are very different.", "webReaderLink": "http://play.google.com/books/reader?id=7JKbDgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Meg & the Mystery Man", "categories": ["Fiction"], "authors": ["Elise Title"], "printType": "BOOK", "pageCount": 299, "ratingsCount": null, "averageRating": null, "publisher": "Harlequin", "publishedDate": "2012-07-16", "previewLink": "http://books.google.co.in/books?id=eAc2zrp4v_0C&pg=PT86&dq=name:Mystery+Man&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=eAc2zrp4v_0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Where Are They Now? For Meg Delgado, it's an exciting career as a private investigator specializing in cruise-ship crime. Her latest assignment is to catch a thief—by playing the role of a wealthy socialite aboard the glamorous luxury liner Galileo. She's already got a suspect in mind: a debonair Cary Grant type named Noah Danforth. But if Meg's not who she seems to be, neither is Noah! And they'll both discover that deceptions and disguises lead to danger…and to romance.", "webReaderLink": "http://play.google.com/books/reader?id=eAc2zrp4v_0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Romeo and Juliet", "categories": null, "authors": ["William Shakespeare"], "printType": "BOOK", "pageCount": 81, "ratingsCount": 3, "averageRating": 5, "publisher": null, "publishedDate": "1874", "previewLink": "http://books.google.co.in/books?id=_loJAAAAQAAJ&printsec=frontcover&dq=name:Romeo+and+Juliet&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_loJAAAAQAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=_loJAAAAQAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Endtime Messages for the Bride of Christ", "categories": ["Religion"], "authors": ["Deva Evu Lawrie"], "printType": "BOOK", "pageCount": 480, "ratingsCount": 1, "averageRating": 5, "publisher": "Partridge Publishing", "publishedDate": "2017-06-06", "previewLink": "http://books.google.co.in/books?id=VHIpDwAAQBAJ&pg=PT375&dq=name:The+Bride&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=VHIpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The Christian world is awaiting the Second Coming of Christ to take the Bride of Chist with him in glory, which we call Rapture. There are many explanations from various quarters. The First Coming of Christ is past. The Third Coming will take place when Christ, the son of David comes down on the Mount of Olives to rule the earth for a millennium. The Second Coming is on. The author Bro. Deva Evu Lawrie had had an experience of peace with God early in life at the age of eight. He had been a keen observer in the ministry of his father. He was a student of the famous Madras Christian College, Tambaram, Chennai. He became a full-time minister of religion when he was eighteen. He had been working with his dad since then. There was a great turning point when his dad, Bro. Paulaseer Lawrie, was preaching at Chicago, USA. He had a great experience of God coming down into him when man first landed on the moon on July 20, 1969. The sky opened, and he could see and feel a great and terrific power enter into his life (Luke 3: 2122). In these pages, Bro. Deva Evu Lawrie, the author, shows that most of the prophecies and things concerning the Second Coming have been fulfilled in the ministry of Bro. Paulaseer Lawrie of India. He cites mostly from the Holy Scriptures. He wants the readers to go through the book carefully so that they do not miss the glory that God had foreordained for us in this generation. Address: Lawrie Ministries 70 Main Street Gandhinagar827008 Tirunelveli City Tamil Nadu, India Phone: +91-462-2330770", "webReaderLink": "http://play.google.com/books/reader?id=VHIpDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Breathe My Name", "categories": ["Young Adult Fiction"], "authors": ["R.A. Nelson"], "printType": "BOOK", "pageCount": 320, "ratingsCount": 5, "averageRating": 4.5, "publisher": "Penguin", "publishedDate": "2007-11-08", "previewLink": "http://books.google.co.in/books?id=r3tDxVHv8JMC&pg=PT121&dq=name:Breathe&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=r3tDxVHv8JMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Frances can forgive. She can even forget. But she can never escape her past. . . . In this compelling psychological thriller from the acclaimed author of Teach Me, Frances Robinson has the perfect life: loving adoptive parents, a great best friend, and a cute new boyfriend. But Frances has a secret. Once upon a time she wasn’t Frances Robinson. She was Shine, and she lived with her three sisters and her birth mother, Afton Jelks, far out in the country. But the loneliness overtook Afton’s fragile mind, and one day she smothered her daughters, one after another. Only Frances escaped. Now Afton is out of prison. And she wants to finish what she started. . . .", "webReaderLink": "http://play.google.com/books/reader?id=r3tDxVHv8JMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Call Me Irresistible", "categories": ["Fiction"], "authors": ["Susan Elizabeth Phillips"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 4, "averageRating": 4, "publisher": "Harper Collins", "publishedDate": "2011-01-18", "previewLink": "http://books.google.co.in/books?id=WDvIpH2lB0QC&printsec=frontcover&dq=name:Call+Me+Irresistible&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=WDvIpH2lB0QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The funniest love story of the year, Call Me Irresistible is the book Susan Elizabeth Phillips fans have been craving. The beloved New York Times bestselling author returns with a delightfully sassy, sexy, and downright irresistible tale of true love Texas style. Ted Beaudine, one of Phillips’s most charming characters (the adolescent heartbreaker from her hilarious debut, Fancy Pants, and the new college graduate from Lady Be Good) is now all grown up and in a heap of romantic trouble all his own—in a perfectly marvelous contemporary romance that fans of Emily Giffin, Kristen Hannah, and Elin Hilderbrand will simply adore.", "webReaderLink": "http://play.google.com/books/reader?id=WDvIpH2lB0QC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Bet Me", "categories": ["Fiction"], "authors": ["Jennifer Crusie"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 86, "averageRating": 4, "publisher": "St. Martin's Press", "publishedDate": "2007-04-01", "previewLink": "http://books.google.co.in/books?id=_GGSLrAQYIsC&pg=PA122&dq=name:Bet+Me&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_GGSLrAQYIsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The beloved New York Times bestselling novel, now with an exclusive letter from Jennifer Crusie in celebration of its tenth anniversary This is New York Times and USA Today bestselling author Jennifer Crusie's novel about long shots, risk management, true love, and great shoes. . . . Minerva Dobbs knows how to work the odds. Calvin Morrisey always plays to win. But when they face off, neither one is prepared. Because when real life meets true love, all bets are off. . . . Minerva Dobbs knows that happily-ever-after is a fairy tale, especially with a man who asked her to dinner to win a bet, even if he is gorgeous and successful Calvin Morrisey. Cal knows commitment is impossible, especially with a woman as cranky as Min Dobbs, even if she does wear great shoes and keep him on his toes. When they say good-bye at the end of their evening, they cut their losses and agree never to see each other again. But fate has other plans, and it's not long before Min and Cal meet again. Soon they're dealing with a jealous ex-boyfriend, Krispy Kreme doughnuts, a determined psychologist, chaos theory, a freakishly intelligent cat, Chicken Marsala, and more risky propositions than either of them ever dreamed of. Including the biggest gamble of all---true love. Bet Me is the winner of a 2005 RITA Award.", "webReaderLink": "http://play.google.com/books/reader?id=_GGSLrAQYIsC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Forbidden Vampire: The Inception, Book I", "categories": null, "authors": null, "printType": "BOOK", "pageCount": null, "ratingsCount": 1, "averageRating": 3, "publisher": "Dorrance Publishing", "publishedDate": null, "previewLink": "http://books.google.co.in/books?id=gSq5YC6PLIMC&pg=PA161&dq=name:Forbidden&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=gSq5YC6PLIMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=gSq5YC6PLIMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Cambridge Diaries", "categories": ["Fiction"], "authors": ["C. N. Barton"], "printType": "BOOK", "pageCount": 426, "ratingsCount": null, "averageRating": null, "publisher": "Janus Publishing Company Lim", "publishedDate": "2007-01", "previewLink": "http://books.google.co.in/books?id=C3HftvHYG0AC&pg=PA5&dq=name:Going+Too+Far&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=C3HftvHYG0AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "As soon as Joshua Bailey arrives at Cambridge University he feels like a fish out of water, but his economics classes and extra-curricular activities leave him little time to debate whether or not he actually belongs in this world of southern affluence and centuries-old academic tradition. Soon Josh is fully engaged in the highs and lows of college life, from friendships that wax and wane and would-be romances to wild parties and subsequent hangovers. Carefully capturing the passion and intensity of university life, this coming-of-age tale confronts the challenges of entering adulthood and reveals the lasting impact of relationships forged during the unforgettable college years.", "webReaderLink": "http://play.google.com/books/reader?id=C3HftvHYG0AC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Gamble", "categories": ["Fiction"], "authors": ["Laura Parker"], "printType": "BOOK", "pageCount": 322, "ratingsCount": null, "averageRating": null, "publisher": "Diversion Books", "publishedDate": "2013-11-26", "previewLink": "http://books.google.co.in/books?id=hiYtAgAAQBAJ&pg=PT230&dq=name:The+Gamble&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=hiYtAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "She’s ready to risk everything for a man with nothing left to lose — except his heart. \"You won't be taking a gamble when you pick up Laura Parker's latest titillating romance...a sure bet to satisfy readers.\" — RT Book Reviews Jack Laughton was a viscount who one night traded his life of leisure in order to masquerade as a notorious highwayman: “Black Jack” Law. Nothing could touch this conniving rogue’s soul...until his eye fell upon the beauty whose stagecoach he attempted to rob. Now he is willing to do anything to make this alluring woman his — even abandon his wicked ways. Sabrina Lindsay has a knack for defying social conventions. Her endless escapades in London society have enraged her guardian who wants nothing more than to marry her off to a prominent nobleman. But it will take much more than threats to bend Sabrina’s stubborn will. Sabrina vows to do whatever it takes to save her brother Kit, imprisoned by their guardian to insure her obedience...even if that means making a pact with the devil himself, “Black Jack” Law. It’s a gamble when the dazzling and daring Sabrina and the handsome rogue Jack join together, but the true risk comes when it’s her heart he’s trying to steal.", "webReaderLink": "http://play.google.com/books/reader?id=hiYtAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Shatter Me", "categories": ["Young Adult Fiction"], "authors": ["Tahereh Mafi"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 2177, "averageRating": 3.5, "publisher": "Egmont UK", "publishedDate": "2018-03-06", "previewLink": "http://books.google.co.in/books?id=cZI9DwAAQBAJ&printsec=frontcover&dq=name:Shatter+Me&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=cZI9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "X-Men meets The Handmaid's Tale in this first instalment in an epic and romantic YA fantasy trilogy perfect for fans of Sarah J. Maas, Victoria Aveyard's The Red Queen, Netflix's Stranger Things and Leigh Bardugo's Six of Crows. A fragile young teenage girl is held captive. Locked in a cell by The Reestablishment – a harsh dictatorship in charge of a crumbling world. This is no ordinary teenager. Juliette is a threat to The Reestablishment's power. A touch from her can kill – one touch is all it takes. But not only is she a threat, she is potentially the most powerful weapon they could have. Juliette has never fought for herself before but when she’s reunited with the one person who ever cared about her, the depth of the emotion and the power within her become explosive . . . \"Addictive, intense, and oozing with romance. I’m envious. I couldn’t put it down.” - Lauren Kate, New York Times bestselling author of Fallen 'Dangerous, sexy, romantic and intense. I dare you to stop reading!' - Kami Garcia, bestselling author of the Beautiful Creatures series Tahereh Mafi is the New York Times bestselling author of the Shatter Me series which has been published in over 30 languages around the world. She was born in a small city somewhere in Connecticut and currently resides in Santa Monica, California, with her husband, Ransom Riggs, fellow bestselling author of Miss Peregrine's Home For Peculiar Children, and their young daughter. She can usually be found overcaffeinated and stuck in a book. Follow her on Instagram and Twitter @TaherehMafi", "webReaderLink": "http://play.google.com/books/reader?id=cZI9DwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Sweet Gum Tree", "categories": null, "authors": ["Katherine Allred"], "printType": "BOOK", "pageCount": 316, "ratingsCount": 8, "averageRating": 5, "publisher": null, "publishedDate": "2017-07-03", "previewLink": "http://books.google.co.in/books?id=4rgntAEACAAJ&dq=name:The+Sweet+Gum+Tree&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=4rgntAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Sweet tea, corn bread and soup beans; everyday fare for eight-year-old Alix French, the precocious darling of a respected southern family. But nothing was ordinary about the day she met ten-year-old Nick Anderson, a boy from the wrong side of town. Armed with only a tin of bee balm and steely determination, Alix treats the raw evidence of a recent beating that mars his back, an act that changes both their lives forever. Through childhood disasters and teenage woes they cling together as friendship turns to love. The future looks rosy until the fateful night when Frank Anderson, Nick's abusive father, is shot to death in his filthy trailer.Suddenly, Nick is gone, leaving Alix alone, confused and pregnant. For the next fifteen years she wrestles with the pain of Nick's abandonment, a bad marriage, her family and friends. But finally, she's starting to get her life back together. Her divorce is almost final, her business is booming, and she's content if not happy-until the day she looks up and sees Nick standing across the counter. He's back, and he's not alone. Once again Alix is plunged into turmoil and pain as Nick tries to win her love, something she resists with all her strength. Only one thing might break the protective wall she's built around her emotions-the truth about Frank Anderson's death. But when that truth comes out and those walls crumble, neither Alix nor Nick is prepared for the emotional explosion that could destroy as well as heal.", "webReaderLink": "http://play.google.com/books/reader?id=4rgntAEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Can You Keep a Secret?", "categories": ["Biography & Autobiography"], "authors": ["Millisa C. Thomas"], "printType": "BOOK", "pageCount": 116, "ratingsCount": null, "averageRating": null, "publisher": "Xlibris Corporation", "publishedDate": "2009-11-03", "previewLink": "http://books.google.co.in/books?id=bVgF4E-gXfUC&pg=PA22&dq=name:Can+You+Keep+a+Secret%3F&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=bVgF4E-gXfUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Millisa C. Thomas is a multifaceted woman. To her friends, she is passionate about life, courageous, giving, pure, and full of infectious strength and resolve. To her children, she is simply the world. To her coworkers and employers, she has proven herself time and time again to be resourceful, reliable, intelligent, and invaluable, and to her family of origin, she is a crazy and insignificant whistle-blower who threatens to expose the venerated family secrets. Ms. Thomas was born in Wilmington, Delaware, and now resides in Southern California with her three remarkable children and her faithful Shepherd—Collie mix, Angel. One of her greatest accomplishments includes the birth of her three precious children. Other accomplishments include a successful twenty-two-year long career in the medical field, completing a college degree, surviving, healing, and now . . . telling the story. She still does not like Valentine’s Day; tulips are still her favorite flower, and Christmas is still her favorite holiday.", "webReaderLink": "http://play.google.com/books/reader?id=bVgF4E-gXfUC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Naked in Death", "categories": null, "authors": ["J. D. Robb"], "printType": "BOOK", "pageCount": null, "ratingsCount": 117, "averageRating": 3.5, "publisher": null, "publishedDate": "2014-12", "previewLink": "http://books.google.co.in/books?id=MQHgrQEACAAJ&dq=name:Naked+in+Death&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=MQHgrQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=MQHgrQEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Bars Stories", "categories": ["Cooking"], "authors": ["Alfonso Colmenares"], "printType": "BOOK", "pageCount": 1000, "ratingsCount": null, "averageRating": null, "publisher": "Babelcube Inc.", "publishedDate": "2017-02-01", "previewLink": "http://books.google.co.in/books?id=50nnDQAAQBAJ&pg=PT67&dq=name:Wallbanger&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=50nnDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "That is a Barman if he can not tell good stories?, if it is important to prepare good drinks, it is also know good stories to share with their customers, and even more so if they are related to the drinks prepared. This little book tells the story of the creation of the main cocktails, Histories product research every moment that accompanied the creation of the most famous drinks, many are stories passed down from generation to generation, other product of journalistic reviews, I can assure you it is that these stories liven up conversations with customers. The history of cocktails mostly covered with the veil of mystery, many are cocktails whose authorship is the fight several authors, this makes it very difficult to locate authentic sites and dates of birth of many of these drinks. However, we will tell you more attached to reality, there will be many drinks with more than one story, no matter what you create or that you like more, it is important to know the origin of each, and you can share with your clients or friends. This work is organized, starting with the most popular, will provide the story of its creation, the original recipe, its variants, and some other curious fact that complements the pleasant know each drink. This work should be part of the library of every Barman, both professionals and students, or amateur, who are entering the great world of mixology.", "webReaderLink": "http://play.google.com/books/reader?id=50nnDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Catching Jordan", "categories": ["Juvenile Fiction"], "authors": ["Miranda Kenneally"], "printType": "BOOK", "pageCount": 288, "ratingsCount": 2907, "averageRating": 3.5, "publisher": "Sourcebooks, Inc.", "publishedDate": "2011-12-01", "previewLink": "http://books.google.co.in/books?id=a4eF5eAbtGkC&printsec=frontcover&dq=name:Catching+Jordan&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=a4eF5eAbtGkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=a4eF5eAbtGkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Lover Eternal", "categories": ["Fiction"], "authors": ["J.R. Ward"], "printType": "BOOK", "pageCount": 464, "ratingsCount": 119, "averageRating": 4, "publisher": "Penguin", "publishedDate": "2006-03-07", "previewLink": "http://books.google.co.in/books?id=Cjfq3Sq4C5EC&printsec=frontcover&dq=name:Lover+Eternal&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Cjfq3Sq4C5EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A warrior with inner demons falls for a woman who could save his soul in the second novel in the #1 New York Times bestselling Black Dagger Brotherhood series. Within the Black Dagger Brotherhood, Rhage is the warrior vampire with the strongest appetites. He's the deadliest fighter, the most voracious lover, the quickest to act on his impulses. He’s also been cursed with two hundred years of hell. Possessed by a beast, he lives in fear of the times when his inner dragon comes out and he's a danger to everyone around him. Mary Luce has unwittingly found herself in the vampire world, and under Rhage's protection. With her own life-threatening curse to bear, she’s not looking for love. Besides, she's stopped believing in saving grace and miracles long ago. But when Rhage’s intense sexual attraction turns into emotional bonding, he knows he must have her for his mate. As their enemies close in, Mary finds herself praying for something she fears she’ll never have: life eternal with the one she loves.", "webReaderLink": "http://play.google.com/books/reader?id=Cjfq3Sq4C5EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Natural Born Charmer", "categories": ["Fiction"], "authors": ["Susan Elizabeth Phillips"], "printType": "BOOK", "pageCount": 400, "ratingsCount": 35, "averageRating": 4, "publisher": "Harper Collins", "publishedDate": "2009-10-13", "previewLink": "http://books.google.co.in/books?id=nZw9qarl3rsC&printsec=frontcover&dq=name:Natural+Born+Charmer&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=nZw9qarl3rsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Chicago Stars quarterback Dean Robillard is the luckiest man in the world: a bona-fide sports superstar and the pride of the NFL with a profitable side career as a buff billboard model for End Zone underwear. But life in the glory lane has started to pale, and Dean has set off on a cross-country trip to figure out what's gone wrong. When he hits a lonely stretch of Colorado highway, he spies something that will shake up his gilded life in ways he can't imagine. A young woman . . . dressed in a beaver suit. Blue Bailey is on a mission to murder her ex. Or at least inflict serious damage. As for the beaver suit she's wearing . . . Is it her fault that life keeps throwing her curveballs? Witness the expensive black sports car pulling up next to her on the highway and the Greek god stepping out of it. Blue's career as a portrait painter is the perfect job for someone who refuses to stay in one place for very long. She needs a ride, and America's most famous football player has an imposing set of wheels. Now, all she has to do is keep him entertained, off guard, and fully clothed before he figures out exactly how desperate she is. But Dean isn't the brainless jock she imagines, and Blue—despite her petite stature—is just about the toughest woman Dean has ever met. They're soon heading for his summer home where their already complicated lives and inconvenient attraction to each other will become entangled with a charismatic but aging rock star; a beautiful fifty-two-year-old woman trying to make peace with her rock and roll past; an eleven-year-old who desperately needs a family; and a bitter old woman who hates them all. As the summer progresses, the wandering portrait artist and the charming football star play a high-stakes game, fighting themselves and each other for a chance to have it all. Natural Born Charmer is for everyone who's ever thought about leaving their old life in the dust and never looking back. Susan Elizabeth Phillips takes us home again . . . and shows us where love truly lives.", "webReaderLink": "http://play.google.com/books/reader?id=nZw9qarl3rsC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Playing for Keeps", "categories": ["Fiction"], "authors": ["Yahrah St. John"], "printType": "BOOK", "pageCount": 256, "ratingsCount": null, "averageRating": null, "publisher": "Kimani Press", "publishedDate": "2008-02-01", "previewLink": "http://books.google.co.in/books?id=43T8wxmUgE8C&pg=PA104&dq=name:Playing+for+Keeps&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=43T8wxmUgE8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "More than meets the eye Driven and ambitious, commercial-art buyer Avery Roberts always trusts first impressions, whether it's art…or men. Sexy Quentin Davis might make her pulse race, but the smooth, laid-back charmer is not her type. Then a secret about her past comes to light, leaving her vulnerable, shattered—and turning to Quentin for strong shoulders and sympathy. One kiss, and fierce attraction takes over, leaving first impressions in a haze of sensual bliss. Quentin's focus was always on the next assignment, leaving no room for long-term relationships or commitment. Now sleek, sophisticated Avery has him looking beyond his camera and his career. But as love and aspirations collide, heartbreak seems inevitable, until Quentin realizes he can't picture a life—or a future—without Avery in it.", "webReaderLink": "http://play.google.com/books/reader?id=43T8wxmUgE8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Street", "categories": ["Religion"], "authors": ["Nelson Mwangi"], "printType": "BOOK", "pageCount": 588, "ratingsCount": null, "averageRating": null, "publisher": "WestBow Press", "publishedDate": "2016-04-04", "previewLink": "http://books.google.co.in/books?id=RFLyCwAAQBAJ&pg=PT208&dq=name:Sugar+Daddy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RFLyCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "You will never live a happy life leave alone achieve your dreams and reach your destiny if you fail to find your purpose in life. Every page of this book will help you to not only find your identity but also become conversant about the tenacity you have towards achieving your dream. This discovery will subject you to a splendid life of purpose and passion until you get to your destiny. This book is for teens and young adults who are looking forward to rise above their fears, depart from mediocrity afoot a complete transformation and efficacy of their lives by first realizing who they are and finding their Gods given purpose in life before they embark on a life journey with a sole purpose of becoming successful in all areas of their lives if they adhere to their purpose and live their passion. Parents: As you embark on a venture to gentrify your teens life, this book will enhance your parenting acumen and help you to undertake your parenting responsibility of inculcating your teens and young adults with the moral responsibilities that they need in order to always make positive decisions not worth regrets in their present and future lives. Since empowerment is a very vital act of mentorship that fosters self-identity and ameliorates an individuals quality of life, ignorance is bliss only when the knowledge of God is not involved. Its through our relationship with God that we come to find our purpose, gain confidence, become courageous and suppress our fears in life as we progress towards our destiny. As we seek to find our God mandated purpose in our lives, its very imperative to know that life comes in phases where victory of your present stage invigorates your progress in the next stage. Nevertheless, our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. Its our light, not our darkness that most frightens us. Most of the times we ask ourselves; who am I to be brilliant, gorgeous, talented and successful? Actually, who are you not to be? You are a child of God. Your constrained thinking does not serve or impact the world. Your life is not a mistake. Every human being has a purpose which should dictate him or her to live a purpose driven life. We were born to make manifest the glory of God that is within us. Its not just in some of us; its in everyone. As we let our own light shine, we unconsciously give others permission to follow suit. As we are emancipated from our own fear, our presence and perseverance automatically emancipates others.", "webReaderLink": "http://play.google.com/books/reader?id=RFLyCwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Being Sweet", "categories": ["Juvenile Fiction"], "authors": ["C. H. Nipper"], "printType": "BOOK", "pageCount": 408, "ratingsCount": null, "averageRating": null, "publisher": "iUniverse", "publishedDate": "2005-09", "previewLink": "http://books.google.co.in/books?id=V3UGVBXvrgYC&pg=PA9&dq=name:Ain%27t+She+Sweet%3F&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=V3UGVBXvrgYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In 1939, five-year-old Carl \"Sweet\" Donner believes the whole world loves him. He trusts all the grown-ups around him and never questions the wisdom of their teachings. But his halcyon days are numbered. Sweet's idyllic views are shattered by events wrought by World War II and the natural human frailty of those he loves. From each tragedy, setback, and failure, he recovers and learns a lesson-oft-times a logically warped one. Nearly killed during one of his escapades, he makes a remarkable recovery after a lengthy convalescence. He is convinced that he is invulnerable and blessed with luck as no other boy could be. By his eighth birthday, he is doubtful yet incorrigible, sure of nothing but his ability to outsmart those he feels will misrule his life or invade his rights. Sweet lands in a lot trouble but somehow always manages to prevail-well, almost always.", "webReaderLink": "http://play.google.com/books/reader?id=V3UGVBXvrgYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "This Heart of Mine", "categories": ["Young Adult Fiction"], "authors": ["C. C. Hunter"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 1, "averageRating": 3, "publisher": "Wednesday Books", "publishedDate": "2018-02-27", "previewLink": "http://books.google.co.in/books?id=hH4pDwAAQBAJ&printsec=frontcover&dq=name:This+Heart+of+Mine&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=hH4pDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A new heart saved her life—but will it help her find out what really happened to its donor? C. C. Hunter's This Heart of Mine is a haunting, poignant tale about living and dying, surviving grief, guilt, and heartache, while discovering love and hope in the midst of sadness. Seventeen-year-old Leah MacKenzie is heartless. An artificial heart in a backpack is keeping her alive. However, this route only offers her a few years. And with her rare blood type, a transplant isn’t likely. Living like you are dying isn’t all it’s cracked up to be. But when a heart becomes available, she’s given a second chance at life. Except Leah discovers who the donor was — a boy from her school — and they’re saying he killed himself. Plagued with dreams since the transplant, she realizes she may hold the clues to what really happened. Matt refuses to believe his twin killed himself. When Leah seeks him out, he learns they are both having similar dreams and he’s certain it means something. While unraveling the secrets of his brother’s final moments, Leah and Matt find each other, and a love they are terrified to lose. But life and even new hearts don’t come with guarantees. Who knew living, took more courage than dying?", "webReaderLink": "http://play.google.com/books/reader?id=hH4pDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Bridget Jones: Mad About the Boy", "categories": ["Fiction"], "authors": ["Helen Fielding"], "printType": "BOOK", "pageCount": 400, "ratingsCount": 39, "averageRating": 3, "publisher": "Random House", "publishedDate": "2013-10-10", "previewLink": "http://books.google.co.in/books?id=aKvgEo4hUFUC&printsec=frontcover&dq=name:Bridget+Jones%27s+Diary&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=aKvgEo4hUFUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "THE NUMBER ONE BESTSELLER Is it morally wrong to have a blow-dry when one of your children has head lice? Is technology now the fifth element? Or is that wood? Is sleeping with someone after 2 dates and 6 weeks of texting the same as getting married after 2 meetings and 6 months of letter writing in Jane Austen's day? Pondering these, and other modern dilemmas, Bridget Jones stumbles through the challenges of single-motherhood, tweeting, texting and redisovering her sexuality in what SOME people rudely and outdatedly call 'middle age'. The long-awaited return of a much-loved character, Bridget Jones: Mad About the Boy is timely, tender, touching, witty, wise and bloody hilarious.", "webReaderLink": "http://play.google.com/books/reader?id=aKvgEo4hUFUC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Meister Eckhart, Teacher and Preacher", "categories": ["Religion"], "authors": ["Meister Eckhart", "Bernard McGinn", "Frank Tobin", "Frank J. Tobin", "Kenneth J. Northcott"], "printType": "BOOK", "pageCount": 420, "ratingsCount": null, "averageRating": null, "publisher": "Paulist Press", "publishedDate": "1986", "previewLink": "http://books.google.co.in/books?id=ECmFcbE7EFAC&pg=PA95&dq=name:Existence&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ECmFcbE7EFAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "\"Bargains in books are rare today, but one would be hard put to find in American publishing anything superior to these in content and format.\" The Parish Visitor Meister Eckhart: Teacher and Preacher edited by Bernard McGinn with the collaboration of Frank Tobin and Elvira Borgstadt preface by Kenneth Northcott \"When this temple is thus free of all obstacles, namely, possessiveness and ignorance, then it sparkles so beautifully and shines so purely and bright above everything that God created and through everything that God created that no one can be compared to it in brightness but the uncreated God alone...If the soul of a man still living in time were standing on the same level as the highest angel, this person could reach immeasurable higher in his free capability above the angel in ever 'now', new beyond number, that is, and beyond manner and above the manner of the angels and any created intellect.\" Meister Eckhart (c.1260-1327) Here are the texts that illustrate the diversity of one of the most enigmatic and influential mystics of the Western Christian tradition. Eckhart the teacher is represented by the Commentary on Exodus and by selections from six other commentaries, including the Commentary on Wisdom 7:14, the Commentary on Ecclesiasticus 24:29, and the Commentary on John 14:8. Eckhart's ministry as a preacher was an equally important part of the man, and thus his sermons, from both the Latin and the Middle High German manuscripts, are included. What emerges is a comprehensive picture of the works of this great speculative theologian. Together with Meister Eckhart: The Essential Sermons, Commentaries and Treatises, this work form the most extensive corpus of Eckhart's writings in English.", "webReaderLink": "http://play.google.com/books/reader?id=ECmFcbE7EFAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Rock Chick Revolution", "categories": ["Fiction"], "authors": ["Kristen Ashley"], "printType": "BOOK", "pageCount": 344, "ratingsCount": null, "averageRating": null, "publisher": "Kristen Ashley", "publishedDate": "2013-08-13", "previewLink": "http://books.google.co.in/books?id=t3P1AwAAQBAJ&pg=PT7&dq=name:Rock+Chick&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=t3P1AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Ally Nightingale has secrets. Secrets she doesn’t even share with the Rock Chicks. But two men know what she’s up to. One has her back. The other has her heart, but he doesn't know it. As Ally rewinds the last year of her life, she knows two things. One, she’s never going to get what every Rock Chick should have—her own Hot Bunch guy. And two, she’s a Nightingale through and through. She just isn’t sure what to do about that. But as her secrets are revealed, the men in her life react. Darius Tucker, a lifelong friend, as usual takes her back. Ren Zano, the man she loves, isn’t quite so sure. The Rock Chicks, Hot Bunch and the entire gang at Fortnum’s weigh in, and a Rock Chick Revolution starts brewing. It’s up to Ally to control it and prove what she knows down to her bones. She’s a Rock Chick, she deserves her hot guy and she’s going to keep the one she wants… Because she’s a Nightingale.", "webReaderLink": "http://play.google.com/books/reader?id=t3P1AwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Thorn Birds", "categories": ["Fiction"], "authors": ["Colleen McCullough"], "printType": "BOOK", "pageCount": 688, "ratingsCount": 67, "averageRating": 4, "publisher": "Head of Zeus", "publishedDate": "2013-03-28", "previewLink": "http://books.google.co.in/books?id=1Uw-AAAAQBAJ&printsec=frontcover&dq=name:The+Thorn+Birds&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=1Uw-AAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In the rugged Australian Outback, three generations of Clearys live through joy and sadness, bitter defeat and magnificent triumph – driven by their dreams, sustained by remarkable strength of character... and torn by dark passions, violence and a scandalous family legacy of forbidden love. It is a poignant love story, a powerful epic of struggle and sacrifice, a celebration of individuality and spirit. Most of all, it is the story of the Clearys' only daughter, Meggie, who can never possess the man she so desperately adores – Ralph de Bricassart. Ralph will rise from parish priest to the inner circles of the Vatican... but his passion for Meggie will follow him all the days of his life.", "webReaderLink": "http://play.google.com/books/reader?id=1Uw-AAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Fallen Too Far", "categories": ["Fiction"], "authors": ["Abbi Glines"], "printType": "BOOK", "pageCount": 272, "ratingsCount": 26, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2014-01-20", "previewLink": "http://books.google.co.in/books?id=wGF8AgAAQBAJ&printsec=frontcover&dq=name:Fallen+Too+Far&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=wGF8AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The New York Times bestselling novel that launched the beloved world of Rosemary Beach and introduced the world to Rush and Blaire. The wealthy son of a rocker. A tough farm girl from Alabama. Two step-siblings from different worlds. One summer in Rosemary Beach. The last thing Blaire Wynn wants is to move in with her father’s new family in Rosemary Beach, Florida. She has no choice. Blaire’s mother has passed away after a long illness, leaving behind a mountain of medical debts and no way for Blaire to keep their small Alabama farmhouse. Driving into the wealthy resort town in a pickup truck with a pistol under her seat, Blaire knows she'll never fit in. She’s even more disappointed to discover that her father has left for Paris, leaving her with her new stepbrother, Rush Finlay. The cynical, condescending, and unapologetic son of an infamous rock star, Rush is as spoiled as he is gorgeous—and he immediately gets under Blaire’s skin. But as the summer goes by, Blaire begins to see a side of Rush she never expected, and the chemistry between them becomes impossible to ignore. Unknown to her, Rush has a secret that could destroy Blaire’s entire world. Will she find out what he’s hiding before she falls too far?", "webReaderLink": "http://play.google.com/books/reader?id=wGF8AgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "iOS 7 Programming Pushing the Limits", "categories": ["Technology & Engineering"], "authors": ["Rob Napier", "Mugunth Kumar"], "printType": "BOOK", "pageCount": 504, "ratingsCount": null, "averageRating": null, "publisher": "John Wiley & Sons", "publishedDate": "2014-01-28", "previewLink": "http://books.google.co.in/books?id=4ld5AgAAQBAJ&pg=PA395&dq=name:Pushing+the+Limits&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=4ld5AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Get ready to create killer apps for iPad and iPhone on the new iOS 7! With Apple's introduction of iOS 7, demand for developers who know the new iOS will be high. You need in-depth information about the new characteristics and capabilities of iOS 7, and that's what you'll find in this book. If you have experience with C or C++, this guide will show you how to create amazing apps for iPhone, iPad, and iPod touch. You'll also learn to maximize your programs for mobile devices using iPhone SDK 7.0. Advanced topics such as security services, running on multiple iPlatforms, and local networking with Core Bluetooth are also covered. Prepares experienced developers to create great apps for the newest version of Apple's iOS Thoroughly covers the serious capabilities of iOS 7; information you need in order to make your apps stand out Delves into advanced topics including how to control multitasking, security services, running apps on multiple iPlatforms and iDevices, enabling in-app purchases, advanced text layout, and building a core foundation Also covers REST, advanced GCD, internationalization and localization, and local networking with Core Bluetooth iOS 7 Programming: Pushing the Limits will help you develop applications that take full advantage of everything iOS 7 has to offer.", "webReaderLink": "http://play.google.com/books/reader?id=4ld5AgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Self Hypnosis for a Better Life", "categories": ["Self-Help"], "authors": ["William W. Hewitt"], "printType": "BOOK", "pageCount": 256, "ratingsCount": null, "averageRating": null, "publisher": "Llewellyn Worldwide", "publishedDate": "2012-11-08", "previewLink": "http://books.google.co.in/books?id=_gWIvJx3tDoC&pg=PT160&dq=name:Forget+You&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_gWIvJx3tDoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "If you have tried hypnosis tapes and been disappointed with the results, it may be because the tapes weren't recorded with your voice. Self-Hypnosis for a Better Life by William W. Hewitt presents the breakthrough technique that will allow you to become your own hypnotherapist and improve your life. Using the system in this book, you will learn how to create self-hypnosis tapes in your own voice and be able to design your own self-improvement program. Making these tapes is surprisingly easy. All you need is a tape recorder, a blank tape, and the complete instructions in this book. Simply make yourself comfortable and recite one of the 23 scripts included in the book. The easy-to-follow scripts include self-hypnosis techniques to: Bring more love into your life Understand your dreams Help control your weight Control insomnia Improve your memory Increase self-confidence Enhance success at work Overcome phobias and fears Maintain good health Stop smoking Reduce stress Stimulate self-healing Once you have made the tapes, you can use them at your convenience. Just pop in a tape, close your eyes, and allow your own voice to hypnotize you. As you use these tapes, you will discover that hypnosis is safe, pleasant, relaxing, comfortable, and effective. Self-Hypnosis for a Better Life presents an elegant, simple system you can use to improve every area of your life.", "webReaderLink": "http://play.google.com/books/reader?id=_gWIvJx3tDoC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Double Fudge", "categories": ["Juvenile Fiction"], "authors": ["Judy Blume"], "printType": "BOOK", "pageCount": 224, "ratingsCount": 24, "averageRating": 4, "publisher": "Penguin", "publishedDate": "2011-12-01", "previewLink": "http://books.google.co.in/books?id=wa7Dz71JC7EC&pg=PA83&dq=name:Wait+for+You&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=wa7Dz71JC7EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Part of the classic Fudge series from Judy Blume, bestselling author of Tales of a Fourth Grade Nothing! Fudge is obsessed with money. He’s making his own “Fudge Bucks” and has plans to buy the entire world. But life gets really crazy when Fudge and his older brother, Peter, run into their long-lost relatives, the Howie Hatchers. Now they have to deal with annoying twin cousins and a weird younger cousin, coincidentally named Farley Drexel Hatcher—just like Fudge! Their names aren’t the only similarity, and before long, mini-Fudge is causing just as much trouble as Fudge always has! “As a kid, Judy Blume was my favorite author, and Tales of a Fourth Grade Nothing was my favorite book.”—Jeff Kinney, author of the bestselling Wimpy Kid series Love Fudge, Peter, and Sheila? Read all the books featuring your favorite characters: Tales of a Fourth Grade Nothing Otherwise Known as Sheila the Great Superfudge Fudge-a-Mania", "webReaderLink": "http://play.google.com/books/reader?id=wa7Dz71JC7EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Forever Mine, Valentine", "categories": ["Fiction"], "authors": ["Vicki Lewis Thompson"], "printType": "BOOK", "pageCount": 224, "ratingsCount": null, "averageRating": null, "publisher": "Harlequin", "publishedDate": "2006-02-01", "previewLink": "http://books.google.co.in/books?id=HqO4lf982lIC&pg=PA10&dq=name:Forever+Mine&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=HqO4lf982lIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "*", "webReaderLink": "http://play.google.com/books/reader?id=HqO4lf982lIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Punctuate and Capitalize, Grade 5", "categories": ["Education"], "authors": ["Shirley Spriegel", "Susan Mackey Collins"], "printType": "BOOK", "pageCount": 48, "ratingsCount": null, "averageRating": null, "publisher": "Teacher Created Resources", "publishedDate": "2004-06-28", "previewLink": "http://books.google.co.in/books?id=YJszxLsu_OgC&pg=PA8&dq=name:Practice+Makes+Perfect&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=YJszxLsu_OgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=YJszxLsu_OgC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Sky Is Everywhere", "categories": ["Young Adult Fiction"], "authors": ["Jandy Nelson"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 92, "averageRating": 4, "publisher": "Penguin", "publishedDate": "2010-03-09", "previewLink": "http://books.google.co.in/books?id=ZBmyksNXl6wC&printsec=frontcover&dq=name:The+Sky+Is+Everywhere&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ZBmyksNXl6wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Adrift after her sister Bailey's sudden death, Lennie finds herself torn between quiet, seductive Toby—Bailey's boyfriend who shares her grief—and Joe, the new boy in town who bursts with life and musical genius. Each offers Lennie something she desperately needs... though she knows if the two of them collide her whole world will explode. Join Lennie on this heartbreaking and hilarious journey of profound sorrow and mad love, as she makes colossal mistakes and colossal discoveries, as she traipses through band rooms and forest bedrooms and ultimately right into your heart. As much a celebration of love as a poignant portrait of loss, Lennie's struggle to sort her own melody out of the noise around her is always honest, often uproarious, and absolutely unforgettable.", "webReaderLink": "http://play.google.com/books/reader?id=ZBmyksNXl6wC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Perfect Game", "categories": ["Fiction"], "authors": ["John Grissmer"], "printType": "BOOK", "pageCount": 116, "ratingsCount": 1, "averageRating": 5, "publisher": "AuthorHouse", "publishedDate": "2008-12-12", "previewLink": "http://books.google.co.in/books?id=BPqqq6xrEg0C&pg=PA41&dq=name:The+Perfect+Play&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=BPqqq6xrEg0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The Perfect Game makes use of musical theater form to weave together two narratives. In the \"historical\" story, a young man out on his firs teaching job is given an assignment by his boss. Devise a new game for physical education students. That teacher, James Naismith, fulfills his assignment and invents what he hopes will prove to be a perfect game. His students like to play what they call: \"Basket-Ball.\" In the other story, two of today's basketball coaches, Nancy and Frank, have their own issues to overcome. They wind up coaching together while falling in love. The two stories are woven together when the historic Jim Naismith becomes a mentor figure for today's coach Nancy. They have some intense discussions over the true nature of basketball. Both stories are resolved in the context of the final game, The Home Team against their Arch Rivals. Down by point, the Home Team's desperate last second shot, may or may not go in.", "webReaderLink": "http://play.google.com/books/reader?id=BPqqq6xrEg0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Wisdom, Glory and the Name", "categories": ["Religion"], "authors": ["Priest-Monk Silouan"], "printType": "BOOK", "pageCount": 274, "ratingsCount": null, "averageRating": null, "publisher": "Lulu.com", "publishedDate": "2013-12-06", "previewLink": "http://books.google.co.in/books?id=j_90BgAAQBAJ&pg=PA70&dq=name:Fallen&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=j_90BgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A collection of scholarly essays on the role of women in Eastern Christianity in Antiquity and through to contemporary times.", "webReaderLink": "http://play.google.com/books/reader?id=j_90BgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Boy Who Sneaks in My Bedroom Window", "categories": ["Fiction"], "authors": ["Kirsty Moseley"], "printType": "BOOK", "pageCount": null, "ratingsCount": 9, "averageRating": 3.5, "publisher": "Kirsty Moseley", "publishedDate": "2012-04-29", "previewLink": "http://books.google.co.in/books?id=YYCYAwAAQBAJ&printsec=frontcover&dq=name:The+Boy+Who+Sneaks+in+My+Bedroom+Window&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=YYCYAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Liam James, boy next door and total douchebag, is my brother’s best friend. I can’t stand him. Well, that’s not strictly true, at night I see a side of him that no one else does. Every night Liam becomes my safe haven, my protector, the one to chase the demons of my abusive childhood away and hold all the broken pieces of me together. He’s cocky, he’s arrogant, and he’s also some sort of playboy in training. With his ‘hit it and quit it’ mentality, he’s the last person you’d want to fall in love with. I only wish someone had told my heart that… The international bestselling novel, and finalist of the Goodreads choice awards YA fiction 2012.", "webReaderLink": "http://play.google.com/books/reader?id=YYCYAwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Devil in Winter", "categories": ["Fiction"], "authors": ["Lisa Kleypas"], "printType": "BOOK", "pageCount": 320, "ratingsCount": 52, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2011-01-20", "previewLink": "http://books.google.co.in/books?id=0Wpa8MVFagoC&printsec=frontcover&dq=name:Devil+in+Winter&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=0Wpa8MVFagoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "From the New York Times bestselling author Lisa Kleypas comes the next title in the beloved romance series The Wallflowers - perfect for fans of Sarah MacLean, Julia Quinn and Eloisa James. 'Lisa Kleypas is the best' Sarah MacLean The Wallflowers: four young ladies enter London society and band together to each find a husband. Has the third 'Wallflower' now met her match? 'I'm Sebastian, Lord St. Vincent. I can't be celibate. Everyone knows that.' Desperate to escape her scheming relatives, Evangeline Jenner has sought the help of the most infamous scoundrel in London. A marriage of convenience is the only solution. No one would have ever paired the shy, stammering wallflower with the sinfully handsome viscount. It quickly becomes clear, however, that Evie is a woman of hidden strength - and Sebastian desires her more than any woman he's ever known. Determined to win her husband's elusive heart, Evie dares to strike a bargain with the devil: If Sebastian can stay celibate for three months, she will allow him into her bed. When Evie is threatened by a vengeful enemy from the past, Sebastian vows to do whatever it takes to protect his wife . . . even at the expense of his own life. Together they will defy their perilous fate, for the sake of all-consuming love . . . 'Kleypas can make you laugh and cry - on the same page' Julia Quinn The Wallflowers: Secrets of a Summer Night It Happened One Autumn The Devil in Winter Scandal in Spring A Wallflower Christmas Praise for Lisa Kleypas: 'Lushly sexy and thoroughly romantic . . . superbly crafted characters and an intriguing plot blend together brilliantly in this splendid romance' Booklist 'Intricately and elegantly crafted, intensely romantic . . . from a not-to-be-missed romance author' Kirkus Reviews 'Witty, often hilarious, and delightfully passionate' Library Journal, starred review 'An unforgettable story peopled with remarkable characters and a depth of emotion that will leave you breathless' Romantic Times BOOKreviews 'Is it possible to give a book 6 stars? . . . [This] story has all of the forbidden romance, witty banter, and sigh-inducing declarations of love that you deserve' That's Normal", "webReaderLink": "http://play.google.com/books/reader?id=0Wpa8MVFagoC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Hex Hall", "categories": ["Juvenile Fiction"], "authors": ["Rachel Hawkins"], "printType": "BOOK", "pageCount": 336, "ratingsCount": null, "averageRating": null, "publisher": "Simon and Schuster", "publishedDate": "2010-04-01", "previewLink": "http://books.google.co.in/books?id=wt9GEQLfg4kC&pg=PT26&dq=name:Hex+Hall&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=wt9GEQLfg4kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In the wake of a love spell gone horribly wrong, Sophie Mercer, a sixteen-year-old witch, is shipped off to Hecate Hall, a boarding school for witches, shapeshifters and faeries. The traumas of mortal high school are nothing compared to the goings on at \"Freak High.\" It's bad enough that she has to deal with a trio of mean girls led by the glamorous Elodie, but it's even worse when she begins to fall for Elodie's gorgeous boyfriend, Archer Cross, and frankly terrifying that the trio are an extremely powerful coven of dark witches. But when Sophie begins to learn the disturbing truth about her father, she is forced to face demons both metaphorical and real, and come to terms with her own growing power as a witch.", "webReaderLink": "http://play.google.com/books/reader?id=wt9GEQLfg4kC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Name the Boy", "categories": ["Adolescence"], "authors": ["Shawn Kerivan"], "printType": "BOOK", "pageCount": 128, "ratingsCount": null, "averageRating": null, "publisher": "Shawn Kerivan", "publishedDate": "2007-03-01", "previewLink": "http://books.google.co.in/books?id=Q0XLpg7uk54C&pg=PA8&dq=name:That+Boy&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Q0XLpg7uk54C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A collection of short stories for men. most deal with growing up male.", "webReaderLink": "http://play.google.com/books/reader?id=Q0XLpg7uk54C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Madness of Lord Ian Mackenzie", "categories": ["Fiction"], "authors": ["Jennifer Ashley"], "printType": "BOOK", "pageCount": 336, "ratingsCount": 49, "averageRating": 4, "publisher": "Penguin", "publishedDate": "2011-08-02", "previewLink": "http://books.google.co.in/books?id=zmLD7E3nbnwC&printsec=frontcover&dq=name:The+Madness+of+Lord+Ian+Mackenzie&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=zmLD7E3nbnwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A woman is drawn to a dangerously intruiging man in this unique historical romance from New York Times bestselling author Jennifer Ashley. It was whispered all through London Society that Ian Mackenzie was mad, that he’d spent his youth in an asylum, and was not to be trusted—especially with a lady. For the reputation of any woman caught in his presence was instantly ruined. Yet Beth found herself inexorably drawn to the Scottish lord whose hint of a brogue wrapped around her like silk and whose touch could draw her into a world of ecstasy. Despite his decadence and his intimidating intelligence, she could see that he needed help. Her help. Because suddenly the only thing that made sense to her was…The Madness of Lord Ian Mackenzie.", "webReaderLink": "http://play.google.com/books/reader?id=zmLD7E3nbnwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Darkest Night (A Marked Souls Christmas Novella)", "categories": null, "authors": ["Jessa Slade"], "printType": "BOOK", "pageCount": 160, "ratingsCount": null, "averageRating": null, "publisher": "Red Circle Ink", "publishedDate": "2013-08-12", "previewLink": "http://books.google.co.in/books?id=9tRXqCp3MtoC&pg=PT11&dq=name:The+Darkest+Night&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=9tRXqCp3MtoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "THE DARKEST NIGHT A Marked Souls Christmas Novella Marked Souls series #4.5 \"Wishing you a wicked Christmas...\" Possessed by a divine entity, Cyril Fane fought rampant evil and the pain of more private losses with a fiery golden sword...until he was beaten and left for dead by a malevolent force. Now exiled from his angelic brethren, he reluctantly joins the Chicago league of talyan-immortal warriors possessed by repentant demons-as his only chance to reclaim his sword and his place in the holy sphericanum. Bella McGreay, mysterious mistress of the Mortal Coil night club, has also danced around an uneasy affiliation with the talyan. She has secrets of her own to keep, and as the days shorten toward the winter solstice, shadows are deepening all around. Even as she barricades herself against the joys-and terrors-of the Christmas season, she'll have to decide whether the shadows or her secrets are more dangerous. Bella and Cyril have good reason to fear evil when an old enemy returns to torment them and the Chicago league. Only together will they find a way to the light after the darkest night. \"Praise for the Marked Souls novels\" \"DARK AND SEXY AND INTENSE.\" New York Times Bestselling Author Nalini Singh \"WONDERFULLY ADDICTIVE!\" New York Times Bestselling Author Gena Showalter \"A CHILLING, COMPLEX, AND UTTERLY BELIEVABLE WORLD.\" Award-winning Author Jeri Smith Ready \"[A] RICH CROSSOVER URBAN FANTASY.\" Publishers Weekly", "webReaderLink": "http://play.google.com/books/reader?id=9tRXqCp3MtoC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Lock and Key", "categories": ["Juvenile Fiction"], "authors": ["Sarah Dessen"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 112, "averageRating": 4, "publisher": "Penguin UK", "publishedDate": "2009-04-02", "previewLink": "http://books.google.co.in/books?id=A-YOchFFmHkC&printsec=frontcover&dq=name:Lock+and+Key&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=A-YOchFFmHkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Ruby Cooper likes to expect the worst. That way, she's never disappointed. Abandoned by her mother and forced to leave the house she calls home, Ruby is facing too many changes. Her lonely world has been transformed into a life of luxury by her long lost sister, but all Ruby wants to do is leave - she can make it on her own. Even Nate, the gorgeous boy-next-door can't seem to change her mind. Will Ruby realize first impressions don't always count? And that sometimes, people can surprise you, so it's ok to let the closest ones in . . .", "webReaderLink": "http://play.google.com/books/reader?id=A-YOchFFmHkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Chain Reaction", "categories": ["Juvenile Fiction"], "authors": ["Lena Goldfinch"], "printType": "BOOK", "pageCount": 25, "ratingsCount": null, "averageRating": null, "publisher": "Indigo Road Teen", "publishedDate": "2016-10-31", "previewLink": "http://books.google.co.in/books?id=qckLBAAAQBAJ&pg=PT9&dq=name:Heart+on+a+Chain&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=qckLBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "When a \"reveal your secret crush\" chain letter goes awry, Joy gets caught in the middle--possibly with the help from her first haunting. A short, lighthearted contemporary romance for teens and young adults. A SHORT STORY PREQUEL TO HAUNTING JOY Includes a sneak peak at Haunting Joy: Book 1. The Haunting Joy Series Haunting Joy: Book 1 Haunting Joy: Book 2 Chain Reaction: A Short Story (Prequel to Haunting Joy: Book 1)", "webReaderLink": "http://play.google.com/books/reader?id=qckLBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Me Before You", "categories": ["Fiction"], "authors": ["Jojo Moyes"], "printType": "BOOK", "pageCount": 400, "ratingsCount": 314, "averageRating": 4, "publisher": "Penguin", "publishedDate": "2012-12-31", "previewLink": "http://books.google.co.in/books?id=rTYEyWrXLO0C&printsec=frontcover&dq=name:Me+Before+You&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=rTYEyWrXLO0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Look out for Jojo’s new book, Still Me, the next book featuring Louisa Clark from Me Before You and After You, coming soon! They had nothing in common until love gave them everything to lose . . . Louisa Clark is an ordinary girl living an exceedingly ordinary life—steady boyfriend, close family—who has barely been farther afield than their tiny village. She takes a badly needed job working for ex–Master of the Universe Will Traynor, who is wheelchair bound after an accident. Will has always lived a huge life—big deals, extreme sports, worldwide travel—and now he’s pretty sure he cannot live the way he is. Will is acerbic, moody, bossy—but Lou refuses to treat him with kid gloves, and soon his happiness means more to her than she expected. When she learns that Will has shocking plans of his own, she sets out to show him that life is still worth living. A Love Story for this generation and perfect for fans of John Green’s The Fault in Our Stars, Me Before You brings to life two people who couldn’t have less in common—a heartbreakingly romantic novel that asks, What do you do when making the person you love happy also means breaking your own heart?", "webReaderLink": "http://play.google.com/books/reader?id=rTYEyWrXLO0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Clinical Medicine: a Systematic Treatise on the Diagnosis and Treatment of Diseases", "categories": ["Clinical medicine"], "authors": ["Austin Flint"], "printType": "BOOK", "pageCount": 795, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1879", "previewLink": "http://books.google.co.in/books?id=LdIk1FZPRcsC&pg=PA635&dq=name:Delirium&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=LdIk1FZPRcsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=LdIk1FZPRcsC&hl=&printsec=frontcover&source=gbs_api"}]