[{"title": "Dune", "categories": ["Fiction"], "authors": ["Frank Herbert"], "printType": "BOOK", "pageCount": 528, "ratingsCount": 33, "averageRating": 4.5, "publisher": "Penguin", "publishedDate": "2005", "previewLink": "http://books.google.co.in/books?id=B1hSG45JCX4C&dq=name:Dune+(Dune,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=B1hSG45JCX4C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Follows the adventures of Paul Atreides, the son of a betrayed duke given up for dead on a treacherous desert planet and adopted by its fierce, nomadic people, who help him unravel his most unexpected destiny.", "webReaderLink": "http://play.google.com/books/reader?id=B1hSG45JCX4C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Ender's Game", "categories": ["Fiction"], "authors": ["Orson Scott Card"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 111, "averageRating": 4, "publisher": "Tor Books", "publishedDate": "2017-10-17", "previewLink": "http://books.google.co.in/books?id=jaM7DwAAQBAJ&dq=name:Ender%27s+Game+(Ender%27s+Saga,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=jaM7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "\"The classic of modern science fiction\"--Front cover.", "webReaderLink": "http://play.google.com/books/reader?id=jaM7DwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Hitchhiker's Guide to the Galaxy", "categories": ["Fiction"], "authors": ["Douglas Adams"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 3364, "averageRating": 4, "publisher": "Del Rey", "publishedDate": "2007-12-18", "previewLink": "http://books.google.co.in/books?id=j24GMN0OtS8C&dq=name:The+Hitchhiker%27s+Guide+to+the+Galaxy+(Hitchhiker%27s+Guide+to+the+Galaxy,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=j24GMN0OtS8C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "NEW YORK TIMES BESTSELLER • “Extremely funny . . . inspired lunacy . . . [and] over much too soon.”—The Washington Post Book World Nominated as one of America’s best-loved novels by PBS’s The Great American Read Seconds before Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker’s Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor. Together, this dynamic pair began a journey through space aided by a galaxyful of fellow travelers: Zaphod Beeblebrox—the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian (formerly Tricia McMillan), Zaphod’s girlfriend, whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; and Veet Voojagig, a former graduate student obsessed with the disappearance of all the ballpoint pens he’s bought over the years. Where are these pens? Why are we born? Why do we die? For all the answers, stick your thumb to the stars! Praise for The Hitchhiker’s Guide to the Galaxy “A whimsical oddyssey . . . Characters frolic through the galaxy with infectious joy.”—Publishers Weekly “Irresistable!”—The Boston Globe", "webReaderLink": "http://play.google.com/books/reader?id=j24GMN0OtS8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "My Own True Name: New and Selected Poems for Young Adults, 1984-1999", "categories": ["Mexican Americans"], "authors": ["Pat Mora"], "printType": "BOOK", "pageCount": 81, "ratingsCount": 1, "averageRating": 5, "publisher": "Arte Publico Press", "publishedDate": "2000", "previewLink": "http://books.google.co.in/books?id=ybmOv6LgG8gC&pg=PT5&dq=name:1984&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ybmOv6LgG8gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "More than sixty poems, some with Spanish translations, include such titles as \"The Young Sor Juana\", \"Graduation Morning\", \"Border Town 1938\", \"Legal Alien\", \"Abuelita Magic\", and \"In the Blood\".", "webReaderLink": "http://play.google.com/books/reader?id=ybmOv6LgG8gC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Fahrenheit 451", "categories": ["Book burning"], "authors": ["Ray Bradbury"], "printType": "BOOK", "pageCount": 147, "ratingsCount": 12, "averageRating": 4.5, "publisher": null, "publishedDate": "1968", "previewLink": "http://books.google.co.in/books?id=AU9YtwAACAAJ&dq=name:Fahrenheit+451&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=AU9YtwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A fireman in charge of burning books meets a revolutionary school teacher who dares to read. Depicts a future world in which all printed reading material is burned.", "webReaderLink": "http://play.google.com/books/reader?id=AU9YtwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "National Drug Code Directory", "categories": ["Drugs"], "authors": null, "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1980", "previewLink": "http://books.google.co.in/books?id=cBetCuzJ3IwC&pg=RA28-PA8&dq=name:Foundation+(Foundation,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=cBetCuzJ3IwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=cBetCuzJ3IwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Wandering into Brave New World", "categories": ["History"], "authors": ["David Leon Higdon"], "printType": "BOOK", "pageCount": 255, "ratingsCount": null, "averageRating": null, "publisher": "Rodopi", "publishedDate": "2013-10-01", "previewLink": "http://books.google.co.in/books?id=HmQgAgAAQBAJ&printsec=frontcover&dq=name:Brave+New+World&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=HmQgAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Wandering into Brave New World explores the historical contexts and contemporary sources of Aldous Huxley’s 1932 novel which, seventy years after its initial publication remains the best known and most discussed dystopian work of the twentieth century. This new study addresses a number of questions which still remain open. Did his round-the-world trip in 1925-1926 provide material for the novel? Did India’s caste system contribute to the novel’s human levels? Is there an overarching pattern to the names of the novel/s characters? Has the role of Hollywood in the novel been underestimated? Is Lenina Crown a representative 1920s “flapper”? Did Huxley have knowledge of and sources for his Indian reservation characters and scenes quite independent of and more accurate than those of D. H. Lawrence’s writings? Did Huxley’s visit to Borneo contribute anything to the novel? New research allows substantive answers and even explains why Huxley linked such figures as Henry Ford and Sigmund Freud. It also shows how the novel overcomes its intense grounding in 1920s political turmoil to escape into the timelessness of dystopian fiction.", "webReaderLink": "http://play.google.com/books/reader?id=HmQgAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Hyperion Cantos", "categories": ["Future life"], "authors": ["Dan Simmons"], "printType": "BOOK", "pageCount": 929, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1990", "previewLink": "http://books.google.co.in/books?id=CdFXAAAAYAAJ&q=name:Hyperion+(Hyperion+Cantos,&dq=name:Hyperion+(Hyperion+Cantos,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=CdFXAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Eight centuries from now-- long after the Big Mistake and the death of Old Earth-- humanity is again on the brink of war. Galactic war this time.", "webReaderLink": "http://play.google.com/books/reader?id=CdFXAAAAYAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Do Androids Dream Of Electric Sheep?", "categories": ["Fiction"], "authors": ["Philip K. Dick"], "printType": "BOOK", "pageCount": 208, "ratingsCount": 14, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2010-04-01", "previewLink": "http://books.google.co.in/books?id=MoEO9onVftUC&printsec=frontcover&dq=name:Do+Androids+Dream+of+Electric+Sheep%3F&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=MoEO9onVftUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "World War Terminus had left the Earth devastated. Through its ruins, bounty hunter Rick Deckard stalked, in search of the renegade replicants who were his prey. When he wasn't 'retiring' them with his laser weapon, he dreamed of owning a live animal - the ultimate status symbol in a world all but bereft of animal life. Then Rick got his chance: the assignment to kill six Nexus-6 targets, for a huge reward. But in Deckard's world things were never that simple, and his assignment quickly turned into a nightmare kaleidoscope of subterfuge and deceit - and the threat of death for the hunter rather than the hunted ...", "webReaderLink": "http://play.google.com/books/reader?id=MoEO9onVftUC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Space Odyssey", "categories": ["Performing Arts"], "authors": ["Michael Benson"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 2, "averageRating": 5, "publisher": "Simon & Schuster", "publishedDate": "2019-04-23", "previewLink": "http://books.google.co.in/books?id=ruqODwAAQBAJ&printsec=frontcover&dq=name:2001:+A+Space+Odyssey+(Space+Odyssey,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ruqODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The definitive story of the making of 2001: A Space Odyssey, acclaimed today as one of the greatest films ever made, and of director Stanley Kubrick and writer Arthur C. Clarke—“a tremendous explication of a tremendous film….Breathtaking” (The Washington Post). Fifty years ago a strikingly original film had its premiere. Still acclaimed as one of the most remarkable and important motion pictures ever made, 2001: A Space Odyssey depicted the first contacts between humanity and extraterrestrial intelligence. The movie was the product of a singular collaboration between Stanley Kubrick and science fiction visionary Arthur C. Clarke. Fresh off the success of his cold war satire Dr. Strangelove, Kubrick wanted to make the first truly first-rate science fiction film. Drawing from Clarke’s ideas and with one of the author’s short stories as the initial inspiration, their bold vision benefited from pioneering special effects that still look extraordinary today, even in an age of computer-generated images. In Space Odyssey, author, artist, and award-winning filmmaker Michael Benson “delivers expert inside stuff” (San Francisco Chronicle) from his extensive research of Kubrick’s and Clarke’s archives. He has had the cooperation of Kubrick’s widow, Christiane, and interviewed most of the key people still alive who worked on the film. Drawing also from other previously unpublished interviews, Space Odyssey provides a 360-degree view of the film from its genesis to its legacy, including many previously untold stories. And it features dozens of photos from the making of the film, most never previously published. “At last! The dense, intense, detailed, and authoritative saga of the making of the greatest motion picture I’ve ever seen…Michael Benson has done the Cosmos a great service” (Academy Award-winning actor Tom Hanks).", "webReaderLink": "http://play.google.com/books/reader?id=ruqODwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "I, Robot", "categories": ["Fiction"], "authors": ["Isaac Asimov"], "printType": "BOOK", "pageCount": 224, "ratingsCount": 104, "averageRating": 3.5, "publisher": "Spectra", "publishedDate": "2004", "previewLink": "http://books.google.co.in/books?id=QEhWPgAACAAJ&dq=name:I,+Robot+(Robot,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=QEhWPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The development of robot technology to a state of perfection by future civilizations is explored in nine science fiction stories.", "webReaderLink": "http://play.google.com/books/reader?id=QEhWPgAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Slaughterhouse 5", "categories": ["Fiction"], "authors": ["Kurt Vonnegut"], "printType": "BOOK", "pageCount": 157, "ratingsCount": 260, "averageRating": 3.5, "publisher": "Random House", "publishedDate": "1991", "previewLink": "http://books.google.co.in/books?id=gMcab1F-IL4C&dq=name:Slaughterhouse-Five&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=gMcab1F-IL4C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "'The great, urgent, passionate American writer of our century, who offers us a model of the kind of compassionate thinking that might yet save us from ourselves.' George Saunders Prisoner of war, optometrist, time-traveller - these are the life roles of Billy Pilgrim, hero of this miraculously moving, bitter and funny story of innocence faced with apocalypse. Slaughterhouse Five is one of the world's great anti-war books. Centring on the infamous fire-bombing of Dresden in the Second World War, Billy Pilgrim's odyssey through time reflects the journey of our own fractured lives as we search for meaning in what we are afraid to know. 'An extraordinary success. A book to read and reread. He is a true artist' New York Times Book Review", "webReaderLink": "http://play.google.com/books/reader?id=gMcab1F-IL4C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Stranger in a Strange Land", "categories": ["Fiction"], "authors": ["Robert A. Heinlein"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 140, "averageRating": 4, "publisher": "Penguin", "publishedDate": "1987-05-15", "previewLink": "http://books.google.co.in/books?id=jBtDSf1VzQkC&printsec=frontcover&dq=name:Stranger+in+a+Strange+Land&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=jBtDSf1VzQkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Robert Heinlein's Hugo Award-winning all-time masterpiece, the brilliant novel that grew from a cult favorite to a bestseller to a science fiction classic. Raised by Martians on Mars, Valentine Michael Smith is a human who has never seen another member of his species. Sent to Earth, he is a stranger who must learn what it is to be a man. But his own beliefs and his powers far exceed the limits of humankind, and as he teaches them about grokking and water-sharing, he also inspires a transformation that will alter Earth’s inhabitants forever...", "webReaderLink": "http://play.google.com/books/reader?id=jBtDSf1VzQkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Foundation Novels 7-Book Bundle", "categories": ["Fiction"], "authors": ["Isaac Asimov"], "printType": "BOOK", "pageCount": 2680, "ratingsCount": null, "averageRating": null, "publisher": "Spectra", "publishedDate": "2014-08-05", "previewLink": "http://books.google.co.in/books?id=724OBAAAQBAJ&dq=name:The+Foundation+Trilogy+(Foundation,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=724OBAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The story of our future begins with the Foundation. Named the best series of all time by the Hugo Awards, the Foundation novels of Isaac Asimov unquestionably comprise one of the great masterworks of science fiction, unsurpassed for its unique blend of nonstop action, daring ideas, and extensive world-building. Now, all seven volumes are together for the first time in this essential eBook bundle: FOUNDATION FOUNDATION AND EMPIRE SECOND FOUNDATION FOUNDATION’S EDGE FOUNDATION AND EARTH PRELUDE TO FOUNDATION FORWARD THE FOUNDATION For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying. Only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future—a dark age of ignorance, barbarism, and warfare that will last thirty thousand years. To preserve knowledge and save humanity, Seldon gathers the best minds in the Empire—both scientists and scholars—and brings them to a bleak planet at the edge of the galaxy to serve as a beacon of hope for future generations. He calls this sanctuary the Foundation. But soon the fledgling Foundation finds itself at the mercy of corrupt warlords rising in the wake of the receding Empire. And mankind’s last best hope is faced with an agonizing choice: submit to the barbarians and live as slaves—or take a stand for freedom and risk total destruction. Praise for Isaac Asimov and his Foundation series “A true polymath, a superb rationalist, an exciting and accessible writer in both fiction and nonfiction, Isaac Asimov was simply a master of all he surveyed.”—Greg Bear “Asimov served wondrous meals-of-the-mind to a civilization that was starved for clear thinking about the future. To this day, his visions spice our ongoing dinner-table conversation about human destiny.”—David Brin “Isaac was still in his teens when I met him, a fan of mine before I was a fan of his. Writing for John W. Campbell back in the famous ‘golden age of science fiction,’ he became one of the founders of our field. With the Robot stories and the Foundation stories, he helped to shape science fiction as we know it.”—Jack Williamson “I grew up on the ABC’s of science fiction—Asimov, Bradbury, Clarke. There’s a reason Asimov’s name comes first, and not just because of the alphabet!”—Janis Ian “With his fertile imagination, his wit, and his prolific output, Isaac Asimov truly laid the foundation for all future generations of science fiction writers.”—Kevin J. Anderson “If anything can be said to have been the launch pad for space-age science fiction, it has to be the Foundation trilogy. It’s a classic. And it’s unforgettable.”—Jack McDevitt “The Foundation series is one of the masterpieces of science fiction. If you’ve never read these novels, then you’re in for a treat, and even if you’ve already read them, then you owe it to yourself to reread them, because they’re still great.”—Allen Steele “Quite simply, Asimov got me started.”—Liz Williams", "webReaderLink": "http://play.google.com/books/reader?id=724OBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Martian", "categories": ["Adventure stories"], "authors": ["Andy Weir"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 2908, "averageRating": 4, "publisher": null, "publishedDate": "2015", "previewLink": "http://books.google.co.in/books?id=kPmLDQAAQBAJ&dq=name:The+Martian&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=kPmLDQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "\"Originally self-published as an ebook in 2011 and subsequently published in hardcover in slightly different form in the United States by Crown Publishers ... and as a trade paperback by Broadway Books ... in 2014\"--Title page verso.", "webReaderLink": "http://play.google.com/books/reader?id=kPmLDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Childhood's End", "categories": ["Fiction"], "authors": ["Arthur C. Clarke"], "printType": "BOOK", "pageCount": 258, "ratingsCount": 1, "averageRating": 4, "publisher": "RosettaBooks", "publishedDate": "2012-11-30", "previewLink": "http://books.google.co.in/books?id=OcspAAAAQBAJ&printsec=frontcover&dq=name:Childhood%27s+End&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=OcspAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In the Retro Hugo Award–nominated novel that inspired the Syfy miniseries, alien invaders bring peace to Earth—at a grave price: “A first-rate tour de force” (The New York Times). In the near future, enormous silver spaceships appear without warning over mankind’s largest cities. They belong to the Overlords, an alien race far superior to humanity in technological development. Their purpose is to dominate Earth. Their demands, however, are surprisingly benevolent: end war, poverty, and cruelty. Their presence, rather than signaling the end of humanity, ushers in a golden age . . . or so it seems. Without conflict, human culture and progress stagnate. As the years pass, it becomes clear that the Overlords have a hidden agenda for the evolution of the human race that may not be as benevolent as it seems. “Frighteningly logical, believable, and grimly prophetic . . . Clarke is a master.” —Los Angeles Times", "webReaderLink": "http://play.google.com/books/reader?id=OcspAAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Ready Player One", "categories": ["Fiction"], "authors": ["Ernest Cline"], "printType": "BOOK", "pageCount": 384, "ratingsCount": 3178, "averageRating": 4, "publisher": "Random House", "publishedDate": "2011-08-18", "previewLink": "http://books.google.co.in/books?id=8qs1-ypf7e0C&printsec=frontcover&dq=name:Ready+Player+One+(Ready+Player+One,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=8qs1-ypf7e0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "***NOW A MAJOR MOTION PICTURE DIRECTED BY STEVEN SPIELBERG*** A world at stake. A quest for the ultimate prize. Are you ready? It's the year 2044, and the real world has become an ugly place. We're out of oil. We've wrecked the climate. Famine, poverty, and disease are widespread. Like most of humanity, Wade Watts escapes this depressing reality by spending his waking hours jacked into the OASIS, a sprawling virtual utopia where you can be anything you want to be, where you can live and play and fall in love on any of ten thousand planets. And like most of humanity, Wade is obsessed by the ultimate lottery ticket that lies concealed within this alternate reality: OASIS founder James Halliday, who dies with no heir, has promised that control of the OASIS - and his massive fortune - will go to the person who can solve the riddles he has left scattered throughout his creation. For years, millions have struggled fruitlessly to attain this prize, knowing only that the riddles are based in the culture of the late twentieth century. And then Wade stumbles onto the key to the first puzzle. Suddenly, he finds himself pitted against thousands of competitors in a desperate race to claim the ultimate prize, a chase that soon takes on terrifying real-world dimensions - and that will leave both Wade and his world profoundly changed. ____________________________________ If you loved READY PLAYER ONE and can't wait for more, check out ARMADA, Ernest Cline's latest geek masterpiece! ‘Wildly original and stuffed with irresistible nostalgia, Ready Player One is a spectacularly genre-busting, ambitious, and charming debut’ Independent ‘Part intergalactic scavenger hunt, part romance, and all heart’ CNN ‘Ernest Cline’s novel deserves to be a modern classic’ SciFiNow ‘Gorgeously geeky, superbly entertaining, this really is a spectacularly successful debut’ Daily Mail", "webReaderLink": "http://play.google.com/books/reader?id=8qs1-ypf7e0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Neuromancer", "categories": ["Fiction"], "authors": ["William Gibson"], "printType": "BOOK", "pageCount": 371, "ratingsCount": 216, "averageRating": 3, "publisher": "Ace Hardcover", "publishedDate": "2004", "previewLink": "http://books.google.co.in/books?id=2NyiPwAACAAJ&dq=name:Neuromancer+(Sprawl,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2NyiPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Case, a burned-out computer whiz, is asked to steal a security code that is locked in the most heavily guarded databank in the solar system, in a special twentieth anniversary edition of the influential Hugo, Nebula, and Philip K. Dick Award-winning novel.", "webReaderLink": "http://play.google.com/books/reader?id=2NyiPwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Martian Chronicles", "categories": ["Fiction"], "authors": ["Ray Bradbury"], "printType": "BOOK", "pageCount": 241, "ratingsCount": 128, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2012-04-17", "previewLink": "http://books.google.co.in/books?id=HzQXlPS48PQC&printsec=frontcover&dq=name:The+Martian+Chronicles&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=HzQXlPS48PQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The tranquility of Mars is disrupted by humans who want to conquer space, colonize the planet, and escape a doomed Earth.", "webReaderLink": "http://play.google.com/books/reader?id=HzQXlPS48PQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Ballad of Songbirds and Snakes (A Hunger Games Novel)", "categories": ["Young Adult Fiction"], "authors": ["Suzanne Collins"], "printType": "BOOK", "pageCount": 528, "ratingsCount": 7, "averageRating": 4.5, "publisher": "Scholastic Inc.", "publishedDate": "2020-05-19", "previewLink": "http://books.google.co.in/books?id=NrahDwAAQBAJ&printsec=frontcover&dq=name:The+Hunger+Games+(The+Hunger+Games,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=NrahDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Ambition will fuel him. Competition will drive him. But power has its price.", "webReaderLink": "http://play.google.com/books/reader?id=NrahDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "FRANKENSTEIN (The Original 1818 Edition)", "categories": ["Fiction"], "authors": ["Mary Shelley"], "printType": "BOOK", "pageCount": 191, "ratingsCount": null, "averageRating": null, "publisher": "e-artnow", "publishedDate": "2017-12-06", "previewLink": "http://books.google.co.in/books?id=tU5ODwAAQBAJ&printsec=frontcover&dq=name:Frankenstein:+The+1818+Text&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=tU5ODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Frankenstein; or, The Modern Prometheus is a novel written by Mary Shelley about a creature produced by an unorthodox scientific experiment. Shelley started writing the story when she was nineteen, and the novel was published when she was twenty-one. The first edition was published anonymously in London in 1818. Shelley's name appears on the second edition, published in France in 1823. The original 1818 'Uncensored' Edition of Frankenstein as first published anonymously in 1818. This original version is much more true to the spirit of the author's original intentions than the heavily revised 1831 edition, edited by Shelley, in part, because of pressure to make the story more conservative. Many scholars prefer the 1818 text to the more common 1831 edition. Mary Wollstonecraft Shelley (1797–1851) was an English novelist, short story writer, dramatist, essayist, biographer, and travel writer, best known for her Gothic novel Frankenstein: or, The Modern Prometheus.", "webReaderLink": "http://play.google.com/books/reader?id=tU5ODwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Forever War", "categories": ["Fiction"], "authors": ["Joe Haldeman"], "printType": "BOOK", "pageCount": 236, "ratingsCount": 117, "averageRating": 4, "publisher": "Macmillan", "publishedDate": "2009-02-17", "previewLink": "http://books.google.co.in/books?id=l4lxLsH2n3YC&dq=name:The+Forever+War+(The+Forever+War,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=l4lxLsH2n3YC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "\"Del Rey book.\" Battling the Taurans in space was one problem as Private William Mandella worked his way up the ranks to major. In spanning the stars, he aged only months while Earth aged centuries.", "webReaderLink": "http://play.google.com/books/reader?id=l4lxLsH2n3YC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Human Rights and the Environment", "categories": ["Environmental law"], "authors": ["Svitlana Kravchenko", "John E. Bonine"], "printType": "BOOK", "pageCount": null, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "2008", "previewLink": "http://books.google.co.in/books?id=p5ZwzQEACAAJ&dq=name:The+Time+Machine&hl=&cd=1&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=p5ZwzQEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Play of Daniel Keyes' Flowers for Algernon", "categories": ["English drama"], "authors": ["Bert Coules"], "printType": "BOOK", "pageCount": 90, "ratingsCount": 3, "averageRating": 4.5, "publisher": "Heinemann", "publishedDate": "1993", "previewLink": "http://books.google.co.in/books?id=pIs9Em38dAoC&printsec=frontcover&dq=name:Flowers+for+Algernon&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=pIs9Em38dAoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This is a powerful dramatisation of Daniel Keyes's perceptive and sad novel. Charlie is a retarded adult who desperately wants to be able to read and write. He undergoes a brain operation which increases his intelligence. Yet such an operation begs many questions--can Charlie's emotional development keep pace with the intellectual? How do the psychiatrists and psychologists view Charlie--as a man or as the subject of an experiment like the mouse, Algernon? And the biggest question of all--will the operation be successful?", "webReaderLink": "http://play.google.com/books/reader?id=pIs9Em38dAoC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Left Hand of Darkness", "categories": ["Fiction"], "authors": ["Ursula K. Le Guin"], "printType": "BOOK", "pageCount": 320, "ratingsCount": null, "averageRating": null, "publisher": "Hachette UK", "publishedDate": "2017-04-13", "previewLink": "http://books.google.co.in/books?id=MDveDQAAQBAJ&printsec=frontcover&dq=name:The+Left+Hand+of+Darkness+(Hainish+Cycle&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=MDveDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'A rich and complex story of friendship and love' GUARDIAN 'It's a giant thought experiment that's also a cracking good read about gender' Neil Gaiman 'Love doesn't just sit there, like a stone, it has to be made, like bread; remade all the time, made new' Two people, until recently strangers, find themselves on a long, tortuous and dangerous journey across the ice. One is an outcast, forced to leave his beloved homeland; the other is fleeing from a different kind of persecution. What they have in common is curiosity, about others and themselves, and an almost unshakeable belief that the world can be a better place. As they journey for over 800 miles, across the harshest, most inhospitable landscape, they discover the true meaning of friendship, and of love.", "webReaderLink": "http://play.google.com/books/reader?id=MDveDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Rendezvous with Rama", "categories": ["Fiction"], "authors": ["Arthur C. Clarke"], "printType": "BOOK", "pageCount": 256, "ratingsCount": 78, "averageRating": 4, "publisher": "RosettaBooks", "publishedDate": "2012-11-30", "previewLink": "http://books.google.co.in/books?id=mVEqAAAAQBAJ&printsec=frontcover&dq=name:Rendezvous+with+Rama+(Rama,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=mVEqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Astronauts explore an alien spacecraft hurtling toward the sun in this Hugo and Nebula Award–winning novel—“a stone-cold classic” of hard sci-fi (The Guardian). An enormous cylindrical object has entered Earth’s solar system on a collision course with the sun. A team of astronauts are sent to explore the mysterious craft, which the denizens of the solar system name Rama. What they find is astonishing evidence of a civilization far more advanced than ours. They find an interior stretching over fifty kilometers; a forbidding cylindrical sea; mysterious and inaccessible buildings; and strange machine-animal hybrids, or “biots,” that inhabit the ship. But what they don’t find is an alien presence. So who—and where—are the Ramans? Often listed as one of Clarke’s finest novels, Rendezvous with Rama won numerous awards, including the Hugo, the Nebula, the Jupiter, and the British Science Fiction Awards. A fast-paced and compelling story of an enigmatic encounter with alien technology, Rendezvous with Rama offers both answers and unsolved mysteries that will continue to fascinate readers for generations. “Mr. Clarke is splendid . . . We experience that chilling touch of the alien, the not-quite-knowable, that distinguishes SF at its most technically imaginative.” —The New York Times", "webReaderLink": "http://play.google.com/books/reader?id=mVEqAAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Handmaid's Tale", "categories": ["American fiction"], "authors": ["Coral Ann Howells", "Margaret Atwood"], "printType": "BOOK", "pageCount": 96, "ratingsCount": 500, "averageRating": 4, "publisher": null, "publishedDate": "1998", "previewLink": "http://books.google.co.in/books?id=vqdfvgEACAAJ&dq=name:The+Handmaid%27s+Tale&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=vqdfvgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Key Features: Study methods Introduction to the text Summaries with critical notes Themes and techniques Textual analysis of key passages Author biography Historical and literary background Modern and historical critical approaches Chronology Glossary of literary terms", "webReaderLink": "http://play.google.com/books/reader?id=vqdfvgEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The War of the Worlds", "categories": ["Fiction"], "authors": ["H. G. Wells"], "printType": "BOOK", "pageCount": 206, "ratingsCount": 1, "averageRating": 5, "publisher": "First Avenue Editions ™", "publishedDate": "2017-01-01", "previewLink": "http://books.google.co.in/books?id=xJpXBAAAQBAJ&printsec=frontcover&dq=name:The+War+of+the+Worlds&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=xJpXBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "When a meteorite lands in Surrey, the locals don't know what to make of it. But as Martians emerge and begin killing bystanders, it quickly becomes clear—England is under attack. Armed soldiers converge on the scene to ward off the invaders, but meanwhile, more Martian cylinders land on Earth, bringing reinforcements. As war breaks out across England, the locals must fight for their lives, but life on Earth will never be the same. This is an unabridged version of one of the first fictional accounts of extraterrestrial invasion. H. G. Wells's military science fiction novel was first published in book form in 1898, and is considered a classic of English literature.", "webReaderLink": "http://play.google.com/books/reader?id=xJpXBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Jurassic Park", "categories": ["Fiction"], "authors": ["Michael Crichton"], "printType": "BOOK", "pageCount": 416, "ratingsCount": 1849, "averageRating": 4, "publisher": "Ballantine Books", "publishedDate": "2012-05-14", "previewLink": "http://books.google.co.in/books?id=V5s14nks9I8C&printsec=frontcover&dq=name:Jurassic+Park+(Jurassic+Park,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=V5s14nks9I8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "#1 NEW YORK TIMES BESTSELLER • From the author of Timeline, Sphere, and Congo, this is the classic thriller of science run amok that took the world by storm. Nominated as one of America’s best-loved novels by PBS’s The Great American Read “[Michael] Crichton’s dinosaurs are genuinely frightening.”—Chicago Sun-Times An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Now humankind’s most thrilling fantasies have come true. Creatures extinct for eons roam Jurassic Park with their awesome presence and profound mystery, and all the world can visit them—for a price. Until something goes wrong. . . . In Jurassic Park, Michael Crichton taps all his mesmerizing talent and scientific brilliance to create his most electrifying technothriller. Praise for Jurassic Park “Wonderful . . . powerful.”—The Washington Post Book World “Frighteningly real . . . compelling . . . It’ll keep you riveted.”—The Detroit News “Full of suspense.”—The New York Times Book Review", "webReaderLink": "http://play.google.com/books/reader?id=V5s14nks9I8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Snow Crash", "categories": ["Fiction"], "authors": ["Neal Stephenson"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 198, "averageRating": 3.5, "publisher": "Penguin UK", "publishedDate": "1994-10-27", "previewLink": "http://books.google.co.in/books?id=inYs79gV4UQC&printsec=frontcover&dq=name:Snow+Crash&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=inYs79gV4UQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The only relief from the sea of logos is within the well-guarded borders of the Burbclaves. Is it any wonder that most sane folks have forsaken the real world and chosen to live in the computer-generated universe of virtual reality? In a major city, the size of a dozen Manhattans, is a domain of pleasures limited only by the imagination. But now a strange new computer virus called Snow Crash is striking down hackers everywhere, leaving an unlikely young man as humankind's last best hope.", "webReaderLink": "http://play.google.com/books/reader?id=inYs79gV4UQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Speaker for the Dead", "categories": ["Science fiction"], "authors": ["Orson Scott Card"], "printType": "BOOK", "pageCount": 382, "ratingsCount": 93, "averageRating": 4, "publisher": "Orbit Books", "publishedDate": "1986", "previewLink": "http://books.google.co.in/books?id=DLd8PwAACAAJ&dq=name:Speaker+for+the+Dead+(Ender%27s+Saga,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=DLd8PwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Science fiction-roman.", "webReaderLink": "http://play.google.com/books/reader?id=DLd8PwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Starship Troopers", "categories": ["Fiction"], "authors": ["Robert A. Heinlein"], "printType": "BOOK", "pageCount": 352, "ratingsCount": 125, "averageRating": 4, "publisher": "Penguin", "publishedDate": "1987-05-15", "previewLink": "http://books.google.co.in/books?id=1lK3xA72adAC&printsec=frontcover&dq=name:Starship+Troopers&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=1lK3xA72adAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In Robert A. Heinlein’s controversial Hugo Award-winning bestseller, a recruit of the future goes through the toughest boot camp in the Universe—and into battle against mankind’s most alarming enemy... Johnnie Rico never really intended to join up—and definitely not the infantry. But now that he’s in the thick of it, trying to get through combat training harder than anything he could have imagined, he knows everyone in his unit is one bad move away from buying the farm in the interstellar war the Terran Federation is waging against the Arachnids. Because everyone in the Mobile Infantry fights. And if the training doesn’t kill you, the Bugs are more than ready to finish the job... “A classic…If you want a great military adventure, this one is for you.”—All SciFi", "webReaderLink": "http://play.google.com/books/reader?id=1lK3xA72adAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Moon Is a Harsh Mistress", "categories": ["Fiction"], "authors": ["Robert A. Heinlein"], "printType": "BOOK", "pageCount": 383, "ratingsCount": 3, "averageRating": 4, "publisher": "Macmillan", "publishedDate": "1966", "previewLink": "http://books.google.co.in/books?id=UOSADwAAQBAJ&dq=name:The+Moon+is+a+Harsh+Mistress&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=UOSADwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A one-armed computer technician, a radical blonde bombshell, an aging academic, and a sentient all-knowing computer lead the lunar population in a revolution against Earth's colonial rule", "webReaderLink": "http://play.google.com/books/reader?id=UOSADwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Canticle for Leibowitz", "categories": null, "authors": ["Walter M. Miller"], "printType": "BOOK", "pageCount": 320, "ratingsCount": 131, "averageRating": 4, "publisher": null, "publishedDate": "1969", "previewLink": "http://books.google.co.in/books?id=43E_vgEACAAJ&dq=name:A+Canticle+for+Leibowitz+(St.+Leibowitz,&hl=&cd=1&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=43E_vgEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Clockwork Orange", "categories": ["Fiction"], "authors": ["Anthony Burgess"], "printType": "BOOK", "pageCount": 240, "ratingsCount": 163, "averageRating": 4, "publisher": "W. W. Norton", "publishedDate": "2019-05-21", "previewLink": "http://books.google.co.in/books?id=357DuwEACAAJ&dq=name:A+Clockwork+Orange&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=357DuwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Still dazzling and transgressive, this groundbreaking novel remains a frightening fable on morality and the meaning of human freedom.", "webReaderLink": "http://play.google.com/books/reader?id=357DuwEACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Wrinkle in Time", "categories": ["Juvenile Fiction"], "authors": ["Madeleine L'Engle"], "printType": "BOOK", "pageCount": 208, "ratingsCount": 394, "averageRating": 3.5, "publisher": "Penguin UK", "publishedDate": "2007-11-01", "previewLink": "http://books.google.co.in/books?id=Zvmfyx2xUhMC&printsec=frontcover&dq=name:A+Wrinkle+in+Time+(Time+Quintet,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Zvmfyx2xUhMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A Puffin Book - stories that last a lifetime. Now a major motion picture! Puffin Modern Classics are relaunched under a new logo: A Puffin Book. There are 20 titles to collect in the series, listed below, all with exciting new covers and fun-filled endnotes. A WRINKLE IN TIME is a classic sci-fi adventure for children by bestselling US author, Madeleine L'Engle. When Charles Wallace Murry goes searching through a 'wrinkle in time' for his lost father, he finds himself on an evil planet where all life is enslaved by a huge pulsating brain known as 'It'. How Charles, his sister Meg and friend Calvin find and free his father makes this a very special and exciting mixture of fantasy and science fiction, which all the way through is dominated by the funny and mysterious trio of guardian angels known as Mrs Whatsit, Mrs Who and Mrs Which. Madeleine L'Engle lived in New York and wrote over 60 books for children, including A WRINKLE IN TIME, the first in her Time Quintet series and winner of the highly prestigious Newbury Medal. she died in 2007, aged 88.", "webReaderLink": "http://play.google.com/books/reader?id=Zvmfyx2xUhMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Ghost Brigades", "categories": ["Fiction"], "authors": ["John Scalzi"], "printType": "BOOK", "pageCount": null, "ratingsCount": 63, "averageRating": 3.5, "publisher": "Pan Macmillan", "publishedDate": "2008-08-28", "previewLink": "http://books.google.co.in/books?id=VLFIu1ZwRKQC&printsec=frontcover&dq=name:Old+Man%27s+War+(Old+Man%27s+War,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=VLFIu1ZwRKQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The sequel to his extraordinary Old Man's War, John Scalzi's The Ghost Brigades is the second in The Old Man's War series. Who can you trust, if you can't trust yourself? Three hostile alien races have united against humanity, determined to halt our expansion into space. The mastermind behind this lethal alliance is a traitor – Charles Boutin. He was a Colonial Defence Force scientist, with access to their biggest military secrets. Now the CDF's only hope is to discover Boutin's plan. Trouble is, Boutin's dead. As a super-soldier created from Boutin's own DNA, Jared Dirac may have answers. However, when Dirac fails to access the scientist's memories, he's transferred to the Ghost Brigades for training. These elite troops are also cloned from the dead, so he might fit in. But will Dirac's memory return as the enemy plots the fate of humankind? And whose side is Dirac really on?", "webReaderLink": "http://play.google.com/books/reader?id=VLFIu1ZwRKQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Animal Farm", "categories": ["Fiction"], "authors": ["George Orwell", "General Press"], "printType": "BOOK", "pageCount": 128, "ratingsCount": 1796, "averageRating": 4, "publisher": "GENERAL PRESS", "publishedDate": "2018-05-15", "previewLink": "http://books.google.co.in/books?id=ZLhaDwAAQBAJ&printsec=frontcover&dq=name:Animal+Farm&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ZLhaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Animal Farm is regarded in the literary field as one of the most famous satirical allegories of Soviet totalitarianism. Orwell based the book on events up to and during Joseph Stalin's regime. Orwell, a democratic socialist, and a member of the Independent Labour Party for many years, was a critic of Stalin, and was suspicious of Moscow-directed Stalinism after his experiences in the Spanish Civil War. The plot is an allegory in which the pigs in a farm play the role of the Bolshevik revolutionaries and overthrow and oust the human owners of the farm, setting it up as a commune in which, at first, all animals are equal. The other characters have their parallels in the real world, but care should be taken with these comparisons as they do not always match history exactly and often simply represent generalised concepts. The novel was chosen by TIME Magazine as one of the 100 best English-language novels from 1923 to the present.", "webReaderLink": "http://play.google.com/books/reader?id=ZLhaDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Possessed and the Dispossessed", "categories": ["History"], "authors": ["Lesley A. Sharp"], "printType": "BOOK", "pageCount": 345, "ratingsCount": null, "averageRating": null, "publisher": "Univ of California Press", "publishedDate": "1996-12", "previewLink": "http://books.google.co.in/books?id=Y7cwDwAAQBAJ&pg=PA168&dq=name:The+Dispossessed&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Y7cwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This finely drawn portrait of a complex, polycultural urban community in Madagascar emphasizes the role of spirit medium healers, a group heretofore seen as having little power. These women, Leslie Sharp argues, are far from powerless among the peasants and migrant laborers who work the land in this plantation economy. In fact, Sharp's wide-ranging analysis shows that tromba, or spirit possession, is central to understanding the complex identities of insiders and outsiders in this community, which draws people from all over the island and abroad. Sharp's study also reveals the contradictions between indigenous healing and Western-derived Protestant healing and psychiatry. Particular attention to the significance of migrant women's and children's experiences in a context of seeking relief from personal and social ills gives Sharp's investigation importance for gender studies as well as for studies in medical anthropology, Africa and Madagascar, the politics of culture, and religion and ritual.", "webReaderLink": "http://play.google.com/books/reader?id=Y7cwDwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Ringworld", "categories": ["Fiction"], "authors": ["Larry Niven"], "printType": "BOOK", "pageCount": 342, "ratingsCount": 72, "averageRating": 3.5, "publisher": "Random House Digital, Inc.", "publishedDate": "1970", "previewLink": "http://books.google.co.in/books?id=xKy-ZPuz3bsC&dq=name:Ringworld+(Ringworld,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=xKy-ZPuz3bsC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A two-headed creature and a large redfurred carnivore are among the members of a party which arrives to explore a mysterious world fabricated in the shape of a ring", "webReaderLink": "http://play.google.com/books/reader?id=xKy-ZPuz3bsC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Using Solaris 9", "categories": ["Computers"], "authors": ["Radhika Girisan", "Tanuj Jain"], "printType": "BOOK", "pageCount": 639, "ratingsCount": 1, "averageRating": 5, "publisher": "Que Publishing", "publishedDate": "2002", "previewLink": "http://books.google.co.in/books?id=pCRbEzYsNNEC&pg=PA57&dq=name:Solaris&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=pCRbEzYsNNEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Annotation Provides administrators with in depth coverage of the #1 UNIX operating system, including features new to the popular version 9. Provides real-life exposure to the reader for the most popular UNIX operating system. Covers new features of Solaris such as NIS/NIS+ (Network Information Service) and support for IPv6. Information is presented in a concise language and provides graphical cues for clear understanding of the features covered. Solaris 9 is a soon-to-be-released UNIX operating system by Sun Microsystems that enables organizations to improve services, reduce risks, and decrease costs through the promise of scalability, continuous real-time computing, and enhanced security. With the release of Solaris 9, Sun Microsystems has defined what a dot-com grade platform must be. It has been tested in the worlds largest data centers. Special Edition Using Solaris 9 is intended to be a one-stop, in-depth reference guide to Solaris 9. It focuses on the reader gaining real-life exposure to the functions of the operating system. This book avoids jargon, and emphasizes brevity and clarity. It also covers key features of Solaris 9 such as NIS/NIS+, Solstice DiskSuie, Solstice AdminSuite, WebFS, JumpStart, and WebStart. Ganesh Govindaswamy is a Sun Certified Solaris System Administrator and is currently a Solaris System Administrator at InfoBase Technologies Ltd., where he administers user accounts, file systems, and network services. He is also certified in C and C++. NIIT is a global training and software organization offering customized and packaged multimedia educational software products and training. NIIT and Sun Microsystems have a Master Services Agreement. NIIT handles the entire enterprise-wide support functions for Sun, including Sun Technical support, Sun consulting services, training and certification. NIIT has one of the largest learning material development facilities in the world. 0789726505", "webReaderLink": "http://play.google.com/books/reader?id=pCRbEzYsNNEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Junior Doctor Survival Guide - EPub3", "categories": ["Medical"], "authors": ["Paul Watson", "Joseph O'Brien"], "printType": "BOOK", "pageCount": 700, "ratingsCount": null, "averageRating": null, "publisher": "Elsevier Health Sciences", "publishedDate": "2017-03-23", "previewLink": "http://books.google.co.in/books?id=cSV4DgAAQBAJ&pg=PA173&dq=name:Contact&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=cSV4DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Be punctual, hard-working and honest, but most importantly – be excellent. Written by residents, for interns and residents, the Junior Doctor Survival Guide is a thorough, focused summary of everything you need to know to get through your internship and residency (relatively) intact. It provides advice on seeking help from your senior clinicians, ensuring ethical practice and decision making, conducting an efficient ward round and carrying out emergency assessments and includes a concise overview of the salient features of specialist medical and surgical care in both in- and outpatient settings. Covering both clinical and professional contexts, this guide will support you to build your confidence in applying the principles you learned in medical school to the real world. Scenario boxes – how difficult conversations should be approached Common medications – quick reference tables of common medications and dosages Clinical abbreviations and acronyms – a comprehensive list of common abbreviations and acronyms used throughout clinical settings. Full eBook on ExpertConsult", "webReaderLink": "http://play.google.com/books/reader?id=cSV4DgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Ubik", "categories": ["FICTION"], "authors": ["Philip K. Dick"], "printType": "BOOK", "pageCount": 227, "ratingsCount": 61, "averageRating": 3.5, "publisher": "Houghton Mifflin Harcourt", "publishedDate": "2012", "previewLink": "http://books.google.co.in/books?id=SlNIxp0uSR0C&printsec=frontcover&dq=name:Ubik&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=SlNIxp0uSR0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A dead man sends haunting warnings back from the grave, and Joe Chip must solve these mysteries to determine his own real or surreal existence.", "webReaderLink": "http://play.google.com/books/reader?id=SlNIxp0uSR0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Hitchhiker's Guide to the Galaxy", "categories": ["Fiction"], "authors": ["Douglas Adams"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 3364, "averageRating": 4, "publisher": "Del Rey", "publishedDate": "2007-12-18", "previewLink": "http://books.google.co.in/books?id=j24GMN0OtS8C&dq=name:The+Ultimate+Hitchhiker%27s+Guide+to+the+Galaxy+(Hitchhiker%27s+Guide+to+the+Galaxy,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=j24GMN0OtS8C&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "NEW YORK TIMES BESTSELLER • “Extremely funny . . . inspired lunacy . . . [and] over much too soon.”—The Washington Post Book World Nominated as one of America’s best-loved novels by PBS’s The Great American Read Seconds before Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker’s Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor. Together, this dynamic pair began a journey through space aided by a galaxyful of fellow travelers: Zaphod Beeblebrox—the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian (formerly Tricia McMillan), Zaphod’s girlfriend, whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; and Veet Voojagig, a former graduate student obsessed with the disappearance of all the ballpoint pens he’s bought over the years. Where are these pens? Why are we born? Why do we die? For all the answers, stick your thumb to the stars! Praise for The Hitchhiker’s Guide to the Galaxy “A whimsical oddyssey . . . Characters frolic through the galaxy with infectious joy.”—Publishers Weekly “Irresistable!”—The Boston Globe", "webReaderLink": "http://play.google.com/books/reader?id=j24GMN0OtS8C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Foundation Novels 7-Book Bundle", "categories": ["Fiction"], "authors": ["Isaac Asimov"], "printType": "BOOK", "pageCount": 2680, "ratingsCount": null, "averageRating": null, "publisher": "Spectra", "publishedDate": "2014-08-05", "previewLink": "http://books.google.co.in/books?id=724OBAAAQBAJ&dq=name:Foundation+and+Empire+(Foundation&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=724OBAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The story of our future begins with the Foundation. Named the best series of all time by the Hugo Awards, the Foundation novels of Isaac Asimov unquestionably comprise one of the great masterworks of science fiction, unsurpassed for its unique blend of nonstop action, daring ideas, and extensive world-building. Now, all seven volumes are together for the first time in this essential eBook bundle: FOUNDATION FOUNDATION AND EMPIRE SECOND FOUNDATION FOUNDATION’S EDGE FOUNDATION AND EARTH PRELUDE TO FOUNDATION FORWARD THE FOUNDATION For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying. Only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future—a dark age of ignorance, barbarism, and warfare that will last thirty thousand years. To preserve knowledge and save humanity, Seldon gathers the best minds in the Empire—both scientists and scholars—and brings them to a bleak planet at the edge of the galaxy to serve as a beacon of hope for future generations. He calls this sanctuary the Foundation. But soon the fledgling Foundation finds itself at the mercy of corrupt warlords rising in the wake of the receding Empire. And mankind’s last best hope is faced with an agonizing choice: submit to the barbarians and live as slaves—or take a stand for freedom and risk total destruction. Praise for Isaac Asimov and his Foundation series “A true polymath, a superb rationalist, an exciting and accessible writer in both fiction and nonfiction, Isaac Asimov was simply a master of all he surveyed.”—Greg Bear “Asimov served wondrous meals-of-the-mind to a civilization that was starved for clear thinking about the future. To this day, his visions spice our ongoing dinner-table conversation about human destiny.”—David Brin “Isaac was still in his teens when I met him, a fan of mine before I was a fan of his. Writing for John W. Campbell back in the famous ‘golden age of science fiction,’ he became one of the founders of our field. With the Robot stories and the Foundation stories, he helped to shape science fiction as we know it.”—Jack Williamson “I grew up on the ABC’s of science fiction—Asimov, Bradbury, Clarke. There’s a reason Asimov’s name comes first, and not just because of the alphabet!”—Janis Ian “With his fertile imagination, his wit, and his prolific output, Isaac Asimov truly laid the foundation for all future generations of science fiction writers.”—Kevin J. Anderson “If anything can be said to have been the launch pad for space-age science fiction, it has to be the Foundation trilogy. It’s a classic. And it’s unforgettable.”—Jack McDevitt “The Foundation series is one of the masterpieces of science fiction. If you’ve never read these novels, then you’re in for a treat, and even if you’ve already read them, then you owe it to yourself to reread them, because they’re still great.”—Allen Steele “Quite simply, Asimov got me started.”—Liz Williams", "webReaderLink": "http://play.google.com/books/reader?id=724OBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Hyperion Cantos", "categories": ["Future life"], "authors": ["Dan Simmons"], "printType": "BOOK", "pageCount": 929, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1990", "previewLink": "http://books.google.co.in/books?id=CdFXAAAAYAAJ&q=name:The+Fall+of+Hyperion+(Hyperion+Cantos&dq=name:The+Fall+of+Hyperion+(Hyperion+Cantos&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=CdFXAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Eight centuries from now-- long after the Big Mistake and the death of Old Earth-- humanity is again on the brink of war. Galactic war this time.", "webReaderLink": "http://play.google.com/books/reader?id=CdFXAAAAYAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "That Man on the Road", "categories": ["Short stories, Telugu"], "authors": ["Ranga Rao"], "printType": "BOOK", "pageCount": 244, "ratingsCount": null, "averageRating": null, "publisher": "Penguin Books India", "publishedDate": "2006", "previewLink": "http://books.google.co.in/books?id=ZbJf8cExY6EC&pg=PA60&dq=name:The+Road&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ZbJf8cExY6EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The Second Anthology Of Telugu Short Fiction Edited By Novelist, Short-Story Writer, Translator, Teacher And Critic, Ranga Rao, That Man On The Road Is The Successor To The Critically Acclaimed Classic Telugu Short Stories. Bringing Together Some Of The Most Renowned Exponents Of The Contemporary Telugu Short Story, The Eighteen Stories In This Collection Are Representative Of Experiences That Are At Once Sharply Individual And Undeniably Universal. From The Horrific But Apt View Of Justice Advocated In Cattle Thief To The Delightful Verbal Sparring In Can T Dance? Blame The Percussionist ; From The Disturbing Vision Of Dehumanizing Poverty In Slush To The Hilarious Prospect Of Becoming A Stock-Market Guru In By The Grace Of Our Goddess Of Wealth ; From The Domestic Squabbles Of It Is The Way It Is , To The Futuristic World Of Manava Factor , These Stories Straddle Realms As Diverse As Dalitism, Feminism, Religious Fanaticism, Naxalism, Personal Relationships And Individual Idiosyncrasies. Carefully Chosen And Skilfully Translated, This Anthology Is Part Of The Series Of Contemporary Short Fiction In Translation Published By Penguin.", "webReaderLink": "http://play.google.com/books/reader?id=ZbJf8cExY6EC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Stars My Destination", "categories": ["Fiction"], "authors": ["Alfred Bester"], "printType": "BOOK", "pageCount": 244, "ratingsCount": 2, "averageRating": 3.5, "publisher": "Orion Publishing Group", "publishedDate": "2010", "previewLink": "http://books.google.co.in/books?id=mYKhPwAACAAJ&dq=name:The+Stars+My+Destination&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=mYKhPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "One of the very best must-read SF novels of all time.", "webReaderLink": "http://play.google.com/books/reader?id=mYKhPwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "In the Name of Love: The Stand Man", "categories": ["Religion"], "authors": ["Gerald Tony Edison"], "printType": "BOOK", "pageCount": 80, "ratingsCount": 1, "averageRating": 5, "publisher": "AuthorHouse", "publishedDate": "2012-01-04", "previewLink": "http://books.google.co.in/books?id=4SH0meK9piwC&pg=PA1&dq=name:The+Stand&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=4SH0meK9piwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This book is about, one man's journey through life, it about the hurdles that was set before him, like death, evilness at his heals daily, and how he pressed forward, with humbleness with patience and love, in spite of the fact a hedge, was build around him, and he still went through problems, never going around them. And how he obtain strength in the time of need.", "webReaderLink": "http://play.google.com/books/reader?id=4SH0meK9piwC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Shadows in Flight", "categories": ["Fiction"], "authors": ["Orson Scott Card"], "printType": "BOOK", "pageCount": 240, "ratingsCount": 12, "averageRating": 3, "publisher": "Macmillan", "publishedDate": "2013-01-29", "previewLink": "http://books.google.co.in/books?id=zXVt8kIeEOQC&printsec=frontcover&dq=name:Ender%27s+Shadow+(The+Shadow+Series,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=zXVt8kIeEOQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Ender's Shadow explores the stars in this all-new novel... At the end of Shadow of the Giant, Bean flees to the stars with three of his children--the three who share the engineered genes that gave him both hyper-intelligence and a short, cruel physical life. The time dilation granted by the speed of their travel gives Earth's scientists generations to seek a cure, to no avail. In time, they are forgotten--a fading ansible signal speaking of events lost to Earth's history. But the Delphikis are about to make a discovery that will let them save themselves, and perhaps all of humanity in days to come. For there in space before them lies a derelict Formic colony ship. Aboard it, they will find both death and wonders--the life support that is failing on their own ship, room to grow, and labs in which to explore their own genetic anomaly and the mysterious disease that killed the ship's colony. Shadows in Flight is the fifth novel in Orson Scott Card's Shadow Series. THE ENDER UNIVERSE Ender series Ender’s Game / Speaker for the Dead / Xenocide / Children of the Mind / Ender in Exile / Children of the Fleet Ender’s Shadow series Ender’s Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in Flight The First Formic War (with Aaron Johnston) Earth Unaware / Earth Afire / Earth Awakens The Second Formic War (with Aaron Johnston) The Swarm / The Hive Ender novellas A War of Gifts / First Meetings At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "webReaderLink": "http://play.google.com/books/reader?id=zXVt8kIeEOQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Millennial Masculinity", "categories": ["Art"], "authors": ["Timothy Shary"], "printType": "BOOK", "pageCount": 384, "ratingsCount": null, "averageRating": null, "publisher": "Wayne State University Press", "publishedDate": "2012-12-17", "previewLink": "http://books.google.co.in/books?id=TLnDAgAAQBAJ&pg=PA244&dq=name:I+Am+Legend&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=TLnDAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In virtually every aspect of culture-health, marriage, family, morals, politics, sex, race, economics-American men of the past two decades have faced changing social conditions and confronted radical questions about themselves. In Millennial Masculinity: Men in Contemporary American Cinema, editor Timothy Shary collects fourteen contributions that consider male representation in films made at the turn of the century to explore precisely how those questions have been dealt with in cinema. Contributors move beyond the recent wave of \"masculinity in crisis\" arguments to provide sophisticated and often surprising insight into accessible films. Chapters are arranged in four sections: \"Performing Masculinity\" includes a discussion of Adam Sandler and movies such as Milk; \"Patriarchal Problems\" looks at issues of fathers from directors such as Martin Scorsese, Wes Anderson, and David Fincher; \"Exceptional Sexualities\" examines male love and sex through movies like Brokeback Mountain and Wedding Crashers; and \"Facing Race\" explores masculinity through race in film. Sean Penn, Jackie Chan, Brad Pitt, Will Smith, and Philip Seymour Hoffman are some of the actors included in these analyses, while themes considered include police thrillers, psychotic killers, gay tensions, fashion sense, and the burgeoning \"bromance\" genre. Taken together, the essays in Millennial Masculinity shed light on the high stakes of masculine roles in contemporary American cinema. Film and television scholars as well as readers interested in gender and sexuality in film will appreciate this timely collection.", "webReaderLink": "http://play.google.com/books/reader?id=TLnDAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Foundation", "categories": ["Religion"], "authors": ["D. G. Leahy"], "printType": "BOOK", "pageCount": 696, "ratingsCount": null, "averageRating": null, "publisher": "SUNY Press", "publishedDate": "1996-01-01", "previewLink": "http://books.google.co.in/books?id=rDzOFxs4ZlYC&printsec=frontcover&dq=name:Second+Foundation+(Foundation&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=rDzOFxs4ZlYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This book presents the ontological and logical foundation of a new form of thinking, the beginning of an \u0093absolute phenomenology.\u0094 It does so in the context of the history of thought in Europe and America. It explores the ramifications of a categorically new logic. Thinkers dealt with include Plato, Galileo, Hegel, Kierkegaard, Marx, Nietzsche, Husserl, Heidegger, Peirce, James, Dewey, Derrida, McDermott, and Altizer.", "webReaderLink": "http://play.google.com/books/reader?id=rDzOFxs4ZlYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Man in the High Castle", "categories": ["Fiction"], "authors": ["Philip K. Dick"], "printType": "BOOK", "pageCount": 272, "ratingsCount": 150, "averageRating": 3.5, "publisher": "Houghton Mifflin Harcourt", "publishedDate": "2012-01-24", "previewLink": "http://books.google.co.in/books?id=5aBwki0xmZEC&printsec=frontcover&dq=name:The+Man+in+the+High+Castle&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=5aBwki0xmZEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "“The single most resonant and carefully imagined book of Dick’s career.” —New York Times It’s America in 1962. Slavery is legal once again. The few Jews who still survive hide under assumed names. In San Francisco, the I Ching is as common as the Yellow Pages. All because some twenty years earlier the United States lost a war—and is now occupied by Nazi Germany and Japan. This harrowing, Hugo Award–winning novel is the work that established Philip K. Dick as an innovator in science fiction while breaking the barrier between science fiction and the serious novel of ideas. In it Dick offers a haunting vision of history as a nightmare from which it may just be possible to wake. Winner of the Hugo Award", "webReaderLink": "http://play.google.com/books/reader?id=5aBwki0xmZEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Mote in God's Eye", "categories": ["Fiction"], "authors": ["Larry Niven", "Jerry Pournelle"], "printType": "BOOK", "pageCount": 592, "ratingsCount": 29, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "1991-03-01", "previewLink": "http://books.google.co.in/books?id=lKt5laoj1coC&printsec=frontcover&dq=name:The+Mote+in+God%27s+Eye+(Moties,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=lKt5laoj1coC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The accidental killing of a group of emissaries to Earth threatens man's survival", "webReaderLink": "http://play.google.com/books/reader?id=lKt5laoj1coC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Cat's Cradle", "categories": ["Fiction"], "authors": ["Christine Rimmer"], "printType": "BOOK", "pageCount": 187, "ratingsCount": null, "averageRating": null, "publisher": "Harlequin", "publishedDate": "2012-07-16", "previewLink": "http://books.google.co.in/books?id=iHJLUB0DTlcC&pg=PT87&dq=name:Cat%27s+Cradle&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=iHJLUB0DTlcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Cat Beaudine Was Nobody's Baby And that's the way she liked it. She could take care of herself—and she knew that marriage and motherhood were for other women, not her. Until the stranger with the familiar face had her wondering if being alone was all it was cracked up to be…. Dillon McKenna Wanted a Family For the professional daredevil, living on the edge had lost its appeal. He knew Cat was the woman for him. Now all he had to do was convince her of that—with the help of the unexpected bundle of joy in the back of his van….", "webReaderLink": "http://play.google.com/books/reader?id=iHJLUB0DTlcC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Naked Sun", "categories": ["Fiction"], "authors": ["Isaac Asimov"], "printType": "BOOK", "pageCount": 288, "ratingsCount": 35, "averageRating": 4, "publisher": "Spectra", "publishedDate": "2011-04-13", "previewLink": "http://books.google.co.in/books?id=7pdVUgBL6Z4C&printsec=frontcover&dq=name:The+Caves+of+Steel+(Robot&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=7pdVUgBL6Z4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A millennium into the future, two advancements have altered the course of human history: the colonization of the Galaxy and the creation of the positronic brain. On the beautiful Outer World planet of Solaria, a handful of human colonists lead a hermit-like existence, their every need attended to by their faithful robot servants. To this strange and provocative planet comes Detective Elijah Baley, sent from the streets of New York with his positronic partner, the robot R. Daneel Olivaw, to solve an incredible murder that has rocked Solaria to its foundations. The victim had been so reclusive that he appeared to his associates only through holographic projection. Yet someone had gotten close enough to bludgeon him to death while robots looked on. Now Baley and Olivaw are faced with two clear impossibilities: Either the Solarian was killed by one of his robots--unthinkable under the laws of Robotics--or he was killed by the woman who loved him so much that she never came into his presence!", "webReaderLink": "http://play.google.com/books/reader?id=7pdVUgBL6Z4C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Restaurant at the End of the Universe", "categories": ["Fiction"], "authors": ["Douglas Adams"], "printType": "BOOK", "pageCount": 224, "ratingsCount": 2899, "averageRating": 3.5, "publisher": "Pan Macmillan", "publishedDate": "2009-09-01", "previewLink": "http://books.google.co.in/books?id=YKHJ6WQKD3YC&printsec=frontcover&dq=name:The+Restaurant+at+the+End+of+the+Universe+(Hitchhiker%27s+Guide+to+the+Galaxy,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=YKHJ6WQKD3YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Following the smash-hit sci-fi comedy The Hitchhiker's Guide to the Galaxy, The Restaurant at the End of the Universe is the second part in Douglas Adams' multi-media phenomenon and cult classic series. This edition includes exclusive bonus material from the Douglas Adams archives, and an introduction by Monty Python star, Terry Jones. If you've done six impossible things this morning, why not round it off with breakfast at Milliways, the Restaurant at the end of the Universe? Which is exactly what Arthur Dent and the crew of the Heart of Gold plan to do. There's just the small matter of escaping the Vogons, avoiding being taken to the most totally evil world in the Galaxy and teaching a space ship how to make a proper cup of tea. And did anyone actually make a reservation? Follow Arthur Dent's galactic (mis)adventures in the rest of the trilogy with five parts: Life, the Universe and Everything, So Long, and Thanks for All the Fish, and Mostly Harmless.", "webReaderLink": "http://play.google.com/books/reader?id=YKHJ6WQKD3YC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Blue Mars", "categories": ["Fiction"], "authors": ["Kim Stanley Robinson"], "printType": "BOOK", "pageCount": 800, "ratingsCount": 16, "averageRating": 4, "publisher": "HarperCollins UK", "publishedDate": "2013-04-11", "previewLink": "http://books.google.co.in/books?id=hp-Rs1GEjfYC&printsec=frontcover&dq=name:Red+Mars+(Mars+Trilogy,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=hp-Rs1GEjfYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The final novel in the worldwide bestselling Mars trilogy, now part of the Voyager Classics collection.", "webReaderLink": "http://play.google.com/books/reader?id=hp-Rs1GEjfYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "World War Z", "categories": ["Fiction"], "authors": ["Max Brooks"], "printType": "BOOK", "pageCount": 342, "ratingsCount": 3832, "averageRating": 3.5, "publisher": "Broadway Books", "publishedDate": "2006", "previewLink": "http://books.google.co.in/books?id=5MBCDlb9jDkC&dq=name:World+War+Z:+An+Oral+History+of+the+Zombie+War&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=5MBCDlb9jDkC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "An account of the decade-long conflict between humankind and hordes of the predatory undead is told from the perspective of dozens of survivors who describe in their own words the epic human battle for survival.", "webReaderLink": "http://play.google.com/books/reader?id=5MBCDlb9jDkC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Giver", "categories": ["Juvenile Fiction"], "authors": ["Lois Lowry"], "printType": "BOOK", "pageCount": 180, "ratingsCount": 3933, "averageRating": 4, "publisher": "Laurel Leaf", "publishedDate": "1994-04-01", "previewLink": "http://books.google.co.in/books?id=CrCIPwAACAAJ&dq=name:The+Giver+(The+Giver,&hl=&cd=1&source=gbs_api", "language": "en", "description": "It's a perfect world, where everything looks right. But ugly truths lie beneath... Imagine a world without poverty, war or pain. A world where everything is comfortable and familiar - a world where everything is the same. No colour, no music. In such a world, Jonas is selected to be the next Receiver of Memory and is apprenticed to the Giver, an old man who stores memories from the Community's past. As Jonas learns about violence and sadness, as well as beauty and joy, he discover the sinister truth behind his safe existence. Simply and beautifully written, The Giver is a thought-provoking look at utopian society. It was awarded the Newbery Medal in 1994.", "webReaderLink": "http://play.google.com/books/reader?id=CrCIPwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Diamond Age", "categories": ["Fiction"], "authors": ["Neal Stephenson"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 99, "averageRating": 3.5, "publisher": "Penguin UK", "publishedDate": "1998-08-27", "previewLink": "http://books.google.co.in/books?id=pfDXB9kvbZYC&pg=PT225&dq=name:The+Diamond+Age:+Or,+A+Young+Lady%27s+Illustrated+Primer&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=pfDXB9kvbZYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Cult author Neal Stephenson's unstoppable sci-fi classic The future is small. The future is nano . . . And who could be smaller or more insignificant than poor Little Nell - an orphan girl alone and adrift in a world of Confucian Law, Neo-Victorian values and warring nano-technology? Well, not quite alone. Because Nell has a friend, of sorts. A guide, a teacher, an armed and unarmed combat instructor, a book and a computer: the Young Lady's Illustrated Primer is all these and much much more. It is illicit, magical, dangerous. And it isn't Nell's. It was stolen. And now some very powerful people want to get their hands on this highly desirable object. Nell is about to discover that the world can feel very small indeed . . . Neal Stephenson is the author of the three-volume historical epic 'The Baroque Cycle' (Quicksilver, The Confusion and The System of the World) as well as the novels Cryptonomicon, The Diamond Age (winner of a Hugo Award), Snow Crash, Zodiac, Anathem and Reamde. He lives in Seattle, Washington.", "webReaderLink": "http://play.google.com/books/reader?id=pfDXB9kvbZYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Strange Case of Dr. Jekyll and Mr. Hyde and Other Stories", "categories": ["Fiction"], "authors": ["Robert Louis Stevenson"], "printType": "BOOK", "pageCount": 256, "ratingsCount": 6, "averageRating": 3.5, "publisher": "Knickerbocker Classics", "publishedDate": "2016-10", "previewLink": "http://books.google.co.in/books?id=WdksDQAAQBAJ&pg=PA218&dq=name:The+Strange+Case+of+Dr.+Jekyll+and+Mr.+Hyde&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=WdksDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Discover the mesmerizing tale of two personalities in a war over the soul of one man. The Strange Case of Dr. Jekyll and Mr. Hyde is a tale of Victorian horror. The personalities of the pleasant Dr. Jekyll and the violent Mr. Hyde vie for control over a single body. This gothic horror novel is presented alongside five short stories by author Robert Louis Stevenson, including \"A Lodging for the Night\" and \"The Isle of Voices.\" This elegantly designed clothbound edition features an elastic closure and a new introduction by Allen Grove. The Knickerbocker Classics bring together the essential works of classic authors from around the world in stunning editions to be collected and enjoyed.", "webReaderLink": "http://play.google.com/books/reader?id=WdksDQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Zones of Thought Series", "categories": ["Fiction"], "authors": ["Vernor Vinge"], "printType": "BOOK", "pageCount": 1680, "ratingsCount": null, "averageRating": null, "publisher": "Macmillan", "publishedDate": "2017-06-13", "previewLink": "http://books.google.co.in/books?id=V_6WDgAAQBAJ&dq=name:A+Fire+Upon+the+Deep+(Zones+of+Thought,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=V_6WDgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "This discounted ebundle includes: A Fire Upon the Deep, The Children of the Sky, A Deepness in the Sky “Vinge is one of the best visionary writers of SF today.” —David Brin Thousands of years in the future, humanity is no longer alone in a universe where a mind's potential is determined by its location in space, from superintelligent entities in the Transcend, to the limited minds of the Unthinking Depths, where only simple creatures, and technology, can function. Nobody knows what strange force partitioned space into these \"regions of thought,\" but when the warring Straumli realm use an ancient Transcendent artifact as a weapon, they unwittingly unleash an awesome power that destroys thousands of worlds and enslaves all natural and artificial intelligence. A Fire Upon The Deep — Fleeing a galactic threat, Ravna crash lands on a strange world with a ship hold full of cryogenically frozen children, the only survivors. They are taken captive by the Tines, an alien race with a harsh medieval culture, and used as pawns in a ruthless power struggle. The Children of the Sky — Ten years have passed on Tines World, and Ravna and the children have survived a war. While there is peace among the Tines, there are those among them—and among the humans—who seek power...and no matter the cost, these malcontents are determined to overturn the fledgling civilization that has taken root since the humans landed. A Deepness in the Sky — Thirty-thousand years before A Fire Upon the Deep, two human groups, the Qeng Ho, a culture of free traders, and the Emergents, a ruthless society based on the technological enslavement of minds, stand on the verge of first contact with an alien race. Other Books by Vernor Vinge Realtime/Bobble Series The Peace War Marooned in Realtime Other Novels The Witling Tatja Grimm's World Rainbows End Collections Collected Stories of Vernor Vinge True Names At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "webReaderLink": "http://play.google.com/books/reader?id=V_6WDgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Never Let Me Go", "categories": ["Fiction"], "authors": ["Kazuo Ishiguro"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 463, "averageRating": 3.5, "publisher": "Faber & Faber", "publishedDate": "2009-01-08", "previewLink": "http://books.google.co.in/books?id=JAzxznMKiq4C&printsec=frontcover&dq=name:Never+Let+Me+Go&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=JAzxznMKiq4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "*Kazuo Ishiguro's new novel Klara and the Sun is now available to preorder* One of the most acclaimed novels of the 21st Century, from the Nobel Prize-winning author Shortlisted for the Man Booker Prize Kazuo Ishiguro imagines the lives of a group of students growing up in a darkly skewed version of contemporary England. Narrated by Kathy, now thirty-one, Never Let Me Go dramatises her attempts to come to terms with her childhood at the seemingly idyllic Hailsham School and with the fate that has always awaited her and her closest friends in the wider world. A story of love, friendship and memory, Never Let Me Go is charged throughout with a sense of the fragility of life. 'Exquisite.' Guardian 'A feat of imaginative sympathy.' New York Times What readers are saying: 'A book I will return to again and again, and one that keeps me thinking even after finishing it. 5/5 stars' 'I loved it, every single word of it.' 'It took me wholly by surprise.' 'Utterly beautiful.' 'Essentially perfect.'", "webReaderLink": "http://play.google.com/books/reader?id=JAzxznMKiq4C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Leviathan Wakes", "categories": ["Fiction"], "authors": ["James S. A. Corey"], "printType": "BOOK", "pageCount": 448, "ratingsCount": 115, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2011-06-02", "previewLink": "http://books.google.co.in/books?id=-iB-1sc02DgC&printsec=frontcover&dq=name:Leviathan+Wakes+(The+Expanse,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=-iB-1sc02DgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "NOW A PRIME ORIGINAL SERIES 'The science fictional equivalent of A Song of Ice and Fire' NPR Books Leviathan Wakes is the Hugo-nominated first book in the New York Times bestselling Expanse series. Humanity has colonised the solar system - Mars, the Moon, the Asteroid Belt and beyond - but the stars are still out of our reach. Jim Holden is an officer on an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew discover a derelict ship called the Scopuli, they suddenly find themselves in possession of a deadly secret. A secret that someone is willing to kill for, and on an unimaginable scale. War is coming to the system, unless Jim can find out who abandoned the ship and why. Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money - and money talks. When the trail leads him to the Scopuli and Holden, they both realise this girl may hold the key to everything. Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries and secret corporations, and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe. The Expanse series has sold over two million copies worldwide and is now a major television series. The Expanse series: Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath Praise for the Expanse: 'As close as you'll get to a Hollywood blockbuster in book form' io9.com 'Great characters, excellent dialogue, memorable fights' wired.com 'High adventure equalling the best space opera has to offer, cutting-edge technology and a group of unforgettable characters . . . Perhaps one of the best tales the genre has yet to produce' Library Journal 'This is the future the way it's supposed to be' Wall Street Journal 'Tense and thrilling' SciFiNow", "webReaderLink": "http://play.google.com/books/reader?id=-iB-1sc02DgC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Illustrated Man", "categories": ["Science fiction, American"], "authors": ["Ray Bradbury"], "printType": "BOOK", "pageCount": 186, "ratingsCount": null, "averageRating": null, "publisher": null, "publishedDate": "1978", "previewLink": "http://books.google.co.in/books?id=k-zyAAAAMAAJ&q=name:The+Illustrated+Man&dq=name:The+Illustrated+Man&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=k-zyAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Eighteen science fiction stories deal with love, madness, and death on Mars, Venus, and in space.", "webReaderLink": "http://play.google.com/books/reader?id=k-zyAAAAMAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Wool", "categories": ["Fiction"], "authors": ["Hugh Howey"], "printType": "BOOK", "pageCount": 508, "ratingsCount": 246, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2013-03-12", "previewLink": "http://books.google.co.in/books?id=oCpYuc1dfPAC&printsec=frontcover&dq=name:Wool+Omnibus+(Silo,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=oCpYuc1dfPAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In a future toxic landscape, a community that lives in an underground silo is rocked by the desire of Sheriff Holston, who has upheld the group's rules for years, to go outside, setting in motion events that kindle the fire of revolution.", "webReaderLink": "http://play.google.com/books/reader?id=oCpYuc1dfPAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Extraordinary Journeys", "categories": ["Fiction"], "authors": ["Jules Verne", "William Butcher"], "printType": "BOOK", "pageCount": 402, "ratingsCount": 2, "averageRating": 4, "publisher": "Oxford University Press, USA", "publishedDate": "2005", "previewLink": "http://books.google.co.in/books?id=RKBQ_4qiegQC&printsec=frontcover&dq=name:Journey+to+the+Center+of+the+Earth+(Extraordinary+Voyages,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RKBQ_4qiegQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'If ever a human foot is to tread the Pole, it must be a British one!'First Mate Shandon receives a mysterious letter asking him to construct a reinforced steamship in Liverpool. As he heads out for Melville Bay and the Arctic labyrinth, a crewman reveals himself to be John Hatteras, and his lifelong obsession, the Pole. Despite experiencing appalling cold andhunger, the captain treks across the frozen wastes in search of fuel. Abandoned by his crew, Hatteras remains without resources at the coldest spot on earth. How can he find food and explore the Polar Sea? And what will he find at the top of the world? This new translation by the father of Verne Studies brilliantly conveys the hypnotic mood and gripping authenticity of Verne's second novel. This edition also includes the original, censored ending, previously unpublished chapters, and evidence of Verne's plagiarism.", "webReaderLink": "http://play.google.com/books/reader?id=RKBQ_4qiegQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Gateway", "categories": ["Hugo Award"], "authors": ["Frederik Pohl"], "printType": "BOOK", "pageCount": 313, "ratingsCount": 36, "averageRating": 3.5, "publisher": null, "publishedDate": "1977", "previewLink": "http://books.google.co.in/books?id=q1AgAQAAIAAJ&pg=PP1&dq=name:Gateway+(Heechee+Saga,&hl=&cd=1&source=gbs_api", "language": "en", "description": "Gateway opened on all the wealth of the Universe...and on reaches of unimaginable horror. When prospector Bob Broadhead went out to Gateway on the Heechee spacecraft, he decided he would know which was the right mission to make him his fortune. Three missions later, now famous and permanently rich, Robinette Broadhead has to face what happened to him and what he is...in a journey into himself as perilous and even more horrifying than the nightmare trip through the interstellar void that he drove himself to take!THE HEECHEE SAGABook One: GATEWAYBook Two: BEYOND THE BLUE EVENT HORIZONBook Three: HEECHEE RENDEZVOUSBook Four: THE ANNALS OF THE HEECHEE \"From the Paperback edition.\"", "webReaderLink": "http://play.google.com/books/reader?id=q1AgAQAAIAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Player of Games", "categories": ["Fiction"], "authors": ["Iain M. Banks"], "printType": "BOOK", "pageCount": 300, "ratingsCount": 68, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2009-12-01", "previewLink": "http://books.google.co.in/books?id=4TtHAQAAQBAJ&dq=name:The+Player+of+Games+(Culture,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=4TtHAQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The Culture - a human/machine symbiotic society - has thrown up many great Game Players, and one of the greatest is Gurgeh. Jernau Morat Gurgeh. The Player of Games. Master of every board, computer and strategy. Bored with success, Gurgeh travels to the Empire of Azad, cruel and incredibly wealthy, to try their fabulous game...a game so complex, so like life itself, that the winner becomes emperor. Mocked, blackmailed, almost murdered, Gurgeh accepts the game, and with it the challenge of his life - and very possibly his death. Praise for Iain M. Banks: \"Poetic, humorous, baffling, terrifying, sexy -- the books of Iain M. Banks are all these things and more\" -- NME \"An exquisitely riotous tour de force of the imagination which writes its own rules simply for the pleasure of breaking them.\" -- Time Out", "webReaderLink": "http://play.google.com/books/reader?id=4TtHAQAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Gods Themselves", "categories": ["Fiction"], "authors": ["Isaac Asimov"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 56, "averageRating": 3.5, "publisher": "Spectra", "publishedDate": "2011-05-04", "previewLink": "http://books.google.co.in/books?id=zZr1VZNlOUYC&pg=PA31&dq=name:The+Gods+Themselves&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=zZr1VZNlOUYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Only a few know the terrifying truth--an outcast Earth scientist, a rebellious alien inhabitant of a dying planet, a lunar-born human intuitionist who senses the imminent annihilation of the Sun. They know the truth--but who will listen? They have foreseen the cost of abundant energy--but who will believe? These few beings, human and alien, hold the key to the Earth's survival.", "webReaderLink": "http://play.google.com/books/reader?id=zZr1VZNlOUYC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Anathem", "categories": ["Fiction"], "authors": ["Neal Stephenson"], "printType": "BOOK", "pageCount": 300, "ratingsCount": 127, "averageRating": 4, "publisher": "Atlantic Books Ltd", "publishedDate": "2010-08-01", "previewLink": "http://books.google.co.in/books?id=amDTAdDGW74C&printsec=frontcover&dq=name:Anathem&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=amDTAdDGW74C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The latest magnificent creation from the award-winning author of Cryptonomicon and the Baroque Cycle trilogy. Erasmas, 'Raz', is a young avout living in the Concent, a sanctuary for mathematicians, scientists, and philosophers. Three times during history's darkest epochs, violence has invaded and devastated the cloistered community. Yet the avout have always managed to adapt in the wake of catastrophe. But they now prepare to open the Concent's gates to the outside world, in celebration of a once-a-decade rite. Suddenly, Erasmas finds himself a major player in a drama that will determine the future of his world - as he sets out on an extraordinary odyssey that will carry him to the most dangerous, inhospitable corners of the planet...and beyond.", "webReaderLink": "http://play.google.com/books/reader?id=amDTAdDGW74C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Revelation Space", "categories": ["Fiction"], "authors": ["Alastair Reynolds"], "printType": "BOOK", "pageCount": 576, "ratingsCount": 60, "averageRating": 3.5, "publisher": "Hachette UK", "publishedDate": "2009-12-10", "previewLink": "http://books.google.co.in/books?id=sQFhTYF6pDcC&printsec=frontcover&dq=name:Revelation+Space+(Revelation+Space,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=sQFhTYF6pDcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Nine hundred thousand years ago, something wiped out the Amarantin. For the human colonists now settling the Amarantin homeworld Resurgam, it's of little more than academic interest, even after the discovery of a long-hidden, almost perfect Amarantin city and a colossal statue of a winged Amarantin. For brilliant but ruthless scientist Dan Sylveste, it's more than merelty intellectual curiosity - and he will stop at nothing to get at the truth. Even if the truth costs him everything. But the Amarantin were wiped out for a reason, and that danger is closer and greater than even Syveste imagines ... REVELATION SPACE: a huge, magnificent space opera that ranges across the known and unknown universe ... towards the most terrifying of destinations.", "webReaderLink": "http://play.google.com/books/reader?id=sQFhTYF6pDcC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Altered Carbon", "categories": ["Fiction"], "authors": ["Richard K. Morgan"], "printType": "BOOK", "pageCount": 422, "ratingsCount": 91, "averageRating": 4, "publisher": "Subterranean", "publishedDate": "2008-03-01", "previewLink": "http://books.google.co.in/books?id=GIlAPgAACAAJ&dq=name:Altered+Carbon+(Takeshi+Kovacs,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=GIlAPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A stunning debut sci-fi/noir thriller reminiscent of Blade Runner--and the beginning of a new series featuring a one-of-a-kind anti-hero: ex-UN envoy Takashi Kovaks.", "webReaderLink": "http://play.google.com/books/reader?id=GIlAPgAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Andromeda Strain", "categories": ["Fiction"], "authors": ["Michael Crichton"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 79, "averageRating": 3.5, "publisher": "Vintage", "publishedDate": "2012-05-14", "previewLink": "http://books.google.co.in/books?id=kbZxbyksU84C&printsec=frontcover&dq=name:The+Andromeda+Strain+(Andromeda,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=kbZxbyksU84C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "From the author of Jurassic Park, Timeline, and Sphere comes a captivating thriller about a deadly extraterrestrial microorganism, which threatens to annihilate human life. Five prominent biophysicists have warned the United States government that sterilization procedures for returning space probes may be inadequate to guarantee uncontaminated re-entry to the atmosphere. Two years later, a probe satellite falls to the earth and lands in a desolate region of northeastern Arizona. Nearby, in the town of Piedmont, bodies lie heaped and flung across the ground, faces locked in frozen surprise. What could cause such shock and fear? The terror has begun, and there is no telling where it will end.", "webReaderLink": "http://play.google.com/books/reader?id=kbZxbyksU84C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Doomsday Book", "categories": ["Fiction"], "authors": ["Connie Willis"], "printType": "BOOK", "pageCount": 576, "ratingsCount": 193, "averageRating": 3.5, "publisher": "Hachette UK", "publishedDate": "2012-11-08", "previewLink": "http://books.google.co.in/books?id=7fIFr7ao5zEC&printsec=frontcover&dq=name:Doomsday+Book+(Oxford+Time+Travel,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=7fIFr7ao5zEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "For Kivrin Engle, preparing an on-site study of one of the deadliest eras in humanity's history was as simple as receiving inoculations against the diseases of the fourteenth century and inventing an alibi for a woman traveling alone. For her instructors in the twenty-first century, it meant painstaking calculations and careful monitoring of the rendezvous location where Kivrin would be received. But a crisis strangely linking past and future strands Kivrin in a bygone age as her fellows try desperately to rescue her. In a time of superstition and fear, Kivrin - barely of age herself - finds she has become an unlikely angel of hope during one of history's darkest hours. Winner of the Hugo Award 1993 Winner of the Nebula Award 1993 \"A tour de force\" - New York Times Book Review \"Ambitious, finely detailed and compulsivly readable\" - Locus \"It is a book that feels fundamentally true; it is a book to live in\" - Washington Post", "webReaderLink": "http://play.google.com/books/reader?id=7fIFr7ao5zEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Day of the Triffids", "categories": ["Fiction"], "authors": ["John Wyndham"], "printType": "BOOK", "pageCount": 256, "ratingsCount": 5, "averageRating": 3.5, "publisher": "Rosetta Books", "publishedDate": "2010-07-01", "previewLink": "http://books.google.co.in/books?id=ENBdLFJ3f6wC&pg=PA85&dq=name:The+Day+of+the+Triffids&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ENBdLFJ3f6wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The classic postapocalyptic thriller with “all the reality of a vividly realized nightmare” (The Times, London). Triffids are odd, interesting little plants that grow in everyone’s garden. Triffids are no more than mere curiosities—until an event occurs that alters human life forever. What seems to be a spectacular meteor shower turns into a bizarre, green inferno that blinds everyone and renders humankind helpless. What follows is even stranger: spores from the inferno cause the triffids to suddenly take on a life of their own. They become large, crawling vegetation, with the ability to uproot and roam about the country, attacking humans and inflicting pain and agony. William Masen somehow managed to escape being blinded in the inferno, and now after leaving the hospital, he is one of the few survivors who can see. And he may be the only one who can save his species from chaos and eventual extinction . . . With more than a million copies sold, The Day of the Triffids is a landmark of speculative fiction, and “an outstanding and entertaining novel” (Library Journal). “A thoroughly English apocalypse, it rivals H. G. Wells in conveying how the everyday invaded by the alien would feel. No wonder Stephen King admires Wyndham so much.” —Ramsey Campbell “One of my all-time favorite novels. It’s absolutely convincing, full of little telling details, and that sweet, warm sensation of horror and mystery.” —Joe R. Lansdale", "webReaderLink": "http://play.google.com/books/reader?id=ENBdLFJ3f6wC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Lathe Of Heaven", "categories": ["Fiction"], "authors": ["Ursula K. Le Guin"], "printType": "BOOK", "pageCount": 192, "ratingsCount": 65, "averageRating": 4, "publisher": "Simon and Schuster", "publishedDate": "2008-04-15", "previewLink": "http://books.google.co.in/books?id=sZZ7xHC3-JIC&printsec=frontcover&dq=name:The+Lathe+of+Heaven&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=sZZ7xHC3-JIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "George Orr discovers that his dreams possess the remarkable ability to change the world, and when he falls into the hands of a power-mad psychiatrist, he counters by dreaming up a perfect world that can overcome his nightmares, in a new edition of the classic science fiction novel. Reprint. 20,000 first printing.", "webReaderLink": "http://play.google.com/books/reader?id=sZZ7xHC3-JIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Scanner Darkly", "categories": ["Detective and mystery stories"], "authors": ["Philip K. Dick"], "printType": "BOOK", "pageCount": 217, "ratingsCount": 63, "averageRating": 3.5, "publisher": null, "publishedDate": "2006", "previewLink": "http://books.google.co.in/books?id=SDkDHAAACAAJ&dq=name:A+Scanner+Darkly&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=SDkDHAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Substance D -- otherwise known as Death -- is the most dangerous drug ever to find its way on to the black market. It destroys the links between the brain's two hemispheres, leading first to disorentation and then to complete and irreversible brain damage. Bob Arctor, undercover narcotics agent, is trying to find a lead to the source of supply, but to pass as an addict he must become a user, and soon, without knowing what is happening to him, he is as dependent as any of the addicts he is monitoring.", "webReaderLink": "http://play.google.com/books/reader?id=SDkDHAAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Twenty Thousand Leagues Under the Sea", "categories": ["Submarines (Ships)"], "authors": ["Jules Verne"], "printType": "BOOK", "pageCount": 349, "ratingsCount": 18, "averageRating": 4, "publisher": null, "publishedDate": "1887", "previewLink": "http://books.google.co.in/books?id=470XAAAAYAAJ&printsec=frontcover&dq=name:Twenty+Thousand+Leagues+Under+the+Sea+(Extraordinary+Voyages,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=470XAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": null, "webReaderLink": "http://play.google.com/books/reader?id=470XAAAAYAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The End of Time and the Beginning of Eternity", "categories": ["Religion"], "authors": ["C. G. Deveaux"], "printType": "BOOK", "pageCount": 126, "ratingsCount": null, "averageRating": null, "publisher": "WestBowPress", "publishedDate": "2013-11-01", "previewLink": "http://books.google.co.in/books?id=PcMIAgAAQBAJ&pg=PA33&dq=name:The+End+of+Eternity&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=PcMIAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The End of Time and the Beginning of Eternity represents the culmination of lifelong experiences and many years of research by author C. G. Deveaux. Driven by the passion to know the truth, He has researched the secret and the unknown. What he has found is exhilarating and shocking. This study explores the meaning of life and considers the end times in which we are now living. It also offers a warning of coming destruction to the world as we know it—and that hell is real. The good news is that with Jesus as our Lord and Savior, we can be forgiven. Because of Jesus, we can live with the Father, Son, and Holy Spirit for eternity. Beginning with the author’s personal experiences, The End of Time and the Beginning of Eternity provides a well-balanced approach to the supernatural, followed by facts and evidence of the coming end times. The author provides advice on how to prepare and thrive when many will be lost, destitute, and afraid. To insure the proper context, he augments all of the facts with Holy Scripture. Most of all, this study proves that we are in the end times and explains how we can be victorious in the face of these events.", "webReaderLink": "http://play.google.com/books/reader?id=PcMIAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Sparrow", "categories": ["Fiction"], "authors": ["Mary Doria Russell"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 242, "averageRating": 4, "publisher": "Random House", "publishedDate": "2010-02-23", "previewLink": "http://books.google.co.in/books?id=nvxKIlcLRXEC&printsec=frontcover&dq=name:The+Sparrow+(The+Sparrow,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=nvxKIlcLRXEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'The Sparrow is one of my favourite science fiction novels and it destroyed me in the best way when I read it. It is so beautifully written and the construction of the narrative is masterful.' Emma Newman, acclaimed author of Planetfall Set in the 21st century - a number of decades from now - The Sparrow is the story of a charismatic Jesuit priest and talented linguist, Emilio Sandoz, who - in response to a remarkable radio signal from the depths of space - leads a scientific mission to make first contact with an extraterrestrial culture. In the true tradition of Jesuit adventurers before him, Sandoz and his companions are prepared to endure isolation, suffering - even death - but nothing can prepare them for the civilisation they encounter. Or for the tragic misunderstanding that brings the mission to a devastating end. Once considered a living saint, Sandoz returns alone to Earth horrifically maimed, both physically and spiritually, the mission's sole survivor - only to be blamed for the mission's failure and accused of heinous crimes. Written in clean, effortless prose and peopled with memorable characters who never lose their humanity or humour, The Sparrow is a powerful, haunting fiction - a tragic but ultimately triumphant novel about the nature of faith, of love and what it means to be 'human' and widely considered to be a classic of the genre.", "webReaderLink": "http://play.google.com/books/reader?id=nvxKIlcLRXEC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Use of Weapons", "categories": ["Fiction"], "authors": ["Iain M. Banks"], "printType": "BOOK", "pageCount": 512, "ratingsCount": 54, "averageRating": 4, "publisher": "Orbit", "publishedDate": "2008-12-22", "previewLink": "http://books.google.co.in/books?id=IqCdnDe9ZOQC&dq=name:Use+of+Weapons+(Culture&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=IqCdnDe9ZOQC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The man known as Cheradenine Zakalwe was one of Special Circumstances' foremost agents, changing the destiny of planets to suit the Culture through intrigue, dirty tricks and military action. The woman known as Diziet Sma had plucked him from obscurity and pushed him towards his present eminence, but despite all their dealings she did not know him as well as she thought. The drone known as Skaffen-Amtiskaw knew both of these people. It had once saved the woman's life by massacring her attackers in a particularly bloody manner. It believed the man to be a lost cause. But not even its machine could see the horrors in his past. Ferociously intelligent, both witty and horrific, USE OF WEAPONS is a masterpiece of science fiction.", "webReaderLink": "http://play.google.com/books/reader?id=IqCdnDe9ZOQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Foundation Novels 7-Book Bundle", "categories": ["Fiction"], "authors": ["Isaac Asimov"], "printType": "BOOK", "pageCount": 2680, "ratingsCount": null, "averageRating": null, "publisher": "Spectra", "publishedDate": "2014-08-05", "previewLink": "http://books.google.co.in/books?id=724OBAAAQBAJ&dq=name:Foundation%27s+Edge+(Foundation&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=724OBAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "The story of our future begins with the Foundation. Named the best series of all time by the Hugo Awards, the Foundation novels of Isaac Asimov unquestionably comprise one of the great masterworks of science fiction, unsurpassed for its unique blend of nonstop action, daring ideas, and extensive world-building. Now, all seven volumes are together for the first time in this essential eBook bundle: FOUNDATION FOUNDATION AND EMPIRE SECOND FOUNDATION FOUNDATION’S EDGE FOUNDATION AND EARTH PRELUDE TO FOUNDATION FORWARD THE FOUNDATION For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying. Only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future—a dark age of ignorance, barbarism, and warfare that will last thirty thousand years. To preserve knowledge and save humanity, Seldon gathers the best minds in the Empire—both scientists and scholars—and brings them to a bleak planet at the edge of the galaxy to serve as a beacon of hope for future generations. He calls this sanctuary the Foundation. But soon the fledgling Foundation finds itself at the mercy of corrupt warlords rising in the wake of the receding Empire. And mankind’s last best hope is faced with an agonizing choice: submit to the barbarians and live as slaves—or take a stand for freedom and risk total destruction. Praise for Isaac Asimov and his Foundation series “A true polymath, a superb rationalist, an exciting and accessible writer in both fiction and nonfiction, Isaac Asimov was simply a master of all he surveyed.”—Greg Bear “Asimov served wondrous meals-of-the-mind to a civilization that was starved for clear thinking about the future. To this day, his visions spice our ongoing dinner-table conversation about human destiny.”—David Brin “Isaac was still in his teens when I met him, a fan of mine before I was a fan of his. Writing for John W. Campbell back in the famous ‘golden age of science fiction,’ he became one of the founders of our field. With the Robot stories and the Foundation stories, he helped to shape science fiction as we know it.”—Jack Williamson “I grew up on the ABC’s of science fiction—Asimov, Bradbury, Clarke. There’s a reason Asimov’s name comes first, and not just because of the alphabet!”—Janis Ian “With his fertile imagination, his wit, and his prolific output, Isaac Asimov truly laid the foundation for all future generations of science fiction writers.”—Kevin J. Anderson “If anything can be said to have been the launch pad for space-age science fiction, it has to be the Foundation trilogy. It’s a classic. And it’s unforgettable.”—Jack McDevitt “The Foundation series is one of the masterpieces of science fiction. If you’ve never read these novels, then you’re in for a treat, and even if you’ve already read them, then you owe it to yourself to reread them, because they’re still great.”—Allen Steele “Quite simply, Asimov got me started.”—Liz Williams", "webReaderLink": "http://play.google.com/books/reader?id=724OBAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Sirens of Titan", "categories": ["Future life"], "authors": ["Kurt Vonnegut"], "printType": "BOOK", "pageCount": 249, "ratingsCount": 54, "averageRating": 4, "publisher": null, "publishedDate": "2006", "previewLink": "http://books.google.co.in/books?id=fiiKPwAACAAJ&dq=name:The+Sirens+of+Titan&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=fiiKPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "When Winston Niles Rumfoord flies his spaceship into a chrono-synclastic infundibulum he is converted into pure energy and only materializes when his waveforms intercept Earth or some other planet. As a result, he only gets home to Newport, Rhode Island, once every fifty-nine days and then only for an hour. But at least, as a consolation, he now knows everything that has ever happened and everything that ever will be. He knows, for instance, that his wife is going to Mars to mate with Malachi Constant, the richest man in the world. He also knows that on Titan -- one of Saturn's moons -- is an alien from the planet Tralfamadore, who has been waiting 200,000 years for a spare part for his grounded spacecraft...", "webReaderLink": "http://play.google.com/books/reader?id=fiiKPwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Princess of Mars", "categories": ["Fiction"], "authors": ["Edgar Rice Burroughs"], "printType": "BOOK", "pageCount": 240, "ratingsCount": 1, "averageRating": 5, "publisher": "Modern Library", "publishedDate": "2007-12-18", "previewLink": "http://books.google.co.in/books?id=EiN1KYFo-qQC&pg=PA162&dq=name:A+Princess+of+Mars+(Barsoom,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=EiN1KYFo-qQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Virginia gentleman John Carter, unexpectedly transported to the perilous red planet, Mars, finds himself captured by the loveless Green Men of Thark. As Carter struggles to win his freedom—and the affections of fellow captive Dejah Thoris, princess of the rival clan of Helium—the fate of the entire planet hangs in the balance: warring Martian tribes collide and the beleaguered Atmosphere Factory grinds to a suffocating halt. Ray Bradbury, reminiscing on the enduring thrill of Burroughs’s Martian adventure, writes, “I stood on the lawns of summer, raised my hands, and cried for Mars, like John Carter, to take me home. I flew to the Red Planet and never returned.”", "webReaderLink": "http://play.google.com/books/reader?id=EiN1KYFo-qQC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Invisible Man", "categories": ["Fiction"], "authors": ["H. G. Wells"], "printType": "BOOK", "pageCount": 176, "ratingsCount": 3, "averageRating": 4, "publisher": "First Avenue Editions ™", "publishedDate": "2019-01-01", "previewLink": "http://books.google.co.in/books?id=RRp_DwAAQBAJ&printsec=frontcover&dq=name:The+Invisible+Man&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RRp_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A strange and reclusive scientist takes a room at a village inn. Griffin keeps his face wrapped in bandages and exhibits peculiar behaviors, such as turning his room into a laboratory, causing a stir among the locals. When he runs out of money and is told he must leave, he accidentally reveals a secret—he's invisible. Driven mad by this condition, Griffin flees to the house of Dr. Kemp, a former medical school colleague. It is only then that Griffin explains how his invisibility resulted from a disastrous experiment. As the town's suspicions grow, Griffin falls further into madness, which leads to tragic consequences. This is an unabridged version of English author H.G. Wells's science-fiction novel, which was first published in 1897.", "webReaderLink": "http://play.google.com/books/reader?id=RRp_DwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "In Jesus Name We Sing", "categories": ["Religion"], "authors": ["Fred H. Wilkins"], "printType": "BOOK", "pageCount": 32, "ratingsCount": null, "averageRating": null, "publisher": "CSS Publishing", "publishedDate": "2000-12", "previewLink": "http://books.google.co.in/books?id=zqK7foPmJ8QC&pg=PA31&dq=name:We&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=zqK7foPmJ8QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "In the rush to prepare for Sunday morning's service, does it sometimes seem like the choir isn't alway focused on the reason why they are there? Increase your choir's commitment to God by sharing some of these devotions with them just before they enter the sanctuary. After all, the choir is just a part of the overall proclamation of the gospel! And while they are responsible for the spiritual leadership of their singers, many choir directors are uncomfortable with praying \"off the cuff\". These prayers are a perfect way to finish up the warm-up rehearsal and start the service on an inspirational note.", "webReaderLink": "http://play.google.com/books/reader?id=zqK7foPmJ8QC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Windup Girl", "categories": ["Fiction"], "authors": ["Paolo Bacigalupi"], "printType": "BOOK", "pageCount": 544, "ratingsCount": 181, "averageRating": 3.5, "publisher": "Hachette UK", "publishedDate": "2012-08-07", "previewLink": "http://books.google.co.in/books?id=EQC1PUjOhWsC&pg=PT322&dq=name:The+Windup+Girl&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=EQC1PUjOhWsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Anderson Lake is a company man, AgriGen's Calorie Man in Thailand. Under cover as a factory manager, Anderson combs Bangkok's street markets in search of foodstuffs thought to be extinct, hoping to reap the bounty of history's lost calories. There, he encounters Emiko... Emiko is the Windup Girl, a strange and beautiful creature. One of the New People, Emiko is not human; instead, she is an engineered being, creche-grown and programmed to satisfy the decadent whims of a Kyoto businessman, but now abandoned to the streets of Bangkok. Regarded as soulless beings by some, devils by others, New People are slaves, soldiers, and toys of the rich in a chilling near future in which calorie companies rule the world, the oil age has passed, and the side effects of bio-engineered plagues run rampant across the globe. What happens when calories become currency? What happens when bio-terrorism becomes a tool for corporate profits, when bio-terrorism's genetic drift forces mankind to the cusp of post-human evolution?", "webReaderLink": "http://play.google.com/books/reader?id=EQC1PUjOhWsC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Lord of Light", "categories": ["Science fiction, American"], "authors": ["Roger Zelazny"], "printType": "BOOK", "pageCount": 304, "ratingsCount": 46, "averageRating": 4, "publisher": "S.F. Masterworks", "publishedDate": "2010", "previewLink": "http://books.google.co.in/books?id=7qtUPwAACAAJ&dq=name:Lord+of+Light&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=7qtUPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "Imagine a distant world where gods walk as men, but wield vast and hidden powers. Here they have made the stage on which they build a subtle pattern of alliance, love, and deadly enmity. Are they truly immortal? Who are these gods who rule the destiny of a teeming world? Their names include Brahma, Kali, Krishna and also he who was called Buddha, the Lord of Light, but who now prefers to be known simply as Sam. The gradual unfolding of the story - how the colonization of another planet became a re-enactment of Eastern mythology - is one of the great imaginative feats of modern science fiction.", "webReaderLink": "http://play.google.com/books/reader?id=7qtUPwAACAAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Island of Dr. Moreau", "categories": ["Fiction"], "authors": ["H. G. Wells"], "printType": "BOOK", "pageCount": 224, "ratingsCount": 57, "averageRating": 3.5, "publisher": "Penguin", "publishedDate": "2005-09-06", "previewLink": "http://books.google.co.in/books?id=jx-qSkMK8EAC&printsec=frontcover&dq=name:The+Island+of+Doctor+Moreau&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=jx-qSkMK8EAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "A cautionary tale of the horrors that can ensue when man experiments with nature, from the father of science fiction, H.G. Wells. A lonely island in the Pacific. The sinister scientist who rules it. And the strange beings who dwell there… This is the scenario for H. G. Wells’s haunting classic, one of his most intriguing and visionary novels. Living in the late nineteenth century and facing the impact of Darwin’s theory of evolution, Wells wrote this chilling masterpiece about the characteristics of beasts blurring as the animals turn into men. Dr. Moreau, a scientist expelled from his homeland for his cruel vivisection experiments, finds a deserted island that gives him the freedom to continue torturous transplantations and create hideous creatures with manlike intelligence. But as the brutally enforced order on Moreau’s island dissolves, the true consequences of his experiments emerge, and his creations revert to beasts more shocking than nature could devise. A genius of his time, H. G. Wells foresaw the use of what he called the “atom bomb,” the practice of gene-splicing, and men landing on the moon. Now, when these have become part of everyday life, his dark fable serves as a compelling reminder of the horrors that reckless experiments with nature can produce. With an Introduction by Nita A. Farahany and an Afterword by Dr. John L. Flynn", "webReaderLink": "http://play.google.com/books/reader?id=jx-qSkMK8EAC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Roadside Picnic", "categories": ["Fiction"], "authors": ["Boris Strugatsky", "Arkady Strugatsky"], "printType": "BOOK", "pageCount": 224, "ratingsCount": null, "averageRating": null, "publisher": "Hachette UK", "publishedDate": "2014-06-26", "previewLink": "http://books.google.co.in/books?id=Dog5AwAAQBAJ&printsec=frontcover&dq=name:Roadside+Picnic&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Dog5AwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Red Schuhart is a stalker, one of those strange misfits who are compelled by some unknown force to venture illegally into the Zone and, in spite of the extreme danger, collect the mysterious artefacts that the alien visitors left scattered around. His life is dominated by the Zone and the thriving black market in the alien products. Even the nature of his daughter has been determined by the Zone. And it is for her that Red makes his last, tragic foray into the hazardous and hostile depths.", "webReaderLink": "http://play.google.com/books/reader?id=Dog5AwAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The City and the Stars", "categories": ["Fiction"], "authors": ["Arthur C. Clarke"], "printType": "BOOK", "pageCount": 256, "ratingsCount": 3, "averageRating": 3.5, "publisher": "Rosetta Books", "publishedDate": "2012-11-30", "previewLink": "http://books.google.co.in/books?id=vUsqAAAAQBAJ&pg=PT43&dq=name:The+City+and+the+Stars&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=vUsqAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This grand space adventure explores the fate of humanity a billion years in the future— A visionary classic by one of science fiction’s greatest minds. Far in the future, Earth’s oceans have evaporated and humanity has all but vanished. The inhabitants of Diaspar believe their domed city is all that remains of an empire that had once conquered the stars. Inside the dome, the citizens live in technological splendor, free from the distractions of aging and disease. Everything is controlled precisely, just as the city’s designers had intended. But a boy named Alvin, unlike his fellow humans, shows an insatiable—and dangerous—curiosity about the world outside the dome. His questions will send him on a quest to discover the truth about the city and humanity’s history—as well as its future. A masterful and awe-inspiring work of imagination, The City and the Stars is considered one of Arthur C. Clarke’s finest novels.", "webReaderLink": "http://play.google.com/books/reader?id=vUsqAAAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Parable of the Sower", "categories": ["Fiction"], "authors": ["Octavia E. Butler"], "printType": "BOOK", "pageCount": 300, "ratingsCount": null, "averageRating": null, "publisher": "Hachette UK", "publishedDate": "2014-03-27", "previewLink": "http://books.google.co.in/books?id=dh00AgAAQBAJ&printsec=frontcover&dq=name:Parable+of+the+Sower+(Earthseed,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=dh00AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "'If there is one thing scarier than a dystopian novel about the future, it's one written in the past that has already begun to come true. This is what makes Parable of the Sower even more impressive than it was when first published' Gloria Steinem We are coming apart. We're a rope, breaking, a single strand at a time. America is a place of chaos, where violence rules and only the rich and powerful are safe. Lauren Olamina, a young woman with the extraordinary power to feel the pain of others as her own, records everything she sees of this broken world in her journal. Then, one terrible night, everything alters beyond recognition, and Lauren must make her voice heard for the sake of those she loves. Soon, her vision becomes reality and her dreams of a better way to live gain the power to change humanity forever. All that you touch, You Change. All that you Change, Changes you. What readers are saying about Octavia Butler: 'Kindred was written in 1979 but could have been written last year. Incredible. I couldn't put it down' 'Emotionally and viscerally alive and challenging. I don't know how I missed it before now' 'A masterpiece by a matchless artist. Butler is simply sublime' 'Reading these books will change your life' 'A finely crafted work, rife with emotional power, horrifying in its believability, with a message that cannot be ignored'", "webReaderLink": "http://play.google.com/books/reader?id=dh00AgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Pandora's Star", "categories": ["Fiction"], "authors": ["Peter F. Hamilton"], "printType": "BOOK", "pageCount": 888, "ratingsCount": 49, "averageRating": 4, "publisher": "Pan Macmillan", "publishedDate": "2009-08-21", "previewLink": "http://books.google.co.in/books?id=1cJkdAULRI0C&pg=PT514&dq=name:Pandora%27s+Star&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=1cJkdAULRI0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The first part of the epic Commonwealth Saga, Pandora's Star by Peter F. Hamilton is a fantastic galaxy-spanning novel from the master of space opera. Earth AD 2329: Humanity has colonized over four hundred planets, all interlinked by wormholes. For the first time in mankind's history there is peace. Then a star over a thousand light years away suddenly vanishes, imprisoned inside a force field of immense size. Only a faster-than-light starship, captained by ex-NASA astronaut Wilson Kime, can reach that distance to investigate. But there was a good reason for sealing off an entire star system. And getting in may not be as difficult as stopping something from getting out . . . The Commonwealth Saga concludes with Judas Unchained.", "webReaderLink": "http://play.google.com/books/reader?id=1cJkdAULRI0C&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Don Juan: His Own Version", "categories": ["Fiction"], "authors": ["Peter Handke"], "printType": "BOOK", "pageCount": 112, "ratingsCount": 1, "averageRating": 3, "publisher": "Farrar, Straus and Giroux", "publishedDate": "2010-02-15", "previewLink": "http://books.google.co.in/books?id=ICRr6N4OAhIC&pg=PT60&dq=name:Way+Station&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=ICRr6N4OAhIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "Nobel Prize winner Peter Handke offers a wry and entertaining take on history's most famous seducer as he takes a respite from his stressful existence Don Juan's story—\"his own version\"—is filtered through the consciousness of an anonymous narrator, a failed innkeeper and chef, into whose solitude Don Juan bursts one day. On each day of the week that follows, Don Juan describes the adventures he experienced on that same day a week earlier. The adventures are erotic, but Handke's Don Juan is more pursued than pursuer. What makes his accounts riveting are the remarkable evocations of places and people, and the nature of his narration. Don Juan: His Own Version is, above all, a book about storytelling and its ability to burst the ordinary boundaries of time and space. In this brief and wry volume, Peter Handke conjures images and depicts the subtleties of human interaction with an unforgettable vividness. Along the way, he offers a sharp commentary on many features of contemporary life.", "webReaderLink": "http://play.google.com/books/reader?id=ICRr6N4OAhIC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Timeline of the Planet of the Apes", "categories": ["Planet of the Apes films"], "authors": ["Rich Handley"], "printType": "BOOK", "pageCount": 322, "ratingsCount": null, "averageRating": null, "publisher": "Hasslein Books", "publishedDate": "2008-11", "previewLink": "http://books.google.co.in/books?id=p9dCrSQWhHMC&pg=PA103&dq=name:Planet+of+the+Apes&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=p9dCrSQWhHMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "To celebrate the 40th anniversary of Planet of the Apes, Hasslein Books announces an extensive chronology by author Rich Handley. Every film, episode, novel, comic book and more is covered, from 1968 to the present--including several unpublished works. Along with a painstakingly detailed timeline spanning millennia, this volume features a gallery of more than 350 cover images, a recommended viewing/reading order, an examination of time travel in the Planet of the Apes mythos (both on screen and in print), and a title/creator index of published fiction-plus, insightful notes discussing preliminary and discarded story concepts, inconsistencies and discontinuities, unpublished lore and other fascinating trivia.", "webReaderLink": "http://play.google.com/books/reader?id=p9dCrSQWhHMC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "The Space Trilogy: Out of the Silent Planet, Perelandra, and That Hideous Strength", "categories": ["Fiction"], "authors": ["C. S. Lewis"], "printType": "BOOK", "pageCount": 728, "ratingsCount": 5, "averageRating": 3, "publisher": "HarperCollins UK", "publishedDate": "2013-10-24", "previewLink": "http://books.google.co.in/books?id=CuChfc-gg0QC&printsec=frontcover&dq=name:Space+Trilogy:+Out+of+the+Silent+Planet+/+Perelandra+/+That+Hideous+Strength&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=CuChfc-gg0QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "This striking one-volume edition marks the 75th anniversary of Lewis’s classic SF trilogy featuring the adventures of Dr Ransom on Mars, Venus and Earth. It includes an exclusive Foreword compiled from letters by J.R.R. Tolkien, who inspired Lewis to write the first volume.", "webReaderLink": "http://play.google.com/books/reader?id=CuChfc-gg0QC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "A Deepness in the Sky", "categories": ["Fiction"], "authors": ["Vernor Vinge"], "printType": "BOOK", "pageCount": 608, "ratingsCount": 66, "averageRating": 4, "publisher": "Macmillan", "publishedDate": "2007-04-01", "previewLink": "http://books.google.co.in/books?id=GUUvxumMf6kC&dq=name:A+Deepness+in+the+Sky+(Zones+of+Thought,&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=GUUvxumMf6kC&printsec=frontcover&img=1&zoom=1&source=gbs_api", "language": "en", "description": "A Hugo award-winning Novel! “Vinge is one of the best visionary writers of SF today.” —David Brin Thirty-Thousand years before A Fire Upon the Deep, humans stand on the verge of first contact with an alien race. Two human groups: the Qeng Ho, a culture of free traders, and the Emergents, a ruthless society based on the technological enslavement of minds. The group that opens trade with the aliens will reap unimaginable riches. But first, both groups must wait at the aliens' very doorstep for their strange star to relight and for their planet to reawaken, as it does every two hundred and fifty years. More than just a great science fiction adventure, A Deepness in the Sky is a universal drama of courage, self-discovery, and the redemptive power of love. Tor books by Vernor Vinge Realtime/Bobble Series The Peace War Marooned in Realtime Other Novels The Witling Tatja Grimm's World Rainbows End Collections Collected Stories of Vernor Vinge True Names At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.", "webReaderLink": "http://play.google.com/books/reader?id=GUUvxumMf6kC&hl=&printsec=frontcover&source=gbs_api"}, {"title": "Ancillary Justice", "categories": ["Fiction"], "authors": ["Ann Leckie"], "printType": "BOOK", "pageCount": 432, "ratingsCount": 147, "averageRating": 4, "publisher": "Hachette UK", "publishedDate": "2013-10-01", "previewLink": "http://books.google.co.in/books?id=QhxCO5b7e74C&printsec=frontcover&dq=name:Ancillary+Justice+(Imperial+Radch&hl=&cd=1&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=QhxCO5b7e74C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api", "language": "en", "description": "The record-breaking debut novel that won every major science fiction award in 2014, Ancillary Justice is the story of a warship trapped in a human body and her search for revenge. Ann Leckie is the first author to win the Arthur C. Clarke, the Nebula and the Hugo Award for Best Novel in the same year. They made me kill thousands, but I only have one target now. The Radch are conquerors to be feared - resist and they'll turn you into a 'corpse soldier' - one of an army of dead prisoners animated by a warship's AI mind. Whole planets are conquered by their own people. The colossal warship called The Justice of Toren has been destroyed - but one ship-possessed soldier has escaped the devastation. Used to controlling thousands of hands, thousands of mouths, The Justice now has only two hands, and one mouth with which to tell her tale. But one fragile, human body might just be enough to take revenge against those who destroyed her. 'ENGAGING AND PROVOCATIVE' SFX Magazine 'UNEXPECTED, COMPELLING AND VERY COOL' John Scalzi 'HIGHLY RECOMMENDED' Independent on Sunday 'MIND-BLOWING' io9.com 'THRILLING, MOVING AND AWE-INSPIRING' Guardian 'UTTER PERFECTION, 10/10' The Book Smugglers 'ASTOUNDINGLY ASSURED AND GRACEFUL' Strange Horizons 'ESTABLISHES LECKIE AS AN HEIR TO BANKS' Elizabeth Bear The Imperial Radch trilogy begins with Ancillary Justice, continues in Ancillary Sword and concludes with Ancillary Mercy. Also available now: Provenance is a stunning standalone adventure set in the same world as Ancillary Justice. NPR calls it 'A fitting addition to the Ancillary world'.", "webReaderLink": "http://play.google.com/books/reader?id=QhxCO5b7e74C&hl=&printsec=frontcover&source=gbs_api"}]